COC(=O)
[C@H](CCCCN
)NC(=O)N
c1cc(OC
)cc(C(C)(C)C)c1O
C(N)CCC
[C@H](NC(=O)N
)cc(C(C)(C)C)c1
O)C(=O)OC
[C@@H](CCCCN
)(N
C(=O)N
NCCCC
c1(O)
c(NC(=O)N
)C(=O)OC
)cc(OC)cc1
C(C)(C)C
C(=O)(N
O)
N[C@@H](C
CCCN
N(C(=O)N
)C(=O)OC)
c1c(OC)cc(N
C(=O)N[C@@H](C
)c(O)c1C(C)(C)C
COc1cc(N
)c(O)c(C(C)(C)C)c1
CC(C)(C)
c1cc(OC)cc(N
)c1O
O(C)c1cc(N
c1(N
)cc(OC
O(C)C(=O)
O
c1c(N
c1c(OC
)cc(C(C)(C)C
)c(O)c1
NC(=O)N
C(CN)CC
c1(C(C)(C)C
)cc(N
C(C)(C)(C)
O=C(N
c1cccc2cnccc1
2)
c1cc([N+](=O)[O-])c(Sc2c(Cl)cncc2Cl)s1
[O-][N+](=O)
c1cc(C(=O)N
c2cccc3cnccc2
3)
sc1Sc1c(Cl)cncc1Cl
O=[N+]([O-])c1cc
(C(=O)N
c1(NC(=O)
c2cc([N+](=O)[O-]
)c(S
c3c(Cl)cncc3Cl)
s2)cc
cc2
cnccc12
n1cc(Cl
c2sc(C(=O)N
c3cccc4
cnccc3
4)cc2
[N+](=O)[O-]
)c(Cl)c1
[N+](=O)([O-])c1cc
S(
c1sc(C(=O)N
3)cc1
[N+](=O)[O-])c1
c(Cl)cncc1Cl
N(C(=O)
c1cc([N+](=O)[O-])c(S
c2c(Cl)cncc2Cl)
s1)
c1cccc2cnccc12
s1c(C(=O)N
3)cc
([N+](=O)[O-])c1
S
c1c(Cl)cncc1Cl
c1ccc(NC(=O)
s2)
c2ccncc12
c1ncc(Cl
)c1Cl
c1ccc2cnccc2c1
NC(=O)
c1([N+](=O)[O-])cc
c1(S
[N+](=O)[O-])
c1(C(=O)N
([N+](=O)[O-]
c2c(Cl)cncc2Cl)s1
c2c(Cl)cncc2
Cl)s
c(C(=O)N
c1(Cl)cncc(Cl)c1
Sc1s
CCN(CC)C
c1ccc(-c2n
c(C)c(C
Oc3cc
c(
[C@H](CC(=O)N
4
C(=O)OC
[C@@H]4C
c4ccccc4)
c4cco
n4)cc3
)s2)cc1
o1cc
c([C@@H](C
C(=O)N2C(=O)OC[C@@H]2C
c2ccccc2)
c2ccc(OC
c3s
c(-c4cc
c(CN(CC)CC
)cc4)n
c3C
)cc2)n1
c1(OC
c2sc(-c3cc
c(CN
(CC)CC)cc3
)nc2C
)ccc(
[C@H](C
c2cco
n2)cc1
c1ccccc1C[C@H]1
N1C(=O)C
[C@@H](
c1ccc(OC
)cc1)
c1ccon1
c1cccc(C
[C@H]2COC(=O)N2
C(=O)C
[C@@H](c2cc
c(OC
)cc2)
n2)c1
c1cc(-c2n
)s2)ccc1
CN(CC)CC
c1cc([C@@H](C
no1
c1(C)nc(-
c2ccc(CN
(CC)CC)cc2)
sc1
COc1ccc(
s1c(-
nc(C)c1
C(C)
N(CC)C
)ccc1
C(=O)N1
[C@@H]1C
c1ccccc1)
O(C
c1sc(-
(CC)CC
)cc2)nc1
C)
c1ccc(
c1(CO
c2ccc(
C(=O)N3
[C@@H]3C
c3ccccc3)
c3ccon3
sc(-
nc1C
n1c(-
s
c(CO
)cc2)c1C
N1(C(=O)C
c2cc
on2)
C(=O)OC[C@@H]1Cc1ccccc1
n1o
ccc1
[C@@H](C
)nc2C)cc1
C1(=O)
OC[C@H](C
Cc1n
c(-c2ccc(CN
C(c1ccccc1)
[C@H]1
CC1(C)CC
C(CN
2CCN(c3cc
c(C(=O)NS(=O)(=O)
c4cc
c(NCC
5
CN(C(C
F)C
)c([N+](=O)[O-]
)c4
)c(O
c4cn
c5[nH]cc
c5c4)c3
)CC2)
=C(
c2ccc(Cl)cc2)C1
c1cc(Cl)ccc1
C1=C(C
N
CCC
(C)(C)C1
C(F)
C(CF)
N1CC
(CN
c2ccc(S(=O)(=O)
c3ccc(N
4CCN(CC
=C(c6cc
c(Cl)cc
6
)CC(C)(C)
CC
5)CC4)cc3
c3cn
c4[nH]ccc4c3
)cc2
[N+](=O)[O-])C1
N1(CC2
c3ccc(Cl)cc3
CC2)
CCN(c2cc
CC4
)c([N+](=O)[O-])c3
)c2)CC1
C1CN(CC2
CCN1
c1ccc(C(=O)N
S(=O)(=O)
c2ccc(N
CC3
F)CF)
C3
)c([N+](=O)[O-])c2
c2cnc3[nH]ccc3
c2)c1
c1cc2cc
(O
c3cc(N
5)CC4)ccc3
C(=O)NS(=O)(=O)
)cnc2[nH]1
C1(C)(C)CC
)ccc(N
2CCN(CC3
c4ccc(Cl)cc4)CC
(C)(C)
)CC2)cc1
Oc1cn
c2[nH]ccc2c1
c1ccc(N
CC2
C2)
c([N+](=O)[O-])c1
)c1ccc(N
C1C(CN
)cc2[N+](=O)[O-]
)CN1
C(C
F)CF
c1(Cl)ccc(C2
=C(CN
3CCN(c4cc
c5cc
)c5
c5cn
c6
[nH]cc
c5)c4
)CC3)CC
2)cc1
C(=O)(NS(=O)(=O)
c12ncc
)c3)cc1
cc[nH]2
)S(=O)(=O)
c2)cc1
N1CCN(CC
2
CC2)CC1
c1nc2[nH]cc
c2cc1
Oc1cc(N
)CC2)ccc1
C(N
c1ccc(S(=O)(=O)
3CCN(CC4
c5ccc(Cl)cc
5)CC
(C)(C)CC
4)CC3
)cc2O
F)C1
O=S(=O)(NC(=O)
c1cc(C2
2)ccc1Cl
CCO
c1ccc(O
c2ncnc3c2cnn3
C2CCN(C(=O)OC
3CCCC3)CC2)
c(F)c1
n1(C
2CCN(C(=O)OC
ncc2
c(O
c3ccc(OCC)cc3
F)n
cnc21
C1CCCC1
OC(=O)
N1CCC(
n2ncc3c(Oc4cc
c(OCC
)cc4
cnc3
2)CC1
C1CC(
2)CCN1
1CCCC1
N1(C(=O)OC
2CCCC2)CC
C(
c1cc(OCC
)cc(F)c1
c1ncnc2
c1cnn2
C1CCN(C(=O)OC
2CCCC2)CC1
c1(O
3CCCC
3)CC2)cc
)cc1F
C1CC
C(OC(=O)
N2CCC(
n3ncc4
c(Oc5cc
)cc5
F)ncn
c4
3)CC2)C1
C1CN(C(=O)OC
2CCCC2)
CCC1
n1ncc2
c1c(OCC
)ccc(O
3)CC2)c1
F
c1nc(O
c2ccc(OCC
)cc2F)
c2cnn(C
3CCN(C(=O)OC
4CCCC
4)CC
3)c2n1
Fc1cc(OCC
)ccc1O
C(C)O
n1cc2
c3ccc(OCC
)cc3F)
ncnc2
n1
c12cnn(C
4CCCC4)CC3
)c1ncnc2
Oc1ccc(OCC
n1cn
c2c(cnn2
C1(
cnc32)
CCN(C(=O)OC
Cn1cn
c(-c2cc
(C#N
)ccn2)c1
-
c1ccc(-n2cccn2)cc1
n1cccn1-
c1ccc(-c2c(-c3cc
)ccn3
)ncn
2C)cc1
N#C
c1ccnc(-
c2ncn
(C)
c2-
c2ccc(-n3cc
cn3)cc2)c1
c1cnn(-c2cc
c(-c3
c(-c4cc(C#N
)cc
n4)n
cn3C
)cc2)c1
n1cc
c(C#N)cc1
-c1n
cn(C)
c1-
c1(C#N)cc
nc(-
c1nc(-c2cc
(C#N)ccn2)
c(-n3cc
cn3)cc2)
n1C
c1cc(-c2c(-c3cc
)ncn2C
)ccc1-
n1cccn1
c1(-c2c(-c3cc
)ccc(-
n2cc
cn2)cc1
n1cn(C)
c1cc(C#N)ccn1
c1ccnn1-
n1(C)cn
c1c(C#N
)ccnc1
c1(-c2cc
ncn
(C)c1-
ncn1C
c1cnc(-c2n
cn3
)cc2)cc1
C#N
C(#N)
c1cc(C#N
)cc(-
c1cc(-n2cc
cn
2)ccc1-
c1c(-c2cc
2CCCCO2)
c(-c2ccc(OC
c3ccc4ccccc4n3
)ccc(OC
2CCCCO2)c1
c2ccc3ccccc3n2)cc1
c1cc(-c2cc
)ccc2OC
2CCCCO
2)ccc1OC
c1ccc2ccccc2n1
C1CCCC(O
c2ccc(C#N)cc2
)cc2)O1
O(
c1ccc(C#N)cc1
)C1CCCCO1
c1(COc2cc
c(-c3cc
(C#N)ccc3
OC3CCCCO
3)cc2
c2ccccc2n1
c1cc(COc2cc
3)cc2)
nc2ccccc12
c12ccccc1nc(C
Oc1cc
)c1ccc(-c2cc
2CCCCO2)cc1
c1cccc2nc(C
)ccc4
OC
4CCCCO4)cc3
)ccc12
c12ccccc1ccc(C
)n2
C1CCC(O
)cc2)OC1
C1CCOC(O
)cc2)C1
c2ccc3ccccc3
n2)cc
n2
c1cc(C#N)ccc1
OC1CCCCO1
c1ccc2ccc(C
)nc2c1
c1cccc2cc
c(COc3cc
)nc12
2CCCCO2)cc
c1cc2ccccc2nc1
COc1ccc(-c2cc
COc1ccc(C
(O)C
c2c(Cl)c[n+]([O-])cc2Cl
)c2c1
OC1
(CCC
C1)O2
c1cc(OC)c2c(c1
C(O)C
c1c(Cl)c[n+]([O-])cc1Cl)
[O-][n+]1
cc
(Cl)c(C
C(O)
c2ccc(OC)c3c2
OC2
(CCCC
2)O
3)c(Cl)c1
c1(Cl)
c[n+]([O-])cc(Cl)c1
CC(O)
c1ccc(OC)c2c1
O(C)c1ccc(C
[n+]1([O-]
)cc(Cl)c(C
c12c(C
c3c(Cl)c[n+]([O-])cc3
Cl)cc
c(OC)c1
C1CCC2
(C1
)O
c1c(OC)ccc(C
Cl)c1
O2
2O
O1
c2c(OC)ccc(C
Cl)c2
2CCCC2
Clc1
c12
c(OC)ccc(C
c1cc(C(O)C
)c2c(c1
)OC1
c2c(C
c(OC)c2
OC(C
c1(C(O)C
c2c(Cl)c[n+]([O-]
)cc2Cl)cc
c(OC)c2c1
c1c(Cl)c(C
c(Cl)
c[n+]1[O-]
CC(C)(C)OC(=O)N
c1ccc(Br)cc1Cl
NC(=O)OC(C)(C)C
)c1ccc(Br)cc1
Cl
)ccc(Br)cc1
c1cc(Br)cc(Cl)c1
)c(Cl)cc1
Br
c1(Br)ccc(C(=O)N
c1c(Br)cc
c1(Cl)cc
(Br)ccc1
c1cc(Br)ccc1
(NC(=O)OC(C)(C)C)C(=O)
N(NC(=O)
)C(=O)OC(C)(C)C
c1ccc(Br)cc1
Cl)
OC(C)(C)C
O(C(=O)N
)C(C)(C)C
C(C)(C)(C)OC(=O)N
CCOP(=O)
(COC
c1nc2c(N)n
cnc2
n1CC
c1ccccc1)OCC
c1nc(N)c2
nc(C
P(=O)(OCC)OCC
)n(CC
c3ccccc3)c2n1
n1c(C
)nc2c(N)n
)c1ccccc1
O(CC)
P(=O)
c1ccccc1)C
C(C)OP(=O)
c1ccccc1CC
C(Cc1ccccc1
)n1
c(COC
c1(N)ncnc2
c1nc(C
)n2CC
c1ccccc1
C(OC
)c1nc2
c(N)n
n1cnc(N
)c2nc(C
c3ccccc3)c12
c12nc(C
c3ccccc3
)c1ncnc2N
c1(CC
n2c(C
)nc3
c(N)ncnc3
2)ccccc1
n1cnc2c(
c2ccccc2)c1N
c1cccc(CC
2)c1
c2ccccc2)c2
ncnc(N)c12
c12ncnc(N)c1
O=C(O)CO
NC(=O)NC
c1cccc2ccccc12
c1cccc2cccc
(CNC(=O)N
OCC(=O)O)
c1ccc2c(C
cccc2c1
C(NC(=O)N
c1cc(CN
c2ccccc2c1
O=C(NC
c1cccc2ccccc1
2)N
OCC(=O)O
OC(=O)CO
(OCC(=O)O)
C(=O)NC
C(O
c1cccc2ccccc12)
C(=O)O
N(C
c1cc
c2cccc(CN
c2c1
c12ccccc1c(C
OCC(=O)
O)ccc2
c12ccccc1cccc2
CNC(=O)N
O(CC(=O)O)
c1cccc2
O)cc
cc12
c1(CN
cccc2
ccccc12
C(=O)(NC
c1ccc(CNC(=O)N
c2ccccc12
c1ccc2ccccc2c1
CCOC(=O)
c1nn
[nH]c1
C(=O)
c1ccc(OC)c(OC)c1
c1(C(=O)
c2ccc(OC)c(OC)c2
)[nH]
nnc1
C(=O)OCC
c1cc(OC)c(OC)cc1
C(=O)c1[nH]
c1(OC)cc
(C(=O)
c2[nH]
nnc2
C(=O)OCC)ccc1OC
)ccc(OC)c(OC)c1
O=C(OCC
)c1nn
C(=O)(OCC)c1nn
COc1cc(C(=O)
C(C)OC(=O)
c1cc(C(=O)
)cc(OC)c1OC
[nH]1nn
c(C(=O)OCC)c1
c1(C(=O)OCC
)nn
O(C)
n1n
c(C(=O)OCC
)c(C(=O)
c2ccc(OC)c(OC
)c2)[nH]1
n1n[nH]
c(C(=O)
c2ccc(OC)c(OC)c2)c1
c1c(C(=O)
)ccc(OC)c1OC
O(CC)C(=O)
O=C(
)c1[nH]
C(=O)(
CNC(=O)
[C@@H](NC(=O)CNC(=O)
[C@@H]1CCCN1C(=O)
[C@@H](NC(=O)OCc1ccccc1)C(C)C
)C(C)C
[C@H](C(=O)N1CCC[C@H]1
C(=O)NCC(=O)N
[C@H](C(=O)N
CC(=O)OC
)C(C)C)
OCc1ccccc1
C(C)(C)
[C@H](NC(=O)
[C@@H](NC(=O)OCc1ccccc1
C(NC(=O)
[C@@H](NC(=O)OCc1ccccc1)
N1CCC[C@H]1C(=O)N
CC(=O)N
)C(C)C)C(C)C
N(CC(=O)N
)C(=O)
O=C(CNC(=O)
c1ccc(COC(=O)N
2CCC
[C@H]2C(=O)N
)C(C)C)cc1
c1(COC(=O)N
)ccccc1
c1ccccc1COC(=O)N
C1CC[C@@H](C(=O)N
N1C(=O)
C(=O)(CNC(=O)
CC(C)
[C@H](NC(=O)OCc1ccccc1
)C(=O)N1CCC[C@H]1
)N
c1cccc(COC(=O)N
)C(C)C)c1
c1ccc(CN2CC
C(NC
c3c[nH]
3)CC2)cc1
C1(NC
c2c[nH]cn2)
CCN(Cc2ccccc2)CC1
c1c[nH]cn1
)C1CCN(Cc2ccccc2)CC1
c1cccc(CN2CC
C1CC(NC
CCN1Cc1ccccc1
c1ccccc1CN1CC
c2c[nH]
cn2)CC1
N1CCC(NC
C1CN(Cc2ccccc2)CCC1
NC
2CCN(Cc3ccccc3)CC2)
c[nH]1
c1(CN2CC
3)CC2)ccccc1
N1(Cc2ccccc2)CC
c1(CNC
c[nH]cn1
C1CCN(Cc2ccccc2)CC1
)c1c[nH]
cn1
n1c[nH]cc1
CN
c1[nH]cnc1
[nH]1cn
c(CNC
2CCN(C
c3ccccc3)CC2)c1
c1ccc(OCc2ccccc2
)c(Br)c1
c1ccc(O)cc1
Br)c1ccccc1
c2ccc(O)cc2
Br)ccccc1
c1ccccc1CO
c1cccc(CO
Br)c1
c1ccc(CO
Br)cc1
O(Cc1ccccc1)
c1(OCc2ccccc2
)ccc(O)cc1
c1cc(O)cc
(Br)c1
c1cc(OCc2ccccc2
)c(Br)cc1
c1(O)cc
c(OCc2ccccc2
c1c(O)cc
c(OCc2ccccc2)c1
c1(Br)cc
(O)ccc1
c1cc(O)ccc1
n1nc(-
c2ccc(O)cc2)
c2cccc(Cl)c21
c1(Cl)cccc2
c(-c3ccc(O)cc3
)nn(C
(C)C)c12
c1ccc(-c2nn(C
(C)C)c3
c(Cl)cccc2
c12cccc(Cl)c1
n(C(C)C
)nc2-
c1(-c2nn(C
c(O)cc1
c1cc(-c2nn(C
3)ccc1O
-c1nn(C
(C)C)c2
c(Cl)cccc12
c(-c2nn(C
n1(C(C)C
)nc(-
c12c(Cl)cccc1
c(-
)nn2
C(C)C
c1ccc(Cl)c2
c1c(-
c2cccc(Cl)c2
c1cc(Cl)c2c(c1
)c(-
c1(-
c2ccc(O)cc2)n
n(C(C)C)c2
c1ccc2c(-c3cc
c(O)cc3
(C)C)c2c1
Cc1ccccc1
2Cc3ccccc3
c3ncccc3
c1cnc2c(c1
)N(C(=O)
C)cc1
)Cc1ccccc1
S2
c12ccccc1
CN(C(=O)
c3ccccc3C
c1cccnc1
c2ccccc2C
N1C
c2ccccc2S
c2ncccc21
c1ccccc1C)
c2ccc(C(=O)N3C
c4ccccc4
c4ncccc4
3)cc2)ccccc1
C
c1ccnc2c1
N1(C(=O)
c2ccc(NC(=O)
)cc2)C
n1cccc2c1
Sc1ccccc1
CN2C(=O)
c2ccccc2C)cc1
c1ccc(C)
3)cc2)c1
c1ccc2c(n1
)S
S1
c2ccccc2
c2cccnc21
c12ncccc1
c1(C)ccccc1
c1cccc2c1S
c1ncccc1
)C2
c1cc(NC(=O)
C(=O)N1C
C1c2ccccc2
c2ncccc2
c1cccc2c1
c(C)c1
c1cccc(C(=O)N
c1C
FC(F)(F)
c1ccc(N2CC
c3ccccc32)
c(Br)c1
c1(C(F)(F)F)cc
c(N2CC
O1CCN(
c2ccc(C(F)(F)F)cc2
Br)
c2ccccc21
c1cc(C(F)(F)F)cc
N1CCO
(C(F)(F)F)ccc1
N1(
)CCO
OCCN2
c1ccc(C(F)(F)F)cc1
C(F)(F)(F)
C1CN(
c2ccccc2O1
c1ccc2c(c1)OCC
N2
c1cc(C(F)(F)F)ccc1
c1(N2CC
c3ccccc32)cc
c(C(F)(F)F)cc1
N(
Br)CC
c1c(C(F)(F)F)cc
c3ccccc32)c1
c1cc(N2CC
c(Br)cc1
C(F)(F)F
C1CO
c2ccccc2N1
c1ccc2c(c1)N(
CC(C)S
c1ncccc1F
c1(SC
(C)C
)ncc
cc1F
F)
C(C)(C)S
c1(F)cc
cnc1
SC(C)C
c1ccn
c(SC
(C)C)c1F
c1cn
)c(F)c1
c1ccc(F)
(C)C)n1
n1cccc
(F)c1
COC(=O)C(C)(C)C
N1CCN(C
2=N
n3cc
(C)cc3
c1c(Cl)ccc2
(C)cc1
(C)(C)C(=O)OC
)CC1
)=N2
O=C(OC
C1CN(CC
)CCN1
C1=N
c2ccc(Cl)cc2C
n2cc(C)
cc21
c12cc(Cl
)ccc1N
)CC1)
c1cc(C)
C2
C(=O)C(C)(C)C
C(C)(C)(C
c1(C)cc2
n(c1
)C
c1cc(Cl)ccc1N
=C2
C(N1CCN(C
)C(C)(C)
CC(C)(C
c1(Cl)ccc2c(c1
c1cc(Cl)cc2
c1N
C1
c2cc(Cl)ccc2
N=C(N
2CCN(CC
c2cc(C)
cn21
c12cc(C)
cn1C
c1ccc2c(c1)C
C1CN(C
CC(C)(C)C(=O)OC
C(=O)(OC
CCN(
c1nc(F)ccc1
NC(C)C
)C1CCNCC1
CC(C)N
c1ccc(F)nc1
N(CC
N1CCC(N
(CC
)c2n
c(F)ccc2
c(NC
(C)C)c(N
(CC)C
2CCNCC2)n1
c1cc(NC
2CCNCC2)nc1
N(c1n
c(F)ccc1
C1CC(N
2CCNCC2)n
C1(N
)CCNCC1
c1(NC(C)C
)ccc(F)
nc1
C1CNCCC1
)c1n
c1ccc(NC
n1c(F)cc
c(N
C(C)C)c1
c1cc(F)
nc(N
2CCNCC2)c1
C(C)(C)N
N(CC)
(
O=C1NC(=O)
/C(=C/
c2cnn3
4CC4
)cc(NC
4CCCC4
)nc23)
N1
C1CC1
Nc1cc(N
C2CCCC
2)n
c2c(
/C=C3\
C3=O)
cnn12
c12nc(N
C3CCCC
(NC
3CC3
)n1ncc2
/C=C1\
NC(=O)NC1=O
O=C1N
/C1=C\
3)nc12
c2cc(NC
3CC3)n
3ncc
/C=C4\
4=O)
c3n2)
CCCC1
c1nn2
3)nc2c1
n1cc(
/C=C2\
C2=O)
c2nc(N
)n12
C1(=O)NC(=O)
C1CCC(N
c3n2)C1
C1CCCC1N
2CC2)
n2ncc
c2n1
N(c1cc(N
cnn1
2)C1CC1
C(=O)NC(=O)
/C1=C/
c1(/C=C2\
cnn2
c2cc(N
C3CCCC3)n
c3c(
3)CC1
C1(=C\
\
C2CCCC2)cc
(NC2CC2)
C1(=O)NC(=O)N
COC
c1cc(Cl)cc(Cl)c1
C(OC)
C(=O)(OC(C)(C)C)
C(OC)O
O(C(=O)
C(C)(C)(C)OC(=O)
CC(C)(C)OC(=O)
O=C(OC(C)(C)C)
)C(OC
(OC
(Cl)cc(Cl)c1
c1c(Cl)cc(Cl)cc1
c1(Cl)cc(Cl
)C(=O)OC(C)(C)C)c1
Clc1cc(Cl
c1c(Cl)cc(OC
)cc1Cl
O(C)C
c1cccc([N+](=O)[O-])c1
C(N)
)cccc([N+](=O)[O-])c1
c1ccc([N+](=O)[O-])cc1
)cc([N+](=O)[O-])c1
c1ccc(CN)cc1
cc(CN)c1
[N+](=O)([O-])
c1cccc(CN)c1
O=[N+]([O-])
c1c(CN)cccc1
C#C
c1co
c2ccc(C(=O)N
[C@H]3CN4CCC3CC4
)cc12
c1c(C(=O)N
[C@H]2CN3CCC2CC
3)ccc2
o
cc(C#C
)c12
C1CN2CCC1
[C@@H](NC(=O)
c3o
)c3c1
c1cc2o
)c2cc1
[C@H]1CN2CCC1CC2
C1CC2CCN1C
[C@@H]2NC(=O)
c1ccc2o
c1o
[C@H]3CN4CCC3CC
c1C#C
o1
)
c2cc(C(=O)N
C(#C
)c1co
[C@H]1CN2CCC1CC2)
N12CCC(CC1)
c(C#C
)co
C12CCN(CC1)C
c12cc(C(=O)N
occ2
c1(C#C
C1[C@H](NC(=O)
c2ccc3o
)c3c2
2CCN1CC2
(C
OCCO
S(C)(=O)=O)
c1cccc(Cl)c1
c1ccc(Cl)cc1
C(COCCO
OC(C)=O
O=C(C)
c1(C(C
OC(C)=O)
cccc(Cl)c1
CS(=O)(=O)
OCCOCC
(OC(C)=O)
C(C)(=O)
C(OCC
OS(C)(=O)=O)
C(OC(C)=O)
O(C(C)=O)
c1c(Cl)cccc1
C(COCC
)OS(C)(=O)=O
O(CCOCC
)S(C)(=O)=O
C(COS(C)(=O)=O)
OCC
O=S(C)(=O)
c1ccc(C(C
cc1Cl
c1cc(Cl)cc(C
OC(C)=O)c1
Clc1cccc(C
S(C)(=O)(=O)
c1ccco1
)N1CCC(C
CO
c2ccc3cc
2CCc2cncc(c2)Nc2ncc(Cl)c(n2)N
N1CCC(CCO
CC1
CCN(C(=O)NC
c2ccco2)CC1
)c1cc
c2cc1CC
c1cncc(c1)Nc1ncc(Cl)c(n1)N2
c12cc(
C1CCN
(C(=O)NC
c3ccco
)Nc1nc(
ncc1Cl)N
c1cncc(c1
)CC2
c1ccoc1
(Cl)c2
nc1N
)CCc1cc(ccc1
)N2
C1CC(CC
Oc2cc
c3cc
3)CCN1
C1CN
c2ccco
2)CC
(Cl)c(
n1)N
c1ccc(OCC
C3CCN
c4ccco
)c(c1)CC
Clc1cn
c2nc1N
c2cncc
c2)CC
c2cc(ccc2
C2CCN
3)CC2)
c2n
c1ncc2
c12cncc
(c1
ncc1Cl
)c(
c2cncc(c2
c2ncc
(Cl)c1
c1ccc2cc1CC
Nc1nc(
)CC
C1(CC
3)CC
N(C(=O)NC
)c1ccco1
n1cc2cc
)Nc1ncc(Cl)c(n1)N
)c(c1
O=
C1CN(c2ccncc2)
c1ccc(OCc2ccccc2)cc1
n1ccc(N
c(OCc4ccccc4)cc3
C2)cc1
C1CN(c2cc
c(OCc3ccccc3)cc2)
CN1
c1ccncc1
c1cnccc1
N1CCN(c2cc
C(=O)C1
Oc2ccc(N
3CCN(
c4ccncc4)CC3
=O)cc2)c1
CC(=O)N1
c1cc(OCc2ccccc2)ccc1
N1CCN(c2ccncc2)CC1
=O
CN(c2cc
ncc2)
c1(COc2ccc(N
=O)cc2)ccccc1
c1cc(N
2CCN(c3ccncc3
=O)ccc1
=O)cc
c(OCc2ccccc2)cc1
)CC2=O)cc1
)C(=O)C2
)ccn1
c1(N2CCN(c3cc
)ccncc1
CCC(N
CCCNC(=O)OC(C)(C)C
n2cccc2
c(=O)n1Cc1ccccc1
CCNC(=O)OC(C)(C)C
)C(CC
(N
c1cc2c(=O)n(C
c3ccccc3)c(C
(CC)N
)nn2c1
N(CCCN
C(CC
CC(C)(C)OC(=O)NCC
)n(C
c2ccccc2)c(=O)
cn12
)nn3
cccc3
c2=O)c1
c1ccccc1Cn1
c(C
c1=O
O=c1
c2cccn2
)n1Cc1ccccc1
c1ccc2c(=O)n(C
)nn12
C(CNC(=O)OC(C)(C)C
)CN
C(CCN
)NC(=O)OC(C)(C)C
c(=O)n1C
c1ccccc1)OC(C)(C)C
c1(=O)
c2ccccc2)c(C
c12cc
c1ccccc1)c2=O
CC(=O)
c1ccccc1O
c1cnn(C
(CC2CCCC2)
C(=O)O)
c(=O)c1
CC(C(=O)O)
n1ncc
(Oc2ccccc2
C(C)=O)cc1
C(CC1CCCC1
ncc(O
C(CC1CCCC1)
(C(=O)O)
c1(Oc2ccccc2
C(C)=O)
cnn(C
C(=O)(O)
C1CCC(CC
(Oc3ccccc3
C(C)=O)cc2
=O)C1
cc(O
)C(=O)O
c1cccc(O
3CCCC3
)C(=O)O)
c(=O)
C(C)=O
c1cc(Oc2ccccc2
O=C(O)
(C)=O)c1O
c(=O)c2
c1c(Oc2ccccc2
n1cc(O
C(C)=O)cc
(=O)n1
c1nn(C
c(=O)cc1
Oc1ccccc1
c1(C(C)=O)
ccccc1
c1ccc(Cl)c(-c2ccccn2)c1
c1ccc(-n2cn
cn2)nc1
c1(-c2cc(NC(=O)
c3ccc(-n4cn
4)nc3
)ccc2Cl
)ccccn1
c2ccc(-n3cn
cn3)n
c2)cc
c(-c2ccccn2)c1
n(-c2cc
c3ccc(Cl)
c(-c4cccc
n4)c3
)cn2)c1
c1(-c2ccccn2)cc
(NC(=O)
3)nc2
)ccc1Cl
c1ncn
n1-
c2ccc(Cl)c(-c3ccccn3
)c2)cn1
n1ccccc1-
n1cc(C(=O)N
)c2
n1cncn1
cn1-
Clc1ccc(NC(=O)
-c1ccccn1
c1cccc(-c2cc
)ccc2
Cl)n1
c1cc(Cl)
c(-c2ccccn2)cc1
)cnc1-
c1n
c(-n2cn
cn2)ccc1
c1c(NC(=O)
c2)ccc(Cl)c1
c1ccc(-c2cc(NC(=O)
Cl)nc1
n1(-c2cc
)cn2)
cncn1
c1cc(-n2cn
cn2)
ncc1C(=O)N
C=C1
C(=C
C1=C2CC
(C(C)=O)
C1CC2
=C(C
C1OC2
)C1=C
C1(C
(C)=O)
CCC2
=C(C1
)C1
O=C
(C)C1
C1C2
C12
=C(CCC
C12=C(C
(C)=O)CC1
C1CC(C
=C1
(=C
2CCC(C
(C)=O)C1
O1C2
C(=C)
C1=C
=C2CC
=C)
C=CC
C(=CC(=O)OCC
=CC(=O)OCC
c1cc(CC
)ccc1Br
c(CC
=CC(=O)OCC)cc1
Brc1ccc(C
C=
CC(=O)OCC)cc1
C(=CC
)C(=O)OCC
C(=O)(C
=CC
)OCC
C(C)OC(=O)C
O=C(C
CC(C)(C)OC(=O)N1CCN(c2n
c(-c3ccnc(NC
4CCOCC4)c3
)cc3cn
ccc23)CC1
c(-c2cc3
3CCN(C(=O)OC(C)(C)C)CC
3)n2)cc1
NC1CCOCC1
O1CCC(N
c2cc(-c3cc
cncc
c4c(N
4CCN(C(=O)OC(C)(C)C)CC4)n
n2)CC1
n2)
CCO1
C1CN(C(=O)OC(C)(C)C)CCN1
nc(NC
3CCOCC3)c2
N1CCN(c2n
n1ccc2c(N
3CCN(C(=O)OC(C)(C)C)CC3)n
)cc2c1
C1COCCC1N
c1cc(-c2cc3
3CCN(C(=O)OC(C)(C)C)CC3)n2)cc
)cc2cn
ccc2
2CCN(C(=O)OC(C)(C)C)CC2)n1
c1(N2CCN(C(=O)OC(C)(C)C)CC2)
nc(-c2cc
c1(-c2cc3
2CCOCC2)c1
c1(NC
2CCOCC2)cc
(-c2cc3
)nc(N
2CCN(C(=O)OC(C)(C)C)CC2)
n1c(-c2cc
N1CCN(C(=O)OC(C)(C)C)CC1
N1(c2n
3)CCN(C(=O)OC(C)(C)C)CC1
CN1C
c2cc(Cl)ccc2-
c(Br)n
nc2C1
N1(C)C
nc2
n1c(Br)n
CN(C)C2
c12ccc(Cl)cc1
CN(C)C
c(Br)n1
-2
c1cc(Cl)cc2c1-
c1cc2c(cc1
Cl)C
N(C)C
)CN(C)C
c1c(Cl)ccc2c1
n12
c1cc(Cl)ccc1-2
c12nn
-c1ccc(Cl)cc1
c(Br
)n2c1
n1nc2n(c1
c1(Br)n
n1-c1ccc(Cl)cc1
c1nnc2
nc(Br
)n2-
c2ccc(Cl)cc2
CN(C)C(=O)
[C@@H]1CCCN1C(=O)OCc1ccccc1
[C@@H]1(C(=O)N
(C)C)CC
CN1C(=O)OCc1ccccc1
c1ccccc1COC(=O)
N1CCC[C@H]1
C(=O)N(C)C
N(C)(C)C(=O)
C1C[C@@H](C(=O)N
(C)C)N
(C(=O)OCc2ccccc2)C1
c1ccc(COC(=O)
N2CCC
(C)C)cc1
c1cccc(COC(=O)
(C)C)c1
(C)C)c1ccccc1
c2ccccc2)CCC
)N(C)C
(C)C)
N1C(=O)OCc1ccccc1
C(=O)(OCc1ccccc1)
O=C(OCc1ccccc1)
(C(=O)OCc2ccccc2)
[C@@H]1
O(Cc1ccccc1)C(=O)
CCOC(=O)C
c1ccc(OC)c(O
c2ccc([N+](=O)[O-]
)cc2C
SCC
(F)(F)F)c1
c1c(CC(=O)OCC
)ccc(OC)c1
Oc1ccc([N+](=O)[O-])cc1
CSCC
(F)(F)F
c1(CC(=O)OCC
C(SCC
(F)(F)F)
c1cc([N+](=O)[O-])ccc1O
c1cc(CC(=O)OCC)ccc1OC
C(SC
c1cc(CC(=O)OCC
OC)C(F)(F)F
C(C(=O)OCC)
c1(Oc2cc
(CC(=O)OCC
OC)cc
c([N+](=O)[O-])cc1
c1cc([N+](=O)[O-]
)cc(C
Oc1cc(C
c1cc(Oc2cc
)ccc2OC)c(C
(F)(F)F)cc1
c1(OC)ccc(C
C(=O)OCC)cc1
CSC
c1c([N+](=O)[O-]
)ccc(Oc2cc
OC)c1
S(C
)CC(F)(F)F
O(CC)C(=O)C
CCN(S(=O)(=O)
c2cccc3
O=C(NCC1
)OC(C)(C)C
(CNC(=O)OC(C)(C)C
(Cl)c12
C1CN(S(=O)(=O)
C(=O)OC(C)(C)C
C1CCN(S(=O)(=O)
c1(S(=O)(=O)N
)CC2)cc
C1(CN
)CCN(
C(=O)(NCC1
cc2cccc
(S(=O)(=O)N
3CCC(C
)CC3)c12
c1(Cl)cn
c1cc(S(=O)(=O)N
c2c(Cl)cn
cc2c1
cccc
)CC3)c2c1
(Cl)c2c1
N1CCC(C
NC(=O)OC(C)(C)C)CC1
c1ncc
c(S(=O)(=O)N
)CC3
)cccc12
)cccc2c1
[C@@H]2CC[C@@H](O)CC2)
[C@@H]1(N
c2ccc(C(=O)OCC)cc2
[N+](=O)[O-])CC
[C@@H](O)CC1
c1cc(C(=O)OCC
N[C@@H]1CC
C1C[C@H](N
[C@H]1O
[C@@H]1CC[C@@H](N
[N+](=O)[O-])CC1
(C(=O)OCC
[C@@H]1CC[C@@H](O)CC1
[C@@H]1(O)CC
[C@@H](N
C1C
[C@@H](O)CC
Nc1ccc(C(=O)OCC)cc1
c1c(C(=O)OCC
[C@@H]2CC[C@@H](O)
CC2)c1
c1cc(C(=O)OCC)ccc1N
C1C[C@H](O)CC
c1ccc(C(=O)OCC)cc1
C(=O)(OCC)
O=C(OCC)
c1cc(C(F)(F)F)cc(C(F)(F)F)c1
[C@@H]1CCCC
NC1CCN(C
c1(C(F)(F)F)cc(C(F)(F)F)cc
(OC)c1
)c(C(=O)N
[C@@H]2CCCC[C@@H]2
2CCN(C(C)=O)CC2)
c(C(F)(F)F)c1
)cc(C(F)(F)F)cc1C(F)(F)F
[C@H]2CCCC
[C@H]2NC(=O)
c2c(OC
)cc(C(F)(F)F)cc2
C(F)(F)F)
CCN1C(C)=O
)c1c(OC
(OC)
2CCN(C(C)=O)
C1CC[C@H](N
C2CCN(C(C)=O)CC2)
C(F)(F)F)C1
C(F)(F)F)CC1
N1(C(C)=O)
FC(F)(F)c1cc(C(F)(F)F)cc
C1CN(C(C)=O)CCC1
N[C@H]1CCCC
[C@H]1NC(=O)
c1c(OC)cc(C
(C(F)(F)F)
[C@@H]1(NC(=O)
CCCC[C@@H]1
c1(OC)cc(C
(F)(F)F)cc
(C(F)(F)F)c1
C2CCN(C(C)=O)
CC2)C1
CCCCC
c1nc2c(N)nc3ccccc3c2n1
CCCCN
S(=O)(=O)c1ccccc1
C(CCC)C
CCCC)n
(CCCCN
c3ccccc3)c1
nc2N
c1cccc2c1nc(N
)c1nc(C
c1ccccc1S(=O)(=O)N
CCCC
)nc2c(N)nc3ccccc3c21
c1cccc(S(=O)(=O)N
)nc3c(N)nc4ccccc4c3
C(CCCN
c(CCCCC
c12c(nc(C
c1ccccc12
c1ccc2nc(N
)c3n
)n
c4ccccc4)c3
c1(CCCCC
c3ccccc3c2n1
c1ccc2c(c1)nc(N)c1nc(C
S(=O)(=O)(N
C(CC)CC
c1cccc2nc(N
N(CCCC
)S(=O)(=O)c1ccccc1
c1c(N)n
CC(C)C
n1c(=O)
n(C)c(=O)
c2c(-c3cc
CCN
)cn3C
c3c[nH]c4cc
c(Cl)cc3
)nc21
Cn1c(=O)
4)n
c2n(CC
(C)C)c1=O
N(CCN
c1cc(-c2c3c(
=O)
n(CC
c3n
n2C
c2c[nH]c3ccc(Cl)cc2
3)n
(C)c1
CCNC(=O)
[nH]cc(C
n3n
c4c(c3
c3cc(C(=O)N
)c(=O)n(C)c(=O)
n4CC
c2c3c(=O)
3)n1
c1(-c2cc(C(=O)N
)cn2C
c(=O)n(C)c(=O)
nn1C
c1c[nH]
c2ccc(Cl)cc12
c1(=O)n(C)c(=O)
)nc2n1
c12c(-c3cc
(CC(C)C
)c(=O)n(C)c2
CCNC
n1c2c(
)n1C
c(Cl)cc1
3)c(=O)
n2CC(C)C
c1ccc2[nH]cc(C
C(c1c[nH]
c2ccc(Cl)cc1
2)n1
n
c2c(c1-
)cn1C
nn(C
4)
)c1
[nH]1cc(C
n2n
c3c(c2
n3CC
c2cc(Cl)ccc12
)cn
c1c2c(=O)
Cn1cc
C(C)C)cc1
c1(Cl
)ccc2[nH]cc(C
)NC(=O)
N(CCNC(=O)
C(c2ccccc2)(c2ccccc2
)C(=O)N1CC
CN1CCN
(c2ccccc2)CC1
N1C(=O)N(C
2CCN(c3ccccc3)CC2)
(c1ccccc1)c1ccccc1
c1ccc(C2
(c3ccccc3)N
C(=O)N(C
CCN3CCN(
c4ccccc4)CC3
)C2=O)cc1
c1(N2CCN(C
CCN3
C(=O)NC(
c4ccccc4)(
c4ccccc4)C3
=O)CC
C1(c2ccccc2
C1=O
C1(=O)N(C
C(=O)NC1
c1cccc(C2
)C2=O)c1
c1(C2
)C2=O)ccccc1
c1cccc(N2CCN(C
=O)CC2)c1
O=C1N(C
CCN2C(=O)N
C(c3ccccc3)(c3ccccc3
)C2=O)
N1(C
(c2ccccc2)CC
CN1C(=O)N
)C1=O
)C2=O)CC1
c1ccc(N2CCN(C
=O)CC2)cc1
Oc1ccccc1C
O=C(C)O
c1ccccc1C
c1(OC(C)=O)
ccccc1C
c1cccc(OC
c1ccc(OC(C)=O)
c(OC(C)=O)c1
c1cccc(C)c1
c1ccc2c(c1)
[C@@H](N(C)C(=O)OC(C)(C)C
)CC[C@H]2
c1ccc(Cl)c(Cl)c1
CN(C(=O)OC(C)(C)C)
[C@H]1CC
[C@@H](c2ccc(Cl)c(Cl)c2
c2ccc(C(=O)OC)cc21
c1cc(C(=O)OC
[C@H](
)CC[C@@H]2
N(C)C(=O)OC(C)(C)C
C(=O)OC)
c1([C@@H]2CC
[C@H](N(C)
C(=O)OC(C)(C)C)
c3cc(C(=O)OC)ccc3
2)cc
c(Cl)c(Cl)c1
(c2ccc(Cl)c(Cl)c2
c2cc(C(=O)OC)ccc21
C(=O)(OC(C)(C)C)N(C)
O=C(OC(C)(C)C)N(C)
c1cc(Cl)c(Cl)cc1
[C@@H]1CC
O=C(OC)
c1c(C(=O)OC
)ccc2c1
Clc1ccc(
[C@@H]2CC
2)cc1Cl
c1c(
c(Cl)c1Cl
N(C)
c2ccc(C(=O)OC)cc2
O(C(=O)N(C)
c12ccc(C(=O)OC)cc1
C(=O)(OC)
Oc1ccc(C
2(C)C
OC)ccc3
CCCCCCCCO
S(=O)(=O)c2ccc(C)cc2)cc1
O=S(=O)(OCC
CCCCCCC1
OC)cc2
OCC1
c1ccc(C)cc1
c1ccc(OCOC)cc1
)CCCO
S(=O)(=O)c1ccc(C)cc1
OC)ccc1
C1(C)C
Oc2cc(OC
)ccc2C1
OCOC
(C)(
c1cc(OCOC
C(CCCCCCCC
)C(C)(
)CO2
c1cc(C)ccc1S(=O)(=O)
OCCCCCC
C(CCCCC
(OCC
O(COC)
C1(C)
(c2ccc(OC
OC)cc2)
c2cc(OC
S(=O)(=O)c2ccc(C)cc2
OC)cc1
CCCCC1
c1(OCOC
)ccc(C
)ccc1OC
CCCCCCCO
S(=O)(=O)c2ccc(C)cc2)
c12cc(OC
Cc1ccc(C(=O)N
2CCC(c3ccc(C#N)cc3
NS(=O)(=O)
c2ccc(C#N)cc2)
CCN1C(=O)
c(NS(=O)(=O)
c2cccc(C(=O)N
)c2)c1
c1ccc(S(=O)(=O)N
3CCC(
c4ccc(C#N)cc4
)ccc2C)cc1
C)c1
c1(C
2CCN(C(=O)
c3ccc(C)
c4cccc(C(=O)N
c4)c3
c(C)
C1CN(C(=O)
c2ccc(C)
c3cccc(C(=O)N
)c2)CCC1
c1(C)ccc(C(=O)N
c1(NS(=O)(=O)
)c2)cc
)CC2)ccc1C
c1cc(C
CCN(C(=O)
(C)C)c2)cc1
C(=O)N1CCC(
c2ccc(C#N)cc2)CC1
(NS(=O)(=O)
)c2)c1C
)ccc2C
)cccc(C(=O)N
N#Cc1ccc(C
c1cc(-c2c[nH]
cn2)cc
(C(F)(F)F)cc(C(F)(F)F)c2)
c1(-c2c[nH]
(C(F)(F)F)cc(C(F)(F)F)c1
c1c(-c2c[nH]
(C(F)(F)F)cc1C(F)(F)F
c1(C(F)(F)F)cc(-
c1c(C(F)(F)F)cc(-
c1[nH]
cnc1-
(C(F)(F)F)cc(C(F)(F)F)
n1c[nH]
cc1-
N#CC1
CCN(C(=O)OCc2ccccc2)CC1
N1CCC(C#N)CC1
c1(COC(=O)N2CC
C(C#N
)CC2)ccccc1
c1cccc(COC(=O)N2CC
)CC2)c1
c1ccc(COC(=O)N2CC
N1(C(=O)OCc2ccccc2)CC
C(=O)OCc1ccccc1
c2ccccc2)CC
#N
C1(C#N
)CCN
(C(=O)OCc2ccccc2)CC1
C(#N)C1
CCS
c1nc(N
2CCOC[C@@H]2C
c1cccc(F)c1
c1cccc(CNC(=O)
c2c(C)cc
(N3CC
OC[C@@H]3C
O)nc2
c1cc(N2CCOC[C@@H]2C
nc(S
CC)c1
c1(SCC
n1c(N
c(C(=O)NC
c2cccc(F)c2)c1
c(C)cc(N
O)nc1
N1(c2cc
c3cccc(F)c3
)c(SCC
)n2)
CCOC
[C@@H]1CO
c1(CNC(=O)
)cccc(F)c1
[C@H]1(CO)
COCC
c2cccc(F)c2
CC)
c2cccc(F)
c2)c1C
C1OCCN(c2cc
[C@H]1CO
c1(F)cccc(C
c1ccc(F)cc1
c1c(C)cc(N
OC[C@@H]2C
c1c(F)cccc1
c1(C)cc(N
[C@H]1C
OCCN1
c1cc(F)cc
(CNC(=O)
C1COC
[C@H](CO)
CC1(C)
[C@@]2(C)CC
[C@]1(C(=O)N
[C@@](O)(C
#CC1
CC1)
OC2=O
C1(C#C
[C@](O)
(c2cc(Cl)ccc2
NC(=O)[C@@]2
3CC
[C@@](C)(C(=O)
O2)
O=C1O
[C@@]2
#CC
3CC3)
C(F)(F)F)CC
[C@]1(C)C
[C@@]12CC
)C2(C)C
C3(C)C
C(F)(F)F)cc1Cl
#CC1CC1
)(
c1cc(Cl)ccc1NC(=O)
c1cc(Cl)cc(
C(F)(F)F)c1
[C@@](C
[C@](O)(C
[C@](O)(
)C(F)(F)F
C1(C)(C)
O1C(=O)
[C@]2(C)CC
[C@@]1
C2(C)C
C1C[C@@]2(C)
[C@@]12
C(#
[C@]2
[C@@]1(C)C
C1(=O)O
c1ccc(C(C)(C)C)cc1
Nc1cc(C(C)(C)C
)ccc1C
c1(C)cc
c(C(C)(C)C)cc1
c1cc(C(C)(C)C)cc(N
)c1C
c1cc(C)c(N)cc1
c(C)c(N)c1
c1ccc(C)c(N)c1
c1c(C(C)(C)C
)ccc(C)c1
c1cccc(N
c2ccccc2)c1
c2cccc(NC
C#N)c1
C(#N)c1
)cccc1
C(=O)c1ccccc1
c1ccccc1C(=O)N
c1cccc(NC
)c1C#N
)c(C#N)c1
)c(C#N)c(N
c1(C#N
)c(NC
)cccc(N
)cccc
c1ccccc1)N
)C(=O)c1ccccc1
C#N)cc1
=C(C#N)C(
c2ccc3c(c2
)c(N
S(=O)(=O)C
c2ccc(F)cc2)
nn3
)C(C#N)
=C(C)N1
Fc1ccc(C
S(=O)(=O)N
c2nn
(C(=O)OC(C)(C)C)
c3ccc(C4
C(C#N)=C(C)NC(C)
=C4
)cc23)cc1
3)ccc1F
n1nc(N
c2cc(C3
=C3
)ccc21
)ccc2n1
)cc23)cc
c(F)cc1
O=S(=O)(C
c1ccc(F)cc1)N
c2ccc(C3
=C2C
)ccc2c(c1
)nn2C(=O)OC(C)(C)C
C1C(C#N)
=C(C)NC(C)
=C1C
c1(NS(=O)(=O)C
nn
n1(C(=O)OC(C)(C)C
c1c(C2
=C(C#N
c1ccc2c(c1
c1cc(F)ccc1C
C1(C#N)
c1cc(F)cc(F)c1)N
c1cc2ccccc2[nH]1
)C(=O)N
[C@@H]1C(=O)N
[C@@H]1c1ccccc1
N(C(=O)[C@H](C
)NC(=O)C
c1cc(F)cc(F)c1
)[C@@H]1
c1(F)cc(F)cc(C
c2cc3cccc
c3[nH]2)
[C@@H]2C(=O)N
c3ccccc3S
[C@@H]2
[nH]c(C
[C@H](NC(=O)C
c1ccccc1)c2
c12ccccc1NC(=O)
[C@@H](NC(=O)[C@H](C
3ccccc3
[nH]1
c1cc(F)cc(F)c1)
[C@@H](c1ccccc1)
c1ccc2c(c1)S
[C@H](c1ccccc1)
[C@H](NC(=O)[C@H](C
)C(=O)N2
Fc1cc(F)cc(C
c1c(F)cc(F)cc1
CC(=O)N[C@@H](C
c1ccc2cc(C
c3cc(F)cc(F)c3
[C@@H]3
[nH]c2c1
c12ccccc1cc(C
[nH]2
C1(=O)N
[C@H](c2ccccc2)
[C@@H]1NC(=O)
NC(=O)C
c2cc(F)cc(F)c2)
[C@@H](c2ccccc2)
Sc2ccccc21
c1ccc([C@H]2
Sc3ccccc3
c2cc(F)cc(F)
c1c(C
c2cc(F)cc(F)c2
[nH]c2ccccc12
c2ccccc2)cc
(F)cc(F)c1
c2ccccc2NC(=O)
[C@H]1c1ccccc1
c1ccccc1[C@H]1
c1c(OCc2ccccc2
)c(OC
c2ccccc2)c(C(=O)N
-c1ccc(OC)cc1
c1c(OCc2ccccc2)
(C)C)n
(-c2ccc(OC
C(=O)NCC
c(C(=O)NCC
(-c3ccc(OC)cc3
c1cc(-n2
)c(OCc3ccccc3)c2
c1(C(=O)N(C)C
)c(OCc2ccccc2
)n1-
c1ccc(OC)cc1
C(=O)NCC)cc1
COc1ccc(-n2
O(Cc1ccccc1)c1
c(OCc2ccccc2)
c(OC)cc2)
)c(OCc2ccccc2)c1
c1cc(OC)ccc1-
CN(C
c1ccccc1)c1
c3c(N
4CCOCC4)n
cnc3c2
c2c1C
OC(C)(C)C2
N(C)(C
c(N(C)C
)nc1
c21
C1COCCN1CCN
c1ncnc2c1
c3c(c12)
OC3
c2ncnc(N
4CCOCC4
)c12)
C1CN(CCN
c2ncnc3
c2o
c4c(c23)CC
(C)(C)OC
CCN2CCOCC2)
c3nc(N
c12)
CC(C)(C)OC
O1C
c2c(N
5CCOCC5)n
cnc4
c3c2
CC1(C)C
N(CCN1CCOCC1
)c1ncn
c12c(
c1
3)C
c1ccc(C
c3
c2C
C(c1ccccc1)N
c12c3c(
2)C
3
CC1(C)Cc2c(
c2
CN(C)
N1(CCN
c4c(c3c2
OC4
C1c2c(
OC1(C)C
O1CCN(C
4)CC1
c1ccc(COc2cc
c(-c3ncc
4CCCC4)n
3)cc2)cc1
c1ccc(-c2ncc
nc1-
c2ccnc(-c3cc
)n2)C1
c(-c2ccc(OCc3ccccc3)cc2)
c1cc(-
c2nccc(N
3)n2)ccc1
C2CCCC2)
ncc
C2CCCC2)n1
c1cccc(COc2cc
c1(OCc2ccccc2)cc
c(-c2ncc
c1cc(OCc2ccccc2)ccc1-
c1nccc(N
NC1CCCC1
C#
Nc1nc(N
c2ccc3c(c2)OCC
(O)
(CO)
CN3CC
)ncc1Cl
C1(O)
c2cc(Nc3ncc(Cl)c(N
c4c(F)cccc4
C(=O)NCC#C
)n3)ccc2
N(CC)C1
c1(Nc2nc(N
c3ccc4c(c3
(CO)CN
4CC
)ncc2
)c(F)cccc1
c1cc(F)c(N
c2nc(Nc3ccc4c(c3
#C)c1
c1ccc(F)c(N
N1(CC)CC
(CO)CO
)n3
CC#C
Cl)c1F
)c1cccc(F)c1
C1Oc2cc
c3ncc(Cl)c(N
(O)CO
)CNC(=O)
c1cc(Nc2ncc
(Cl)c(N
c3c(F)cccc3
)cc2c1N
CO2
)ncc(Cl)c1
C(C#C
N(CC#C
c2c(F)cccc2
N(c1nc(N
)ncc1
c(F)cccc1
2CC3
c4ccccc4C(F)(F)F)
)C2)nc1
c2ccccc2C(F)(F)F)
)CN(
c1ccc(C(=O)NCCC
)cn1
c1(N2CC3
)C2)cc
c(C(=O)NCCC
2CC2)cn1
FC(F)(F)c1ccccc1
C(=O)N1CC2
C3)C2
)ccc1C(=O)N
CCC1CC1
CC1CC1
2CC2)cc
C3)c1
c3ccccc3C(F)(F)F)
2CC2)ccc1
N1CC2
C(F)(F)F)C
2)C1
c1cccc(C(F)(F)F)c1
C(CNC(=O)
)C1CC1
c1ccccc1C(F)(F)F)
CN(
c1no
c(N2CCC(N
c3cc(-c4cc
c(C#N)cc4
no
3CC3)CC2)
C1CN(c2n
c(C(C)(C)C
)no
2)CCC1
c1cc(-c2ccc(C#N
)C1CCN(c2n
)no2)CC1
c1ccc(-c2cc
(C(=O)N(C
3CC3)C
3CCN(c4
nc(C(C)(C)C
3)on2)
)ccc(-c2cc
3)o
n2)c1F
(C1CC1
c(C#N)cc3
2CC2)CCN1
c1nc(C(C)(C)C
)no1
c(C#N)cc1F
o1nc(-
F)cc1
C(N(C(=O)
2CC2)CC1
c1cc(C#N)ccc1-
c1cc(C(=O)N(C
C2CCN(
on1
)cc(F)c1-
N(C2CC2)
(-
c2ccc(C#N)cc2F)
no2)
3)CC2)CC1
c1ccc(CBr
BrC
c1ccc(C(=O)O)cc1
C(Br)c1cc
c(C(=O)O)cc1F
c1(CBr)cc
c1cc(C(=O)O)cc
(F)c1C
c1cc(CBr
)c(F)cc1
c1(C(=O)O)cc
c(CBr
C(=O)(O)c1ccc(C
Br)c(F)c1
c1c(C(=O)O)cc
c(CBr)c1
(C(=O)O)ccc1
CBr
c1cc(C(=O)O)ccc1
CC(=O)O
CC(=O)O)
CC(=O)O)c1
c2)CC1
C)S(=O)(=O)
C(C(=O)O)
CC(=O)O)cc
CC(=O)O)cc1
(CC(=O)O)
Nc1cc(C(=O)N
O=S(=O)
)N1CCC(
CC(=O)O)c1C
C1CCN(C(=O)
c2)CCC1
COc1ccc(C2
=CCC3
(CC2)OCCO
C1(c2cc
=
CCC2(CC1)OCCO2
3)ccc(OC)cc1
c1cc(OC)ccc1
C1=
3)ccc1OC
c1(OC)ccc(C2
C1=C(
c2ccc(OC)cc2)
(C1)OCCO2
C1C=C(
CCC12OCCO2
C12(CC
c3ccc(OC)cc3
)CC1)OCCO2
(c2ccc(OC)cc2)
=CCC1
2OCCO2
)OCCO2
O1CCOC1
2CC=C(
C1COC2
)CC2)O1
N1C[C@@H](
c2ccccc2)N(C
2CCN(C(=O)OC(C)(C)C)CC2)C1=O
N1CCC(N2C(=O)N
)C[C@H]2
c2ccccc2)CC1
2C(=O)N
c2ccccc2)CCN1C(=O)OC(C)(C)C
CC(C)(C)OC(=O)N1CCC(N
C1[C@@H](
C1CN(C(=O)OC(C)(C)C)CCC1
N1C(=O)N
)C[C@H]1
c1(
[C@@H]2CN
C2CCN(C(=O)OC(C)(C)C)CC
C2CCN(C(=O)OC(C)(C)C)CC2)cc1
[C@@H]1(c2ccccc2
)CN(C(=O)
)C(=O)N1
C1CCN(C(=O)OC(C)(C)C)CC1
O=C(NC)
C(=O)(NC)
N(C)C(=O)
c1cccc(
C2CCN(C(=O)OC(C)(C)C)CC2)c1
N1(C(=O)OC(C)(C)C)CCC(N
c1cc(Br)ccc1N
CC1(O)
(O)CCCC
2)ccc(Br)cc1
c2ccc(Br)cc2
)CCCC1
(O)CN
c1ccc(Br)cc1[N+](=O)[O-]
C1CCC(O)
c1([N+](=O)[O-])cc(Br
c1c(Br)ccc(N
c1(Br)ccc(N
Brc1ccc(N
c1cc(Br)cc([N+](=O)[O-])c1
NCC1
C=CC(=O)OCC
(Cl)(Cl)Cl
C(=O)(C=C
)OCC(Cl)(Cl)Cl
O=C(C=C
C(Cl)(Cl)Cl
C=C
C=C)
C(Cl)(Cl)
(Cl)C
OC(=O)C=C
ClC(Cl)(Cl)C
CC1CC
)c1cc(OCC
(F)(F)F)ccc1
OCC(F)(F)F
FC(F)(F)CO
2CCCCN
c1ccc(OCC(F)(F)F)cc1
(C(=O)NCC
c1c(OCC(F)(F)F)cc
c(OCC(F)(F)F)c1
c1(OCC(F)(F)F)cc
c(OCC(F)(F)F)cc1
O(CC(F)(F)F)
OCC(F)(F)F)
C1CCCCN1
C1CCCN
C1CNC(=O)
c1cc(OCC(F)(F)F)
C1(CNC(=O)
c2cc(OCC
CCCCN1
C1CCC(C
NC1
C(F)(F)(F)CO
c(OCC(F)(F)F)
c1cnn(C)c1
)c(C(=O)NC
(C)(C)C
)cn2COCC[Si](C)(C)C
n1(C)cc
c(C(=O)NC(C)(C)C
)cn(COCC[Si](C)(C)C
c1c(C(=O)NC
)c2nc(N
c3cnn(C)
c3)
c(C)nc2
n1COCC[Si](C)(C)C
CC(C)(C)NC(=O)
c1cn(COCC[Si](C)(C)C
)c2nc(C)
c3)nc12
C[Si](C)(C)CCOC
(C(=O)NC(C)(C)C
c(C)nc21
O(CC[Si](C)(C)C)C
[Si](C)(C)(C)CCOC
c12nc(C)
c3cnn(C)c3
C(OCC[Si](C)(C)C
)n1cc
n1(COCC[Si](C)(C)C
C(C[Si](C)(C)C)OC
c1(C(=O)NC
c(C)n
c1n(COCC[Si](C)(C)C
C(=O)NC(C)(C)C
c2cnn(C)c2
)nc2
c1(C)n
c1c(Nc2n
)cnn1C
n1c(C)
C[C@@H](N
I
)C1CCOCC1
[C@H](C)C
2CCOCC2)
ncccc1
I)
[C@H](C)C1
CCOCC1
[C@H](C)
[C@@H](C)N
)CCOCC1
C1COCCC1
)CCO1
O1CCC(
(I)c1
c1ccc(I
2CCOCC2)n1
c1cnc(N
c(I)c1
c1ccnc(N
c1(I)cc
cnc1N
c1cccnc1N
CC(C)(C)OC(=O)NC1
(c2cc
c(-c3c(-c4cc
c(C(=O)OC
c5ccccc5
n3-
c3cccnc3N
c3ccccc3-
4)cc2)CCC1
c1(COC(=O)
c2ccc(-c3n
c4n(
c3-
c3ccc(C
(NC(=O)OC(C)(C)C)CCC
5)cc3
)-
4)cc2)ccccc1
c3ccccc3)cc2)
c(-c2ccc(C3
(NC(=O)OC(C)(C)C)CCC3
c1-c1ccccc1
Nc1ncccc1
(NC(=O)OC(C)(C)C)CCC2
c4ccccc4)cc3
n2-
c2cccnc2N
c2ccccc2-3)cc1
c2ccccc2-
3)ccc1
C1(NC(=O)OC(C)(C)C)CCC1
NC1(c2cc
c3n(c2-
c2ccc(C4
4)cc2)
4)cc2)c1
c1ccc2c(c1)-c1n
)c(-c3cc
c(C4(NC(=O)OC(C)(C)C)CCC4)cc3
-c1cccnc1
C1(NC(=O)OC(C)(C)C)
c1(-c2n
c(C(=O)OCc2ccccc2)cc1
)ccc(C2
(NC(=O)OC(C)(C)C)CCC2)cc1
4)cc2)C1
c1-c1n
n12c(
nc(-c3cc
-c1ccc(C
-c1ccccc1
n1cccc2
c1ccccc1-c1n
)n1-2
O=C(O)CC
/C=C2\C(=O)N
C(=O)CCC2
c(/C=C3\C(=O)N
3)c(C
c3c(c1
CCC(=O)O)
C(=O)CCC
C(=O)N2
c12c([nH]
3)c1
CCCC2=O
c2[nH]c3c(c2
\C(=O)N
C1(=O)CCC
c1ccc2c(c1)NC(=O)
/C2=C\
c1[nH]c2c(c1
C1CC(=O)
c2c([nH]
c4ccccc43)c2
[nH]
c2c(c1
c1cccc2c1NC(=O)
O=C1Nc2ccccc2
c1(CCC(=O)O)
c(/C=C2\C(=O)N
C1CCC(=O)
c2c1[nH]
/C=C1\C(=O)N
c3ccccc31
CCC(=O)O
OC(=O)CC
C(=O)(O)CC
C1(=O)Nc2ccccc2
C(CC(=O)O)
c1ncc(-
c2cccc(-
c2)[nH]1
c1ccc(C(F)(F)F)
c2cccc(-c3cn
c(C(N)=O)
3)c2)c1
c1ccccc1-
c1cccc(-c2cn
[nH]2)c1
c1ccc(-c2cn
[nH]2)cc1
c1cc(-c2cn
[nH]2)cc
(-c2ccccc2
c1(-c2ccccc2
C(F)(F)F)cc
cc(-c2cn
c1(C(N)=O)
ncc(-
[nH]3)c2
FC(F)(F)c1ccccc1-
c2)cn
ccc1-
c1ccc(-
)c(C(F)(F)F)c1
)c1ncc(-
c1ccc(-c2ccccc2
C(F)(F)F)cc1
-c1cn
c1nc(C(N)=O)
[nH]c1-
c1cccc(-c2ccccc2
n1cc(-
)[nH]c1
C(N)=O
C(N)(=O)
c1c(-c2cn
2)cccc1
2CCC3(CC2)OCCO
3)nc1
C1CC2(CCC1
c1ccccn1
c2ccccn2)
c1ccnc(C
n1ccccc1
C12(CCC
c3ccccn3
2CCC(
C1COC2(CCC
C[C@H]1
CNCCN1
c2ccc(C(F)(F)F)cc21
2CCNC
[C@@H]2C
c2cc(C(F)(F)F)ccc21
C1CNC
[C@H](C)N1
2CC
c3ccc(C(F)(F)F)cc3
[C@@H](C)CN1
[C@H]1(C)C
NCCN1
c1ccc2c(c1)C(
N1CCN
C[C@@H]1C
cc(C(F)(F)F)ccc1
N1(C2CC
[C@@H](C)C1
c1cc2c(cc1C(F)(F)F)
C(N1CCN
)C(
2c1
c12ccc(C(F)(F)F)cc1
c1cc(C(F)(F)F)
nn1
CCBr
C(CBr
nc(C(F)(F)F)cc1
C(Br)C
n1nc(C(F)(F)F)cc1
BrCC
n1(CC
)nc(C(F)(F)F)cc1
c1(C(=O)OC
)cc(C(F)(F)F)
c1c(C(F)(F)F)
nn(CC
(C(=O)OC
Br)n1
n1c(C(F)(F)F)cc
(C(=O)OC)n1
CC(N
C(c1ccc(F)cc1)
c1cccc(N)c1
c1ccc(F)c(F)c1
c1c(N)cccc1
C(NC(C)
)c1ccc(F)cc1
c1(C(N
c2ccc(F)c(F)c2)
c2ccc(F)cc2)cc
cc(N)c1
c1cc(C(N
c2cccc(N)c2
)ccc1F
c1(F)ccc(C(N
c2cccc(N)c2)cc1
c1(N)cc
cc(C(N
c2ccc(F)cc2)c1
c1cc(F)ccc1
c(C(C)
NC(
c2cccc(N
)c2)cc1F
c1ccc(C(N
c2ccc(F)cc2)cc1
c1cccc(C(N
c2cccc(N)c2)cc
c1cc(F)c(F)cc1
c1ccc(F)cc1)
c1cc(C(C)
(F)c1F
(C(C)
N(C(C)
(C)NC(
COc1n
c(Cl)cnc1N
c1ccc(Br)s1
c1ncc(Cl)nc1
OC)
O=S(=O)(N
c2ncc(Cl)nc2
c(Br)s1
c1cc(Br)sc1
)nc1OC
c2ncc(Cl
)nc2OC
)sc1Br
c1(Br)ccc(S(=O)(=O)N
OC)s1
s1c(Br)ccc1
OC)S(=O)(=O)
c2ccc(Br)s2)
(Cl)nc1
c1(OC)n
O(C)c1n
n1c(Cl)cn
c2ccc(Br
)s2)c1
c(OC)n1
Clc1cnc(N
)nc1Cl
(Cl)n
CCC(=O)
CCN(CC)CC
c1(Cl)cc(C(=O)N
)c(OCC(=O)
CC)cc1
)cc(Cl)
c(N)cc1
C(=O)(CC
)CO
c1cc(N)c(Cl)cc1
O=C(CC
)C(=O)CC
c1cc(Cl)c(N)cc1
)c1cc(Cl)
C(C)N(CC)CC
C(C)C(=O)
)c(Cl)cc
c1cc(OCC(=O)
(OCC(=O)
)N(CC)CC
N(CC)(CC)CC
c1(OCC(=O)
c1cncc
[C@@H](COC
c1ccccc1)C(=O)N
c1ccc(Oc2ccc(F)cc2)cc1
c1cccc(COC
c2cnccn2)
c2ccc(O
c3ccc(F)cc3)cc2)c1
O(Cc1ccccc1)C
c1cnccn1
c1ccc(COC
c3ccc(F)cc3
c(NC(=O)
[C@H](COC
c3cnccn3
)cc2)ccc1F
c1cc(O
c2ccc(F)cc2)ccc1
NC(=O)[C@H](C
)[C@H](C
c1(F)ccc(Oc2cc
OCc2ccccc2)
c2ccc(Oc3ccc(F)cc3)cc2)
cnccn1
c2cnccn2)cc1
c1cc(F)ccc1O
n1ccncc1
c1(COC
c3ccc(F)cc3)cc2
c1cnc(C
C(=S)N
NC(=S)N
C(=S)
(NCC
)NCc1ccccc1
S=C(N
N(Cc1ccccc1)
C(NC(=S)N
c1ccccc1CN
c1ccc2c(c1)C(C)
(c1ccccc1
N2C(C)=O
(c2ccccc2)
c2cc(NC(=O)
)ccc2N1
(C)CC(C)(C)
N(C(C)=O)
c(NC(=O)CC
)cc32)cc1
C(=O)CC
c1(NC(=O)CC
)C(C)
(c2ccccc2
)cc21
)cc3
NC(=O)CC
C1(C)CC
O(CC)CC
C(COCCOCC
(NC(=O)CC
(C)c1ccccc1
NC(CO)
C2CCCCC2)c1
(N)
)CO)
cccc(N
C2CCCCC2)cc1
C(N)CO
C2CCCCC2
(N)C
O)c1
O)cc1
NC1CCCCC1
)cccc(C
)C1CCCCC1
c2cccc(C
O)c2
)CCCCC1
C1CCCCC1
Nc1cccc(C
C1CCCC(N
c1ccc(OC)cc1C
c1(NC)cc
c(OC)cc1C
)cc(C)c1
c(C)cc1OC
c1(OC)ccc(N
C)c(C)c1
O(C)c1ccc(N
COc1ccc(N
c1c(OC)ccc(N
C)c1C
c1(C)cc(OC
CCNCC1
CCN(c2n
cc2F)c(=O)c(C(=O)O)cn
O=C(O)c1cn
(CC)c2
NCC
)C3
)c(F)cc2c1=O
c(=O)c(C(=O)O)cn
c1(F)cc2
c1c(F)c(N
)C2)
c1c(=O)
c(C(=O)O)cn
c1nc2c(cc1
F)c(=O)c(C(=O)O)cn2CC
c2nc3c(
C1C(C
)CCC(C
c1c(C(=O)O)
c(=O)c2cc(F)
c(N3CC
C(CNCC
)C3)n
c2n1CC
c1(=O)c(C(=O)O)cn
)c(F)cc12
c(F)cc2c(=O)c(C(=O)O)cn
(CC)c12
c12cc(F)c(N
c1n(CC
)cc(C(=O)O)c2=O
n1cc(C(=O)O)c(=O)
c2cc(F)c(N3CC
c1(N2CCC(C
)C2)n
c2c(cc1
C(NCC
CNCC
CN1CCN(C
c2ccc(-c3cc
n4cc
c6cccc
(F)
c-
4)o
n3
)cc2)CC1
4CCN(C)CC4)cc3
2)cc2
nc(-c3cccc(F)c3F)nc-2cn1
c1(F)c(F)cccc1
5CCN(C)CC
5)cc4)n
o3)cc
-2n1
c1cc(-c2cc(C
n3cc4nc(-c5cccc(F)c5F)nc-4
n2)ccc1
CN1CCN(C)CC1
c1ccc(-c2cc(C
n2)cc1)
N1CCN(C)CC1
c3cnn(C
c4cc(-c5cc
6CCN(C)CC
6)cc5
4)cc
-3
n2)cccc
c1cccc(-c2n
c1(-c2ccc(CN
3CCN(C)CC3)cc2
cc3nc(-c4cccc(F)c4F)nc-3
c2cn(C
3)ncc
c1cccc(F)c1F
n1oc(C
c1ccc(CN
2CCN(C)CC2)cc1
c1(-c2cc(C
)ccc(CN
C(c1cc(-
3CCN(C)CC3)cc2)
cc2nc(-c3cccc(F)c3F)nc-2cn1
Fc1c(F)cccc1
nc(-c3cccc(F)c3F)n
c-2
n3)cc2)
CCN(C)CC1
2CCN(C)CC2)cc
c(-c2cc(C
2CCN(C)CC
c1cc(Cn2
c1c2n
c(-c3cccc(F)c3
cnn1C
c1cs
c(I)n1
c(C(=O)OCC)cs1
c1(I)n
s1cc(C(=O)OCC
c1s
c(I
)nc1C(=O)OCC
c1(C(=O)OCC)
cs
C(=O)(OCC)c1
O=C(OCC)c1
n1c(C(=O)OCC)cs
CC(C)(C)C(=O)O
N[C@H]1C
c2c(cccc2-
c2ccccc2)N
C[C@H](N
OC(=O)C(C)(C)C
c2cccc(-c3ccccc3)c2
1
O(N
[C@H]1CS
C1=O)
c1cccc(-
c2cccc3c2
SC[C@H](N
c1(-c2cccc3c2
3)ccccc1
SC
[C@@H]1N
C1S
c2ccccc2)NC(=O)
[C@H]1N
c12cccc
(-c3ccccc3
c1ccc(-c2cccc3c2
ON
[C@H]1(N
)CS
C(=O)(O
N1C(=O)[C@@H](N
c2c1cccc2
c1ccc2c(c1)c(-
c1cn[nH]c1
)nn2C(c1ccccc1)(c1ccccc1)c1ccccc1
c1ccccc1C(c1ccccc1)(c1ccccc1)n1
nc(-c2cn
[nH]c2)
c2cc([N+](=O)[O-])ccc21
c1cccc(C(c2ccccc2)(c2ccccc2)n2
nc(-c3cn
c3cc([N+](=O)[O-])ccc3
n1c(-c2cn
c2cc([N+](=O)[O-])ccc2n1
C(c1ccccc1)(c1ccccc1)c1ccccc1
c1[nH]ncc1
(c2ccccc2)(c2ccccc2)c2ccccc2)
c2ccc([N+](=O)[O-])cc12
c1ccc(C(c2ccccc2)(c2ccccc2)n2
c1([N+](=O)[O-])ccc2c(c1
c1(-c2cn
[nH]c2
c1c([N+](=O)[O-])ccc2
c1ccc(-c2cc3
[C@H]4C
[C@H](OC(=O)
c5ccccc5)
[C@@H](CO)O
)c(=O)
nc3
o2)cc1
c1cc(CCCCC
c1cc2cn
([C@H]3C
OCc4ccccc4)
[C@@H](CO)
O3
c1ccccc1)C(=O)O
[C@H](n2
cc3
cc(-
c4ccc(C
)cc4)o
c2=O)
O[C@@H]1CO
O[C@H]1C
O[C@@H]1C
O)c1ccccc1
O[C@H]1
(-c3cc
)o
oc(-c3cc
)cc2cn1
[C@@H](CO)O1
[C@H]2C[C@H](
c4nc3
=O)O
o2)ccc1
C(O)[C@H]1O[C@@H](
c3nc2
=O)C
[C@@H]1OC(=O)
c1c(-c2ccc(C
)cc2)o
c(=O)n(
[C@H]3C
3)cc12
C(C)CCC
O)ccccc1
c(-c2ccc(C
nc12
n1(
[C@H]2C
OCc3ccccc3)
)cc2cc
c1ccccc1)O
c1(-c2ccc(C
c3ccc(O)cc3
)cc2)cn
c2ccc(O)cc12
c12ccc(O)cc1
c1ccc(N(C)C)cc1
)cn2
c1(N(C)C)cc
c(-c2cn
c2ncc(-c3cc
(C)C)cc3
c1cc2ncc
(-c3ccc(N
)nc2cc1
n2)ccc(N
N(C)(C)
c1cc(N(C)C
)ccc1-c1cn
n1cc(-c2cc
)cc2)n
c2cc(O)ccc12
c12cc(O)cc
c1c(C(=O)O)s
c2cc(C(F)(F)F)ccc12
OC(=O)c1s
c2cc(C(F)(F)F)ccc2c1C
C(=O)(O)c1s
O=C(O)c1s
c1(C(=O)O)s
s1
c(C(=O)O)c(C)
c2ccc(C(F)(F)F)cc12
c12cc(C(F)(F)F)cc
c1c(C)
c(C(=O)O)
s2
c2c(C)
sc12
sc2c1
c1ccc2c(C)
c1cc2
c(C)c(C(=O)O)
sc2cc1
c1cc(C(F)(F)F)cc2
c(C)c12
c(C(=O)O)c2C
c1(C)
c(C(=O)O)s
[C@@H](O)
[C@@H](N)C
C(=O)OCc2ccccc2)cc1
c1ccc([C@@H](O)
[C@H](N)C(=O)N
[C@H](C(=O)OC
[C@H](O)
[C@H](N)
c2ccc(OC)cc2)c1
c2ccc(OC)cc2)cc1
c1ccc(OC)cc1)
[C@@H](N)CO
c1ccc(OC)cc1)c1ccccc1
c2ccc(OC)cc2)ccccc1
c1([C@@H](O)
C(=O)OCc2ccccc2)cc
c(OC)cc1
N[C@@H](CO)
(C(=O)OCc1ccccc1)
CCCO
-c1nc(N
)c(=O)[nH]1
c1c(C)cc
c(OCCC)c1
Oc1ccc(C)cc1
O(CCC
)c1ccc(C)cc1
c1(OCC
C)cc
c(C)cc1
c1(N)n
c(-c2cc(C)ccc2
OCCC)
[nH]c(=O)
c1cc(C)cc(-
)c(=O)[nH]2)c1
OCCC
(C)ccc2
[nH]c1=O
c1(=O)[nH]
)c1N
C(CC)O
c(-c2nc(N
)c(=O)[nH]
2)cc1C
c1(-c2nc(N
2)cc(C)
c(N)c1N
c(OCCC)
O=c1[nH]
Nc1nc(-c2cc
)c(N)n
C(=O)N(C1
CCN(C
c3cc(C
4CC4)
c(-c4ccc(F)cc
4F)
c(F)c3
OC)CC1
c2cc(C3CC3)
c(F)cc3F)
c(F)c2
OC)CCC1
c(CCC
c(C(=O)O)cc2
Fc1cc(F)ccc1-
c1c(C2CC2)cc
2CCC(N3CC
c4nc(C
c(C(=O)O)cc
c(OC)c1F
c2cc(C(=O)O)
C1CCN(C
C1(N2CC
c(C(=O)O)cc3
c1cc(CN2CCC(N
c(OC)c(F)
c1ccc(F)cc1F
c1(OC)c(C
N2CCC(N3CC
4C3
=O)CC2)cc
(C2CC2)
c(-c2ccc(F)cc2
F)c1F
O=C1
c(C(=O)O)cc1
3CCC(N4CC
c5
5C
4=O)CC3
)c(F)
c2ccc(F)cc2F)CC1
c1(C(=O)O)
cc2c(
)CCN(C
1CCN(C
)C2=O
c2ccc(F)cc2F)c1
c1(CCC
C1CC(N2CC
CCN1C
c1cc(C2CC2)
c2ccc(F)cc2F)
c(-c2c(C
)cc(CN
)c(OC)c2
F)c(F)c1
c1(F)
c(OC)c(C
2)cc(C
2CC2)c1
c1cc2c(nc1
c1ccc(-c2c(C
c1ccc(-n2cc
c3cc(Cl)ccc3
)n2)cc1C
c(C)c(C)c2
)ccc(NC(=O)
)n2)ccc1
c1ccn(-c2cc
)n1)
c1cc(Cl)ccc1[N+](=O)[O-]
)nn1-
c1ccc(C)c(C)c1
c2ccn(-c3cc
c(C)c(C)
c3)n2)cc
(Cl)ccc1
c1cc(Cl)cc(C(=O)N
c3)n2)c1
c3)n
c1(-n2cc
)n2)cc
c(C)c(C)c1
c1c(-n2cc
c(C)c1C
(C)c1C
c1c(Cl)ccc([N+](=O)[O-])c1
n1c(NC(=O)
c1cc(C)c(C)cc1
-n1cc
c1(C)cc(-
n2ccc(NC(=O)
COc1cc2c(cc1
)CCN(C(C
c2cc(OC)c([N+](=O)[O-]
)cc2CC1
CC(C
c1cc2c(cc1OC)CCN(C
C1CN(C(C
F)CC
N1(C(C
)c(OC)cc21
c12cc([N+](=O)[O-]
)c(OC)cc1
CCN(C(C
c1([N+](=O)[O-])cc2c(cc1
OC)CCN(C
c1c2c(cc
)c([N+](=O)[O-])cc1
)c(OC)cc2
)c([N+](=O)[O-])cc2
O(C)c1cc2c(cc1
(CF)
c1cn2
c3c(cc(C
#
c1=O)
c2cc(C
c(C(=O)OCC)cn1
c23
c(=O)c(C(=O)OCC)cn
(c2
3)C1
c12cc(C
3)CCC2
c(C(=O)OCC)cn3
(C(=O)OCC)c(=O)
)cc1
c32
c1cc2c3c(c1
c(C(=O)OCC)cn
3CCC
2)OC(C)(C)C
c1(C#
cn2
CCC3
c(C(=O)OCC)cn2
#C
NCC#C
2)C(C)(C)C
c1n(
cc(C(=O)OCC
)c2=O)
c2ccc(OCc3ccccc3)cc2
n1Cc1ccccc1
c3ccc(F)c(F)c3
)c(C(C)C
c1cc(CNC(=O)
c2c(C(C)C
)n(Cc3ccccc3)
c3cc(OCc4ccccc4
c3c(C(=O)NC
c4ccc(F)c(F)c4
c1(F)ccc(C
3)cc1F
(C)C)c(C(=O)NC
C(c1ccccc1)n1
c(C(C)C)
c2ccc(OCc3ccccc3
c3ccccc3)c2c1
c1ccc(Cn2
c3ccc(F)c(F)
c3ccc(OCc4ccccc4)cc3
c(C(C)C
)n(Cc2ccccc2)
c2cc(OCc3ccccc3)ccc12
c1c(C(C)C
)c(C(C)C)n
2Cc1ccccc1
c1c(CNC(=O)
c(F)c1F
c1ccc2
c(OCc3ccccc3)cc1
n(C
)c(C(C)C)c2
c2ccc(F)c(F)c2
O=C(O)CNC(=O)
c1cccs1
OC(=O)CNC(=O)
C(=O)(O)CNC(=O)
N(CC(=O)O)
C(=O)c1cccs1
O=C(NCC(=O)O)
cs1
c1ccsc1
s1cccc1
c1nnn[nH]1
c2nnn[nH]
2)cccc
c1ccc([N+](=O)[O-])c(O)c1
C(=O)Nc1n
nn[nH]1
c2nnn[nH]2)
c(O)c([N+](=O)[O-])c1
c(O)c1[N+](=O)[O-]
c1([N+](=O)[O-])cccc
2)c1O
2)cccc1[N+](=O)[O-]
Oc1c(C(=O)N
c2cccc([N+](=O)[O-])c2
nnn[nH]1
n1nn
O)n1
nc1NC(=O)
c1ccc(N(C
c3c(OCc4ccccc4)cccc3
c1ccc(COc2ccc(C
C3CCC
c4c(OC
)cccc4
c3ccc(C(C)C)cc3
)cc2OC
c2ccccc2)cc1
c1cc(N(C
2)ccc1
CCCC3
c3ccccc3)c2)
c2ccc(C(C)C)cc2)c1
(CN(C(=O)
)CCCC2
)c1ccc(C(C)C)cc1
c1(OCc2ccccc2)ccc(C
C2CCC
c2ccc(C(C)C)cc2)cc1
c1cccc2c1CCCC2
c1cc(CN(C(=O)
c2ccc(C(C)C)cc2
)cc(OCc2ccccc2)c1
c1cc(C(C)C)ccc1
C1CCC
c2c(OCc3ccccc3)cccc21
O(Cc1ccccc1)c1ccc(C
c1(COc2ccc(C
c2ccccc2)ccccc1
c1(C(C)C
c2ccc(C(C)C
)cc2)cc
c1(CN(C(=O)
c2c(OCc3ccccc3
)cccc2
C(C(=O)
C(N)=O)cc1
C(N)C
C(CN)
c1(CCN
C(N)=O)ccc1
c1cc(CCN
C(N)=O)cc
c(CCN)cc1
O(c1ccc(C
CN)cc1
)c1ncccc1
c2ccc(CCN
(C(N)=O)c1
c1ccc(C(N)=O)
c1cnc(O
c(C(N)=O)c1
c1(C(N)=O)cc
)c1cccnc1
=N
c1cc(C(F)(F)F)ccc1C
#N)
c1C#N
c1ccc(C#N)c(N
c2cc(C(F)(F)F)ccc2
)ccc(C(F)(F)F)cc1
c1cc(C(F)(F)F)cc(N
)N(C(C)=O)
N(N
#N)C
(C)=O
c(C#N)c1N
C#N)C
(C)=O)c1
c(C#N)c(N
c1cc(C#N)c(N
(C)=O)cc1
CCc1n
(CC(C)O)
nc2n1
c2cc(-
c3nnnn3
C(c3ccccc3)(c3ccccc3)c3ccccc3
c12cc(-c3ccccc3
n1c(CC
)nc3c(C)cc
1)CC2
nnnc2-c2ccccc2-
c2ccc3c(c2)CC
c(CC)nc3
c(C)cc
nnn2C(c2ccccc2)
(c2ccccc2)c2ccccc2)c1
c1ccc2c(c1)CC
)nc2c(C)cc
nc21
C(C)c1n
C(C)(O)C
c(CC)n
([C@H]3CC
c4cc(-
c5nn
nn5
c5ccccc5)(c5ccccc5)
c5ccccc5)ccc4
nc1-c1ccccc1
C(c1cc(C)
3)c2
n1)C
(C)O
c1nc(CC
(c2ccccc2)c2ccccc2)
c(-c2ccc3c(c2
c3c(c2)CC
nnn1
n1c(CC)n
([C@H]2CC
c3cc(-c4ccccc4
c4nn
nn4
C(c4ccccc4)(
c4ccccc4)ccc3
c2nc(C
(C)c12
CC(O)C
C)n
O)cc2
[C@H]1(
c1cc(-c2ccccc2-
c2nnnn2C(c2ccccc2)
(c2ccccc2)c2ccccc2
C1C[C@H](
nc32)
c2ccc(-c3ccccc3-
c(-c2ccccc2-
nc32)cc1
C=CCN
c1nc(OC
c(Cl)c(=O)
c1cc(C(=O)O)ccc1C
CC=C
)nc(OC
c(Cl)c1=O
c(C)c1-
Clc1c(OC
)n(-c2cc
(C(=O)O)ccc2C
)c1=O
c1c(Cl)c(OC
c(C(=O)O)cc1-
)n(-c3cc
(C(=O)O)ccc3C
)c(=O)c2
c(F)cc1F
n1c(OC
(C(=O)O)cc
c2C)c1
NCC=C
c1cc(CO
)c(F)cc1F
c1(F)cc(F)ccc1
COc1nc(N
)c(=O)c1Cl
(C(=O)O)ccc2
C)c(N
C(=O)(O)c1ccc(C)
c(-n2
c3ccc(F)cc3F)
c(Cl)c2
=O)c1
)c(=O)c1
Fc1cc(F)ccc1
C(=C)CN
N(CC=C
CN1C(=O)
c1ccc2[nH]cnc2c1
)N1CCC
c3ccc(C(=O)O)cc3
[C@@H]21
c12cc(C(=O)O)ccc1
CCCN(C(=O)
c3ccc4[nH]
[C@H]1C2
c(C(=O)N3CCC
[C@@H]4
c[nH]2
c1cc(C(=O)O)cc2c1
c2ccc3[nH]
c2)
c3cc(C(=O)O)ccc3
[C@@H]12
c2cc(C(=O)O)ccc2
[C@H]2CC
c1cc2c(cc1C(=O)O)
3)ccc12
c12ccc(C(=O)O)cc1
c4ccc(C(=O)O)cc
4C
)ccc2[nH]
cnc12
nc[nH]c12
3)ccc2[nH]1
c1c(C(=O)O)ccc2c1
C1C[C@@H]2
C[C@@H]2
c2)C1
c(OCc2ccccc2)c(F)c1
c1c(F)cc(C
=O)cc1
F)c1ccccc1
c2c(F)cc(C
=O)cc2
F)ccccc1
=O)cc1F
F)c1
c(F)cc(C
)c(F)cc
c1(F)cc(C
=O)cc(F)c1
c1cc(C=O)cc
c1c(C=O)cc
c1(C=O)cc
c1ccc(-c2ccccc2)cc1
C(C)(=O)O
c1(OC(C)=O)cc
c(-c2ccccc2)cc1
c1cc(-c2ccccc2
(C)=O)ccc1
c1(-c2ccccc2)cc
c1(-c2ccc(OC
(C)=O)cc2
c1ccc(OC(C)=O)cc1
(C)=O)cc
c1ccc(-c2ccc(OC
cc2)cc1
CSc1n
c(-c4ccccc4
O)cc3
)c(Cl)cc2
c3cc2
Cl)ccc1
c3cc2Cl)cc1
O)ccc1-
[nH]c2cc1
c(-c3ccccc3
c1c(Cl)
[nH]c12
c(-c3cc4
[nH]c4cc3
Cl)cc2)
c(O)c1
c1cc2[nH]
c(SCC(=O)O)
nc2cc1
OC(=O)C
Sc1n
c12cc(-c3cc
Cl)cc2
)ccccc1O
O)cc2)
c(Cl)cc2
C(S
)c(Cl)cc12
c12cc(Cl)
c1cccc(O)
c1(O)cccc
C[C@@H]1
CN2
c3c(cc
5CCNCC5
c4c3
F)CC3
C(=O)NC3=O)
[C@H]2
[C@H](C)O1
C(=O)NC(=O)C1
2C
c1cc3
4CCNCC
4)no
[C@@H](C)O
[C@@H](C)
c1c2c(cc3
4CCNCC4)n
oc1
C(=O)NC1=O)
[C@H](C)O[C@H](C)C
N21
NC(=O)C2
c3cc4
N3C
[C@@H]32)
c3c(F)
c4c(
3)CC2
C(=O)NC2=O)
2)CCNCC1
c12cc3c(
onc2
N1CCNCC1
)N1C
[C@@H](C)[C@@H]1
3)C(=O)N
C(=O)NC1=O
oc3
F)CC1
C(=O)C2
2)C1=O
N12C
2)C(=O)N
o1nc(N
2CCNCC2)
c2cc3c(
c2c(F)
N3
c2cc3c(N
N2C
C12C(=O)N
C(=O)NC2=O
[C@@H]1(C)C
CC21
C12(C
[C@@H]31
N(CC#N)
S(=O)(=O)c2ccc(C)cc
(S(=O)(=O)
c2ccccc2)c2ncccc12
O=S(=O)(c1ccccc1
(CC#N)
c(C(=O)OC)
c12cccn
c1n(S(=O)(=O)
)c(C
(CC#N)C
c2c(C(=O)OC
c3cccnc3n2
S(=O)(=O)c2ccccc2
c(C(=O)OC)c(C
S(=O)(=O)c3ccc(C)cc3
)n(S(=O)(=O)
)n2S(=O)(=O)c1ccccc1
c1(C)ccc(S(=O)(=O)N
S(=O)(=O)c2ccccc2)cc1
S(=O)(=O)(c1ccccc1
)N(C
c2cccnc2n1
S(=O)(=O)(c1ccc(C)cc1
)N(CC
c1ccccc1S(=O)(=O)
n1c(CN
n1(S(=O)(=O)
O=S(=O)(c1ccc(C)cc1
C(=O)(OC)c1
N#
CC(C)OC(=O)
c(Cl)nc1
C(C)(C)OC(=O)
(C)C)s
c(Cl)n
C(=O)OC(C)C
c1(Cl)n
c(C(F)(F)F)
(C)C)s1
Clc1n
n1c(Cl)s
c1(C(F)(F)F)
nc(Cl)
c1nc(Cl)
n2ccnc2
)c[nH]
C(F)(F)C2)
ncn1
(-n3
[nH]cc(-
n4ccnc4
)c3=O)
(F)F
n3ccnc3
)c2=O)cc1
N1CCC(F)(F)C1
C1(F)(F)
C1CC(F)(F)
C1N(c2cc
2CCC(F)(F)
n1[nH]
3CCC(F)(F)
C3)n
c1cncn1-
2)c1=O
C(F)(F)C1
c1(-n2
=O)cc(N
2CCC(F)(F)C2)
n1ccn(-
n(-c3cc
4CCC(F)(F)
cn3)c2
FC1(F)
c1cn(-
=O)cn1
c1nccn1-
[nH]1cc(-
)c(=O)n1-
n1ccnc1
O=C1C(=O)
c2ccccc2C2
SCC1
(CCN(CC
3CCCO
)O2
N2CCC3
SC2
=C(O
CCCO1
C1CCOC1
CN1CCC2(CC1
)CSC1=C(O2)
C(=O)C1=O
2CCCO2)
2CS
C1=C(O2)
=C(OC
(CCN
(CC4
C2=O
C12(CCN
3CCN(C
C1CCCO1
)CC3)
c1ccccc1C(=O)
SCC3
4)CC3)
C1COC(C
C2=O)C1
c1ccc2c(c1)C(=O)
c12ccccc1C(=O)
)C(=O)C2=O
C(C1
N1CCC2(CC1
C1CC2(CCN1
c1cc(Cl)nc(N
[C@@H](F)
C2)c1
nc(Cl)cc
(C)c1[N+](=O)[O-]
(C)c2
[C@@H](F)C1
c1nc(Cl)cc
)C[C@@H]1
[C@@H]1(F)
C1[C@H](F)
n1c(Cl)cc
c1(Cl)cc(C)
c([N+](=O)[O-])c(N
C2)n1
Clc1cc(C)
c1c(Cl)n
c([N+](=O)[O-])c1C
(Cl)nc(N
c1([N+](=O)[O-]
)c(C)cc
[N+](=O)([O-])c1
O=[N+]([O-])c1
COc1c(OC
(F)F)cc
c2cccc3c2CCC3
=O)c1OC
c1ccc(S(C)(=O)=O)cc1
c2ccc(OC(F)F)
c2ccc(S(C)(=O)=O)cc
c2c(-c3cccc
4c3
CCC4
c(OC(F)F)c2
c(OC(F)F)
c2ccc(S(C)(=O)=O)cc2)
C(=O)CC2
FC(F)
Oc1ccc(-
2)c1OC
c2OC
)ccc(S(C)(=O)=O)cc1
c(OC(F)F)c1
C(F)(F)
S(C)(=O)=O
O=C1CC
c1ccc(OC(F)F)
c(OC)c1OC
c12cccc(-c3cc
c(OC)c3
c3ccc(S(C)(=O)=O)cc3
CCC2=O
c1(S(C)(=O)=O)cc
c2cccc(-c3cc
)c21
c1cc(Br)c2
(C)CC3
CN(C(=O)OC(C)(C)C)CC2
CN1CC2
CN(C(=O)OC(C)(C)C)CC
c3c(Br)cc
c3c(C)cc
(Br
c32)
CCN1C(=O)OC(C)(C)C
(C)CC2
c12c(C)cc
(Br)c3
(C(=O)OC(C)(C)C)CC
Brc1cc(C)
c3c1
CCN(C(=O)OC(C)(C)C)CC
CN2C
O(C(=O)N1CC
c2c(Br)cc
(C)c3c2
3C
N(C)CC
CN(C(=O)OC(C)(C)C)CC3
CC(C)(C)OC(=O)N1CC
c31
)N(C)C2
c1c(C)c2
)CCN(C(=O)OC(C)(C)C)CC
N1(C(=O)OC(C)(C)C)CC
(Br)c2
O=C(OC(C)(C)C)N1CC
C(C)(C)(C)OC(=O)N1CC
C1CN(C(=O)OC(C)(C)C)CC
c4cc(C5
=CCN(
CC5
)ncc4
3)CC2)nc1
)cc2c(cn1
[C@@H](C1
c3ncc
(CC)cn
3)CC1)C2
C1CN(c2ncc
)cn2)CCC1
S(C)(=O)=O)CC3)n
C1CCN(
c2ncc(CC
)cn2)CC1
c3cc(C4
S(C)(=O)=O)CC
4)ncc3
(CC)cn1
C1CC(c2cc
3c(cn2)
O[C@@H](C
2CCN(
c4ncc
4)CC2)
C3)
=CCN1
ncc1
c1nc(C2
1CCN(
S(C)(=O)=O)CC1
CCN(c2ncc
c12cn
c(C3
S(C)(=O)=O)CC3
)cc1C
[C@H](C1
c1cc2c(cn1
)cnc(N
N1CC=C(
c2cc3c(cn2)
C3)CC1
COc1ccccc1
n(-c3ccccc3)c2
N)CC1
N1(c2ccccc2
n2nc(C
)c(CN
3CCN(c4ccccc4
OC)CC
N)c1
c1c(C2CC2)
nn(-c2ccccc2)c1
N)
N1CCN(c2ccccc2OC)CC1
n1c(C2CC2)
2CCN(c3ccccc3OC)CC2)
c(N)n1
n1nc(C
2CCN(c3ccccc3OC
C1CN(c2ccccc2
nn(-
c1ccccc1OC
c3c(C
4CC4)n
n(-
c1(OC)ccccc1
c1cccc(OC)c1
c1c(CN
c(C2CC2)
nn1-c1ccccc1
c1nn(-
c2ccccc2)c(N)c1
CN1CCN(c2ccccc2OC)CC1
n1(-c2ccccc2)n
c1(C2CC2)
C1(c2n
n(-c3ccccc3
)c(N)c2
2CCN(c3ccccc3
)nc2)cc1
c1ccc(Oc2ccc(N
C(C)=O)cc2)
c1cc(Oc2ccc([N+](=O)[O-]
)nc2)ccc1
NC(C)=O
c1ccc(NC(C)=O)cc1
c1ccc([N+](=O)[O-])nc1
c2ccc(NC(C)=O)cc2
)ccc1[N+](=O)[O-]
c1cc(Oc2ccc(N
c(NC(C)=O)
c([N+](=O)[O-])nc1
c1(NC(C)=O)cc
C(C)(=O)N
c1cc(NC(C)=O)
ccc1O
O=C(C)N
c([N+](=O)[O-]
Oc1ccc(NC(C)=O)cc1
C2=N
[C@](C)
(c3cc(N
c4ccccc4OC
)ccc3
CO2)
c2ccc(OC)cc2)ccc1OC
c2ccc(OC)cc2)ccc(OC)cc1
c1ccc(OC)c(N
c2ccc(F)c(
[C@@]3(C)N=C(N
c4ccc(OC)cc4)
c4ccc(OC)cc4
)OC
[C@H](F)
[C@@](C)
(c2cc(N
c3ccccc3OC
)ccc2F)
=C1N
C(c1ccccc1)(
c1ccc(OC)cc1)c1ccc(OC)cc1
c1ccccc1C(N
CO1
[C@@]1(C)N=C(N
C(c2ccccc2)
OC[C@@H]1
(c1ccccc1)
c1ccccc1N
c1ccc(F)c(
[C@@]2(C)N=C(N
C(c3ccccc3)
(c3ccc(OC)cc3
)c3ccc(OC)cc3
[C@H]1COC
(NC(
[C@]1(C)
c2ccccc2OC
F)cc
)cc(
c3ccccc3)N
(C)C)C(=O)
[C@H]2O)cc1
=C
[C@H](c3cc
c(OC)cc3
)[C@H](O)
C(=O)N2CCN
C1(c2ccccc2)
[C@H](c2ccc(OC)cc2)
N1CCN(C)C
c1([C@H]2
C(CN(C)C)
[C@@H](c2ccc(OC)cc2)
=C1c1ccccc1
2CCN(C)C
C(CN1C(=O)
=C(c2ccccc2)
c1(OC)ccc(
O[C@@H]1
(CCN(C)C)
[C@@H]1(O)
CCCC(N
c2ccc(-n3ccnc3
)cc2C)C1
C(CCC)
N1CCCC(N
C1CCCN(C
CCC)C1
CN(CCCC
)CN(C
Cc1cc(-
c1(-n2ccnc2
C2CC
C(CC)C
c1ccc(-n2ccnc2
)C1CC
C1C(N
C)CC
CN1CCCC
3)c(C)c2
2)c1C
c(C)cc1-
CCC)CC1
Nc1ccc(-
C)C
N1CCCC
c(-n2ccnc2
(CCCC)CCCC
CCOC(=O)CC1
OB(O)c2cc(O
c3cccc(CN
4CCN(C(=O)OC(C)(C)C)CC4)c3
C(C(=O)OCC)C1
c2cccc(O
c3ccc4c(
B(O)OC
CC(=O)OCC)c2
)CCN(C(=O)OC(C)(C)C)CC1
C(C)(C)(C)OC(=O)N1CCN(C
CC(=O)OCC
C1CN(C(=O)OC(C)(C)C)CCN1C
c2ccc3c(c2)
B(O)OC3
CC(=O)OCC)c1
c1ccc(Oc2cc
c3c(c2)
CN1CCN(C(=O)OC(C)(C)C)CC1
CC(C)(C)OC(=O)N1CCN(C
c1c(O
3CCN(C(=O)OC(C)(C)C)CC3)c2
B(O)OC2CC(=O)OCC
2CCN(C(=O)OC(C)(C)C)CC2)cc
c1cccc(CN
3CCN(C(=O)OC(C)(C)C)CC3)c1
c12cc(O
C(CC(=O)OCC
B2O
C(=O)OCC)O
B(O)
c2cc(O
B1
(O)OC(C
C(=O)OCC)
2CCN(C(=O)OC(C)(C)C)CC2)c1
)CCN1C(=O)OC(C)(C)C
c12ccc(O
COc1ccc(-
c2c(F)cc
c2[nH]cnc2
C)C(=O)N
3)c(OC)c1
c12c(ccc(F)c1
c1ccc(OC)cc1OC
)NC(=O)/C2=C\
c1[nH]cnc1C
c1(-c2ccc(OC)cc2
C)C(=O)N2
c1cc2c(
c(-c3ccc(OC)cc3
c1c(F)ccc2c1
c[nH]c1
c2ccc(F)
OC)c2
c(F)
N1C(=O)/C(=C\
C)c2
c1cc(OC)cc(OC)c1
c1(-c2c(F)cc
c(OC)cc1OC
c3ccc(F)
c(-c4ccc(OC)cc4
OC)c3
2)[nH]
cnc1C
C(=C1
)\
c1nc(C)
2)[nH]1
c1c(OC)cc
c(-c2c(F)cc
3)c1OC
c1(F)ccc2c(c1
c1cc2c(cc
c3nnc(C)n3
c1(C)nn
c2ccc3c(cc
n3C
n1nc(C)
c1cccnc1C
n1c(C)cc2
nc(C)
c3c(cc(C)
c(C)nn2
c(C)cc2
c1(Cn2
c(C)cc3
c2nnc(C)
c1cc2nn
c(C)n2
c2cc(C)n(C
c(cc
n2c(C)n
n23)c1
c1c(C)n(C
c2ccc3n
nc(C)n3
C(c1ccccn1
CC(C)(C)OC(=O)N1CCC
O[Si](C)(C)C(C)(C)C
[Si](C)(C)(OC
[C@H]2CCCN2C(=O)OC(C)(C)C
[C@H](CO
N(C(=O)OC(C)(C)C)C1
C[Si](C)(OC
O(C(=O)N1CCC
c1cc(CO[Si](C)(C)C(C)(C)C
[C@H]2CCCN2
C(=O)OC(C)(C)C)c1
[C@H]1CCCN1C(=O)OC(C)(C)C
CC(C)(C)[Si](C)(C)OC
O=C(OC(C)(C)C)N1CCC
[Si](C)(C)C(C)(C)C
)cccc(OC
COc1cccc(C
[C@H]1(CO
)n2)CC
CN1C(=O)OC(C)(C)C
CO[Si](C)(C)C(C)(C)C
[C@H]1CCCN1
C1CCN(C(=O)OC(C)(C)C)
2CCOCC2)CC1
c2cccc3ccccc23)
2CCN(CCN
3CCOCC
(C#N)
c2ccccc2OC)
c2cccc3ccccc2
c1ccccc1OC)
C1COCCN1
)[C@H](
N1CCN(C(=O)
)N1CCOCC1
[C@H](c3ccccc3
c3cccc4ccccc34
cc2ccccc12
[C@@H](c3ccccc3
3CCN(CCN
4CCOCC4)CC3
c1ccc(OC)c(
c1ccc2c(
O(C)c1ccccc1
c1cc(
3CCOCC3)CC2)
CCN1CCOCC1
c2cccc(
4CCOCC
4)CC3)c2c1
c3ncnc4cccc
)c3
c1ccc2ncnc(N
c3ccc(Oc4cc
c(C)nc4)c(C)c3
O[C@@H](C)
)c2c1N
c2)c(C)c1
c(Oc2ccc(N
c1c(Nc2ncn
c3cccc(O
)c23)cc
c(Oc2cc
[C@H](C)O
c1cccc2ncnc(Nc3cc
c(Oc4cc
c2ccc(Oc3cc
c(C)nc3)
c(C)c2
)cccc2n1
c2)c(C)cc1
Nc1ncn
c1cc(C)ncc1
Oc1ccc(N
3)cc1C
c1ccc(C)nc1
[C@@H](C)C(=O)N
)ncn2
c12c(O
ncnc2N
Cc1cc(N
c1(Nc2ncn
)cnc1C
CC(C)=C
c1ccc2c(c1)OCO2
c1(C=C
(C)C)cc
c2c(c1)OCO2
OCO2
=C(C)C
)cc2c1OCO2
c(C=C
)ccc1OCO2
)ccc2c1OCO2
O1CO
c2ccc(C
C1Oc2ccc(C
)cc2O1
CC(C)(C)OC(=O)N1CCC(C
c2ccc(C(=O)OC
c3ccccc3)cc2)CC1
O(C(=O)N1CCC(C
C(CO
c1ccc(C(=O)OC
)C1CCN(C(=O)OC(C)(C)C)CC1
C(CCO
C3CCN(C(=O)OC(C)(C)C)CC
Oc2ccc(C(=O)OC
CC1CCN(C(=O)OC(C)(C)C)CC1
O=C(OC(C)(C)C)N1CCC(C
c2ccccc2)ccc1
c1ccc(-c2co
c3ncn
[C@H](C)CCCC
C(=O)OC(C)(C)C)c2
c2ccc(CC)cc2)
c2c(O
)ncnc12
C(=O)(CCCC
cc(-c3cc
c(CC)cc3
C(CCC
CC(=O)OC(C)(C)C
n1cnc(O
O[C@H](C)
c12ncn
c1ccc(CC
co2
c2co
co
c1ccc(CC)cc1
O=C(CCCC
c2cc(C(F)(F)F)cc
c1cncc(F)c1
c1ccc2cc
c3cncc
(F)c3
)c(=O)c2c1
c(C(F)(F)F)cc2
c(=O)n1-
c(=O)n(-
c1ccn(-
)c2=O
c1cncc(-
cncc(F)c1
)c(=O)c2cc1
)c(=O)c12
c2cncc(F)c2
c1ncc(F)cc1
c1(F)cn
n1(-
c(Cl)nc1-
co1
nc1-c1n
sc1C(=O)OCC
c1nnc(-
c2nc(Cl)
sc2
n1co
c(-c2n
C(=O)OCC)n1
coc1-
C(=O)OCC)n
c1(C(=O)OCC)s
C(=O)(OCC
)c1s
O=C(OCC)c1s
co2)c1
co2)
c(C(=O)OCC)s1
CCCS(=O)(=O)
c1cc(OCCCCCC
c2cccc(OCCCC(=O)OCC)c2
CCC(=O)OCC
)cc(-c2cc
sc2)c1
sc2)cc1
S(=O)(=O)CCC
C(=O)OCC)c1
CCCCCO
sc3
)cc(S(=O)(=O)
)c2)cccc1
OCCCC(=O)OCC
CCCCCCO
CCC)c1
c1cccc(OCCCC(=O)OCC)c1
c1cccc(CCCCCCO
)c2)c1CCC(=O)OCC
C(C)OC(=O)CC
C(CC)
CCOC(=O)CCCO
)c1)
(OCCCCCC
c3cccc(OCC
)c2)cs1
CCC)c2
)cccc(OCC
c1(CCC(=O)OCC
CCOC(=O)CC
O(CC)C(=O)CC
s1cc
CCC)cc1
[C@@H]1CN
(C(=O)OCc2ccccc2)CC
N1CC[C@@H](C
2CCCCC2)
[C@H](NC(=O)O
c2ccc([N+](=O)[O-])cc2)C1
3CCCCC3)
c3ccc([N+](=O)[O-])cc3
)C2)c1
[C@@H]1(C
c2ccccc2)C
C1CCCCC1)
c1cc([N+](=O)[O-])ccc1
OC(=O)N
)C2)ccccc1
C1CCC(
[C@@H]2CCN
(C(=O)OCc3ccccc3)C
c2ccc([N+](=O)[O-])cc2)CC1
c1(OC(=O)N
c3ccccc3)CC
)ccc([N+](=O)[O-])cc1
N(C(=O)O
c1ccc([N+](=O)[O-])cc1)
C1[C@@H](N
c2ccc([N+](=O)[O-])cc2)
CCN1C(=O)OCc1ccccc1
C1C[C@@H](C
(=O)N
C1CCCC(
c1([N+](=O)[O-])ccc(OC
[C@@H](OC
(CC)CC)
[C@@H](NC(C)=O)
[C@H](N=[N+]=[N-])
[C@@H]1O
(CC)O
[C@@H]1C=C
(C(=O)OCC)
[C@@H](OS(C)(=O)=O)
[C@@H](N=[N+]=[N-])
[C@H](OS(C)(=O)=O)
[C@H]1OC
=[N+]=[N-])
[N+](=[N-])=N
)[C@H]1
C(=O)(OCC)C1
[C@@H]1(OC
)C=C
[C@@H]1N=[N+]=[N-]
[N-]=[N+]=N
(OS(C)(=O)=O)
CCC(CC)
c2ccc(Br)cc2)cc1
c2ccc(NC
)c([N+](=O)[O-])c2)cc1
)c([N+](=O)[O-])c1
c2ccc(Br)cc2)ccc1
)ccc(NC
c1ccc(Br)cc1)
c2ccc(Br)cc2)cc
c3cccc(C)c3
c3ccccc3)cc2
c1cccc(C)
C(C)=O)c1
c2c(C)cccc2
C(=O)Nc2ccc3c(c2
-c3ccccc3
c12ccc(NC(=O)
c3ccccc3)cc1
c1(C)cccc
c2cccc(C)
c2-c2ccccc2
C1C(C)
c3ccccc3)ccc2
c1cccc(C)c1-
c3ccc(NC(=O)
c4cccc(C)c4
N1C(C)=O
NCCO
oc2)cc1
C(CN)O
O(CCN
c1(OCCN
)ccc(-c2cn
oc2
OCCN
c1cc(OCCN
N)cc1
c2ccc(OCCN
c1ccc(OCCN)cc1
)cc2)cn1
ncc1-
C=C(
)c1ncc
cc1[N+](=O)[O-]
C(C)OC(
(=C)OCC
C(=C)OCC
)c1[N+](=O)[O-]
c1ccc([N+](=O)[O-])c(C
c1cccc(-c2ccc(C
C3SC(=O)NC3
c1ccno1
c2ccc(-c3cccc
4)c3)cc2)
c1(-c2cccc(C
C2SC(=O)NC2=O)cc1
c1cc(CC2
SC(=O)N
C2=O)ccc1
no2)c1
SC1C
c1ccc(-c2cccc(C
3)c2)cc1
c1(CC2
C2=O)cc
c(-c2cccc(C
2)cc(-
c(C(=O)N(C)C
4SC(=O)NC4=O)cc3
)c2)o1
SC(=O)NC1=O
c1cc(-c2cccc(C
3)c2)ccc1
no2)cc1
c1ccc(-c2ccc(C
=O)cc2)cc1
c1cc(C(=O)N(C)C
)on1
)N(C)C(=O)
N1CCN(
[C@@H](c3cc
C)CC2)CC1
[C@@H]2CC[C@@H](N
)CC3)CC2)
C)CC2)
c1cc(C)cc(C)c1
c(C)cc1C
[C@H](c2cc
)CC2)CC
c(C)cc2C)CC1
OC)CCN1
[C@@H]3CC
c4ccc(C)cc
C1C[C@@H](N
c1ccc(C)cc1C
CC[C@H]1
c1sc(N
)nc1-
c1cccc(C#N)c1
c2cccc(C#N)c2
)sc1
)sc2
)cccc(C#N)c1
c1nc(N)sc1
c2nc(N)sc2
c1ccc(-c2nc(N
)cccc(-
c1cccc(-c2nc(N
c1c(C#N)cccc1
)sc(N
sc(N
s1c(N)n
c(-c2cccc(C#N
c1(N)nc(-
c2cccc(C#N)c2)
Nc1n
)c2)
n1c(N)s
[C@@H](C#N)
N1C(=O)CN
[C@@H](C#C
)CC[C@H]1
C(=O)(CN
)N1
(C#C)CC
C(#C)
[C@@H](C#N
C1C[C@H](C
(C#N)CC
#C)
)C1CCCC1
CC(=O)N2
#N)C1
Cc1cc(OCC
S(=O)(=O)c2ccccc2)c1
Oc1cc(C)cc
(C)cc
S(=O)(=O)c3ccccc3
C1(COc2cc
c3ccccc3)c2
O=S(=O)(O
c1cc(C)cc
C(C)(C)(C)OC(=O)N1CCC(C
c1cc(C)cc(O
c1c(C)cc(OCC
2CCN(C(=O)OC(C)(C)C)CC2)cc1
c1(S(=O)(=O)
c1(C)cc(OCC
[C@@H](C)C
[C@H]1OC(=O)
[C@H](CC
O=C(O
[C@H](C)CC
(C)C)[C@H](CC
[Si](C)(C)
[C@H](NC(=O)OC(C)(C)C)C(=O)O
[C@H](C)CC[C@H]1
(C(C)C)CC
[C@@H](CC
(C)C)OC(C)(C)C
C[Si](C)(OCC
)NC(=O)OC(C)(C)C)
(OC(=O)
[C@@H]1(C)CC
[C@@H](C(C)C)
O[Si](C)(C)C(C)(C)C)
(NC(=O)OC(C)(C)C)C(=O)O
CC(C)(C)[Si](C)(C)OCC
[C@@H](OC(=O)
[C@@H]1C(C)C
C(C)(C)(C)[Si](C)(C)
[C@@H]1CC[C@@H](C
COC(=O)C
c(CO)
C(=O)OC)c1
c1cc(CO)
C(=O)OC)cc1
OCc1ccc(F)cc1
C(C(=O)OC)
c1(CC(=O)OC
c1(CO)cc
Oc2ccc(C
c(CC(=O)OC
)c2)cc1
c(CO)c1
)c1ccc(C
C(Oc1ccc(C
CO)
c1cc(COc2ccc(C
C(=O)OC)c2
O(C)C(=O)C
OCc1ccc(OC
Cc1cc(O)
c2c3c(
oc(=O)
c1c(O)cccc1
C3=O
O=c1o
c3c(O)cc
3)C(=O)
c1cccc(O)c1
c1(=O)o
c12cc(C)cc
(O)c1
=O)C(=O)
c2c(O)cccc2
c12c(O)cccc1
c3cc(C)cc
3)C2=O
c2cccc(O)
Oc1cccc2c1
c1oc(=O)
c1(C)cc(O)
c2cccc(O)c2
(O)c3
o1c2c(
C(=O)c1cccc(O)c1
O)C(=O)
c1c(C)cc2
c(=O)o
c3c(c2c1
Oc1cc(C)
c3ccc(N)cc3
c(C)c(C(=O)OCC
)c(C)c3
c2cc1N
c12ccc(N)cc1
c(C(=O)OCC)c(C)
Cc1c(C(=O)OCC
c(C)c1C(=O)OCC
c1cc(N)cc2
)c(C)c1
c1cc(N)ccc1
c12cc(N)ccc1
Nc1ccc2[nH]
c2ccc(N)cc2
)ncc12
)N1CC
2CC2
(c2ccc(Cl)cc2)C1
(c3ccc(Cl)cc3
2CC3CC
C1N(C(=O)
CC12
2CN(C(=O)
3)ccc(Cl)cc1
)CC12
cc(C(=O)N
C(=O)N1CC
(c2ccc(Cl)cc2)
c1ccc(Cl)cc1)C2
)C3)cc1
Clc1ccc(C2
cc(F)c1
N1CCN(c2ncc
c3ccc(S
)cc23)CC1
c2ccc(S
c1ccccc1S
3)c2c1
N1(C(=O)OC(C)(C)C)CCN(
c1ccc(S
c3ccnc(N
)c(C(C)(C)C)c1
c2)ccccc1
c1cc(S
)cc2c(N
ccc12
c2cc(S
c1c(S
c2ccnc(N
3CCN(C(=O)OC(C)(C)C)CC3)c12
c(S
c1ccc(C(C)(C)C
c1cccc(S
COc1cc2
