COC(=O)
[C@H](C
CCCN
)N
C(=O)N
c1cc(OC
)cc(C
(C)(C)C)c1
O
C(N
)CCC
[C@H](N
O)
C(=O)OC
[C@@H](C
)(N
NCCCC
c1(O)
c(NC(=O)N
)C(=O)OC
)cc(OC
)cc1
C(C)(C)C
C(=O)(N
N[C@@H](C
N(C(=O)N
)C(=O)OC)
c1c(OC
)cc(N
C(=O)N[C@@H](C
)c(O)
c1C
(C)(C)C
CO
c1cc(N
c(C(C)(C)C
)c1
CC(C)(C)
O(C)
c1(N
O(C)C(=O)
c1c(N
)c(O)c1
NC(=O)N
C(CN
)CC
c1(C(C)(C)C
C(C)(C)(C)
O=C(N
c1cccc2
cn
ccc1
2)
c1cc([N+](=O)[O-]
)c(S
c2c(Cl)cn
cc2
Cl)
s1
[O-][N+](=O)
c1cc(C(=O)N
c2cccc3
ccc2
3)
sc1
S
c1c(Cl)cn
cc1Cl
O=[N+]([O-]
)c1cc
(C(=O)N
c1(NC(=O)
c2cc([N+](=O)[O-]
c3
c(Cl)cn
cc3
s
2)cc
cncc
c12
n1cc
(Cl
c2s
c(C(=O)N
c3cccc4
ccc3
4)cc2
[N+](=O)[O-]
)c(Cl)c1
[N+](=O)([O-]
S(
c1s
3)cc1
N(C(=O)
)
3)cc
([N+](=O)[O-])c1
c1ccc(NC(=O)
s2)
c2cc
ncc1
2
c1ncc
)c1Cl
c1cc
c2cncc
c2c1
NC(=O)
c1([N+](=O)[O-])cc
c1(S
c1(C(=O)N
([N+](=O)[O-]
c1(Cl)cn
cc(Cl)c1
CCN(CC
)C
c1ccc(-c2n
c(C)c(C
Oc3cc
c(
4
[C@@H]
4C
c4ccccc4)
c4cc
o
n
4)cc3
)s
2)cc1
o1
cc
C(=O)N2
[C@@H]2C
c2ccccc2)
c2ccc(OC
c3s
c(-c4cc
c(CN
(CC)CC
)cc4)n
c3C
)cc2)n1
c1(OC
c(-c3cc
)cc3
)nc2
C
)ccc(
n2)cc1
c1ccccc1
C[C@H]1
N1
C(=O)C
[C@@H](
c1ccc(OC
)cc1)
on1
c1cccc(C
[C@H]2C
OC(=O)
N2
(c2ccc(OC
)cc2)
n2)c1
c1cc(-c2n
2)ccc1
CN
c1cc(
no1
c1(C)
nc(-
c2ccc(CN
c1ccc(
c(-
nc(C)c1
C(C)
N(CC
)ccc1
C(=O)N1
[C@@H]1C
c1ccccc1)
O(C
nc1
C)
c1(CO
c2ccc(
3
[C@@H]3C
c3ccccc3)
c3cc
n3
nc1C
n1c(-
c(CO
(C(=O)C
n2)
n1o
C)cc1
C1(=O)
OC
Cc1n
C(c1ccccc1)
[C@H]1
CC1
(C)CC
2CCN(c3cc
S(=O)(=O)
c(NCC
5
CN(C
(C
F)C
)c([N+](=O)[O-]
)c4
)c(O
c4cn
c5
[nH]cc
c4)c3
)CC2)
=C(
c2ccc(Cl)cc2)
C1
c1cc(Cl)ccc1
=C(C
N
CCC
1
C(F)
C(C
F)
N1CC
(CN
c3ccc(N
4CCN
(CC
c6
c(Cl)cc
6
(C)(C)
CC
5)CC
c3cn
c4
c4c3
)cc2
)C1
N1(CC
c3ccc(Cl)cc3
CC2)
CCN(c2cc
CC4
)c3
)c2)CC1
C1CN(CC
CCN1
c1ccc(C(=O)N
c2ccc(N
CC3
C3
)c2
c2cn
c3[nH]
c2)c1
c1cc2cc
(O
c3cc(N
4)ccc3
)cnc2
[nH]1
C1(C)(C)
)ccc(N
2CCN(CC
c4ccc(Cl)cc
4)CC
)CC2)cc1
c1cn
c2[nH]cc
c1ccc(N
CC2
C2)
c([N+](=O)[O-])c1
)CN1
F
c1(Cl)cc
c(C2
3CCN(
c5cc
)c5
3)CC
c12ncc
[nH]2
)S(=O)(=O)
c2)cc1
N1CCN
2)CC1
c1n
c2cc1
)CC2)ccc1
c1ccc(S(=O)(=O)
3CCN(CC
4)CC3
O=S(=O)
(NC(=O)
c1cc(C2
Cl
CCO
c1ccc(O
c2ncnc3
C2CCN
(C(=O)OC
3CCCC
3)CC2)
c(F)c1
n1(C
2CCN
ncc2
c(O
c3ccc(OCC
F)n
cnc21
C1CCCC1
N1CCC(
n2
ncc3
c(Oc4cc
c(OCC
)cc4
cnc3
C1CC(
CCCC1
2CCCC
2)CC
C(
c1cc(OCC
)cc(F)c1
c1ncnc2
C1CCN
c1(O
3)CC2)cc
)cc1F
C1CC
C(OC(=O)
N2CC
ncc4
)cc
ncn
C1CN
2CCCC2)
CCC1
n1
c1c(OCC
2)c1F
c2ccc(OCC
)cc2F)
n(C
3CCN
4CCCC
3)c2
)ccc1O
C(C)O
ncnc2
c12cn
)c1n
cnc2
c1ccc(OCC
n1cn
c2c(
3)CC2)c1
C1(
CCN
c(-c2cc
(C#N
-
c1ccc(-
n2cc
cn2)cc1
cn1
c2c(-c3cc
)ncn
2C
N#C
c2ncn
(C)
c2-
c2ccc(-n3
3)cc2)c1
n(-c2cc
c(-c3
c(-c4
cc(C#N
4)n
3C
)cc2)c1
c(C#N)cc1
-c1n
c1-
c1(C#N)cc
c1nc(-c2cc
c(-n3
3)cc2)
n1C
c1cc(-
)ccc1-
c1(-
)ccc(-
c1cc(C#N
)ccn1
c1ccn
n1-
n1(C)
c1c(C#N
c1(-c2cc
ncn1
c(-c2n
cn3
)cc2)cc1
C#N
C(#N)
)cc(-
c1c(-c2cc
O2)
c(-c2ccc(OC
c4ccccc4
)ccc(OC
2CCCCO
2)c1
c3ccccc3
c1cc(-c2cc
)ccc2
c2ccccc2n1
C1CCCC
c2ccc(C#N
O1
O(
c1ccc(C#N)cc1
CCCCO1
c1(COc2cc
)ccc3
3CCCCO
3)cc2
c1cc(C
Oc2cc
c2ccccc12
c12cccc
c1nc(C
Oc1cc
nc(C
)ccc4
)ccc12
c1ccc(C
)n2
C(O
OC1
)cc2)C1
n2)cc
c1cc(C#N)ccc1
OC1CCCCO1
c2ccc(C
)nc2c1
c1cccc2cc
c(C
)nc12
c(OC
c1cc2cccc
c2nc1
c1ccc(-c2cc
COc1ccc(C
(O)C
c2c(Cl)
c[n+]([O-]
)c2c1
(CCC
)O2
)c2c(c1
C(O)C
c1c(Cl)
[O-]
[n+]1
(Cl)
C(O)
)c3c2
OC2
(CCCC
c(Cl)c1
c1(Cl)
)cc(Cl)c1
CC(O)
([O-]
c(Cl)
Cl)cc
c(OC)c1
CCC2
(C1
)O
c1c(OC)ccc(C
Cl)c1
O2
c2c(OC
)ccc(C
Cl)c2
2CCCC2
c1
)OC1
c2c(C
c(OC)c2
OC(C
c1(C
c(Cl)c(C
c
CC(C)(C)OC(=O)N
c1ccc(Br)cc1
NC(=O)OC(C)(C)C
c(Br)cc1
c1cc(Br
)c(Cl)cc1
Br
c1(Br)cc
c1c(Br)cc
(Br
c1cc(Br)ccc1
(NC(=O)OC(C)(C)C
)C(=O)
)C(=O)OC(C)(C)C
OC(C)(C)C
O(C(=O)N
)C(C)(C)C
OC(=O)N
P(=O)
(COC
c2c(N)n
n1CC
OCC
c1nc(N
P(=O)(OCC)OCC
)n
c3ccccc3)c2
n1c(C
c(N)n
)c1ccccc1
O(CC)
c1ccccc1)C
)n1
c1(N)n
2CC
C(OC
nc2
cnc(N
)c12
c1(CC
n2c(C
)nc3
2)ccccc1
c2ccccc2)c1
c1cccc(CC
c2ccccc2)c2
ncnc(N
c(N)c1
O=C(O)
C(=O)NC
ccccc12
cccc
OCC(=O)
cccc2
c1cc(CN
c2ccccc2c1
O=C(NC
ccccc1
(OCC
(=O)O)
C(=O)O
N(C
c2cccc
c1c(C
O)cc
c2
C(=O)O)
cc12
c1(CN
C(=O)
(NC
c1ccc(CN
c1ccc2ccccc2c1
CCOC(=O)
c1nn
[nH]c1
c1ccc(OC)c(OC)c1
c1(C(=O)
)c(OC)c2
)[nH]
C(=O)OCC
)c(OC)cc1
c1[nH]
c1(OC)cc
(C(=O)
c2[nH]
nn
)ccc1OC
)c(OC)c1
O=C(OCC
)c1nn
C(=O)(OCC
c1cc(C(=O)
C(C)OC(=O)
)cc(OC)c1
c(C(=O)OCC
c1(C(=O)OCC
n1n
c(C(=O)
)c(OC
)c2)
[nH]
)c2)c1
c1c(C(=O)
O(CC)C(=O)
O=C(
C(=O)(
CNC(=O)
[C@@H](NC(=O)
[C@@H]1CC
CN1C(=O)
[C@@H](N
C(=O)OCc1ccccc1
)C(C)C
[C@H]
N1CCC[C@H]1
CC(=O)N
[C@H](C(=O)N
CC(=O)OC
)C(C)C)
OCc1ccccc1
C(C)(C)
[C@H](NC(=O)
C(NC(=O)
O=C(C
2CCC
[C@H]2
)ccccc1
c1ccccc1COC(=O)
[C@@H](C(=O)N
N1C(=O)
C(=O)(C
CC(C)
C(NC
c[nH]
3)CC2)cc1
c2c[nH]
cn2)
CCN(Cc2ccccc2)CC1
c1c[nH]
Cc1ccccc1
CN1CC
N1CCC(N
C1CN(C
c2ccccc2
)CCC1
NC
2CCN(C
c3ccccc3)CC2)
c[nH]1
N1(C
c2ccccc2)CC
C1CCN(C
c2ccccc2)CC1
cc1
cnc1
[nH]1cn
)CC2)c1
)c(Br)c1
c1ccc(O)cc1
c2ccc(O)cc2
Br)cc
c1ccccc1CO
c1cccc(CO
Br)c1
c1ccc(CO
Br)cc1
O(Cc1ccccc1)
O)cc1
c1cc(O)cc
(Br)c1
)c(
c1(O)cc
c1c(O)cc
(O)
c1cc(O)ccc1
c2ccc(O)cc2)
c2cccc(Cl)c2
c(O)cc3
(C)C
(Cl)c1
)nc2-
c1(-c2n
c(O)cc1
(C)C)c2
(C(C)C
)nc(-
)nn2
C(C)C
c(Cl)c2
c1c(-
c1cc(Cl
)c(-
c2ccc(O)cc
2)n
c3ncccc3
c2c(c1
)N(C(=O)
)Cc1ccccc1
S2
c12ccccc1
CN(C(=O)
c1cccnc1
N1C
c2ncccc2
c2ccc(C(=O)N
c4n
cccc4
N1(C(=O)
)cc2)C
CN2C(=O)
c1ccc(C)
c1ccc2c(
n1)
S1
c2cccnc21
c1cccc2c1
c1ncccc1
)C2
c1cc(NC(=O)
C(=O)N1C
c(C)c1
c1cccc(C(=O)N
FC(F)(F)
c3ccccc32)
c(Br)c1
c1(C(F)(F)F)cc
c(N2CC
CCN(
c2ccc(C(F)(F)F)cc2
Br)
c2ccccc21
c1cc(C(F)(F)F)cc
(C(F)(F)F)cc
N1(
)CCO
c1ccc(C(F)(F)F)cc1
C(F)(F)(F)
C1CN(
c1ccc2c(c1
)OCC
c1cc(C(F)(F)F)ccc1
c(C(F)(F)F)cc1
N(
c1c(C(F)(F)F)cc
C(F)(F)F
C1CO
)N(
c1(
SC
)ncc
cc1F
c1(F)cc
c(SC
(C)C)c1
)c(F)c1
c1ccc(F)
n1cccc
(F)c1
N1CCN(C
2=N
n3cc
c1c(Cl
)CC1
)=N
O=C(OC
)CCN1
C1=N
c2ccc(Cl)cc2
cc21
c12cc
)ccc1N
c1cc(C)
C2
C(=O)C(C)(C)C
n(
=C2
)C(C)(C)
c1N
c2cc(Cl)ccc2
N=C(N
c2cc(C)
cn2
cn1C
c1ccc2c(c1)C
C(=O)(OC
c(F)ccc1
NC(C)C
CCNCC1
)c2n
c(F)cc
c(NC
(C)C)
c(N
(CC)C
2CCNCC2)
C1CC(N
C1(N
)CCNCC1
c(F)
C1CNCCC1
c1cc(F)
nc(N
2CCNCC2)c1
(CC)
(
O=C1
/C(=C/
4CC4
C1CC1
C2CCCC
/C=C
\
C3=O)
n12
C3CCCC
3CC3
/C
=C1
C1=O
O=C1N
/
C1=C
3)n
3CC3)n
ncc
4=O)
c3n
C2=O)
c2nc(N
C1CCC(N
2)C1
2CC2)
n2ncc
c2n1
=C/
c2cc(N
c3c(
3)CC1
=C\
COC
c1cc(Cl)cc(Cl)c1
C(OC)
C(=O)(OC(C)(C)C)
O(C(=O)
C(C)(C)(C)OC(=O)
CC(C)(C)OC(=O)
O=C(OC(C)(C)C)
(OC
)cc(Cl
c1c(Cl)cc
(Cl)cc1
c1(Cl)cc(Cl
)cc1Cl
O(C)C
c1cccc([N+](=O)[O-])c1
C(N)
)cccc
c1ccc([N+](=O)[O-])cc1
cc(C
N)c1
[N+](=O)([O-])
O=[N+]([O-])
c1c(CN
)cccc1
C#C
c1co
[C@H]3
4CCC
3CC
)cc12
c1c(C(=O)N
[C@H]2CN
3CCC
3)ccc2
cc(C#C
c3o
c1cc2
)c2cc1
[C@H]1CN
C1CC2
1C
[C@@H]2
c2o
c1o
#C
c2cc(C(=O)N
C(#C
co
2CCC(C
C1)
c(C#C
c1(C#C
OCCO
S(C)(=O)=O)
c1cccc(Cl)c1
c1ccc(Cl)cc1
OC(C)=O
O=C(C)
OC(C)=O)
CS(=O)(=O)
OCCOCC
(C)=O)
C(C)(=O)
C(OCC
OS(C)(=O)=O)
c1c(Cl)cccc1
S(C)(=O)=O
O(CC
C(CO
O=S(C)(=O)
S(C)(=O)
(=O)
c1ccco1
N1CCC(C
c2ncc
(C(=O)NC
c1cncc
)N2
Cl)N
)CC2
oc1
(Cl)c2
nc1N
C3CCN
c2n
c2cc(
Nc1n
co1
cc2cc
O=
C1CN(c2cc
ncc2)
c1ccc(OCc2ccccc2)cc1
c4ccccc4)cc3
C2)cc1
c3ccccc3)cc2)
CN1
c1ccncc1
c1cnccc1
C(=O)C1
=O)cc
CC(=O)
c2ccccc2)ccc1
N1CCN(c2cc
=O
(c2cc
=O)cc2
=O)ccc1
c2ccccc2)cc1
=O)cc1
)C(=O)C2
CCC(N
C(=O)OC(C)(C)C
c(=O)
CCNC(=O)OC(C)(C)C
(N
c(=O)n(C
)c(C
C(CC
NCC
)n(C
)c(=O)
cccc3
=O)c1
Cn1
c1=O
=O)
)CN
C(CCN
)NC(=O)OC(C)(C)C
c1(=O)
c1ccccc1O
c(=O)c1
(C(=O)O)
n1ncc
C(C)=O)cc1
C(C)=O)
C(=O)(O)
=O)C1
)C(=O)O
c1cccc(O
3CCCC3
)C(=O)O)
C(C)=O
c1cc(O
(C)=O)c1
c1c(O
C(C)=O)cc
c1nn(C
Oc1ccccc1
c1ccc(Cl)
c(-c2cccc
n2cn
c(-n4
4)nc3
c2)cc
c(-c4cccc
n4
)cn
3)nc2
)ccc1Cl
c1ncn
c(-c3cccc
)cn1
c1ccccn1
c1cccc(-c2cc
Cl)n1
c1cc(Cl)
c(-n2
c1c(NC(=O)
)nc1
n1(-c2cc
)cn2)
C(=C
(C(C)=O)
=C
C1(C
O=C
(C)C1
C1C2
C12
=
C(CCC
C1CC(C
(=C
C(=C)
=C)
C=CC
=CC(=O)OCC
c1cc(CC
)ccc1Br
c(CC
C=
CC(=O)OCC
=CC
)C(=O)OCC
OC(=O)C
N1CCN(c2n
nc(NC
4CCOCC
4)c3
3CCN(C(=O)OC(C)(C)C)CC
C1CCOCC1
c2cc(-c3cc
(C(=O)OC(C)(C)C)CC
n2)CC1
CCO1
C1CN(C(=O)OC(C)(C)C)CC
3CCOCC3)c2
c2c(N
)cc2c1
C1COCC
C1N
2CCN(C(=O)OC(C)(C)C)CC2)
nc(-c2cc
2CCOCC2)c1
c1(NC
2CCOCC2)cc
(-c2cc
)nc(N
n1c(-c2cc
N1CCN(C(=O)OC(C)(C)C)CC1
N1(c2n
(C(=O)OC(C)(C)C)CC1
CN1C
c(Br
CN(C)C
c(Cl)cc1
-2
c1cc2c(cc1
Cl)C
N(C)C
)ccc2c1
c2n(
c1(Br)n
(C)C(=O)
[C@@H]1
(C)C)CC
C(=O)N(C)C
N(C)(C)
C1C
(C)C)N
c2ccccc2)C1
N2CCC
(C)C)cc1
c1cccc(COC(=O)
)N(C)C
c1ccccc1)C(=O)
c2ccc([N+](=O)[O-]
)cc2C
SCC
(F)(F)F)c1
(F)(F)F
(F)(F)F)
OC)
C(C(=O)OCC)
c1(Oc2cc
(CC(=O)OCC
OC)cc
c([N+](=O)[O-])cc1
c1cc(Oc2cc
(F)(F)F)cc1
c1(OC)ccc(C
C(=O)OCC)cc1
c1c([N+](=O)[O-]
OC)c1
S(C
(S(=O)(=O)
)OC(C)(C)C
S(=O)(=O)N
)CC2)cc
C1(CN
)CCN(
(S(=O)(=O)N
)CC3
cc2c1
3)c2c1
c(S(=O)(=O)N
)cccc12
)cccc2
[C@@H]2CC
[C@@H](O)
c1cc(C(=O)OCC
[C@H]1O
(C(=O)OCC
(O)CC
Nc1cc
c(C(=O)OCC)cc1
c1c(C(=O)OCC
CC2)c1
[C@H](O)
O=C(OCC)
c1cc(C(F)(F)F)cc(C(F)(F)F)c1
CCCC
NC1
CCN(C
(OC)c1
)c(C(=O)N
c(C(F)(F)F)c1
(F)(F)F)cc
C(F)(F)F)
(OC)
C2CCN(C
(C(F)(F)F)
(C(F)(F)F)c1
CCCCC
CCCCN
S(=O)(=O)c1ccccc1
c21
c1cccc
c12c(
)c3n
c4ccccc4)c3
C(CC)CC
CC(C)C
n1c(=O)
n(C)c(=O)
c(Cl)cc3
)nc21
c2c3c(
n(CC
n2C
c(Cl)cc2
(C)c1
CCNC(=O)
c4c(c3
4CC
3)n1
(CC(C)C
n(C)c2
CCNC
n1c2c(
)n1C
c1ccc2[nH]
2)n1
nn(C
4)
n2n
c3c(c2
c2cc(Cl
c1c2c(
c1(Cl
)NC(=O)
C(c2ccccc2)
(c2ccccc2
C(=O)N(C
2CCN(
(c1ccccc1)c1ccccc1
c1ccc(C2
(c3ccccc3
c4ccccc4)CC3
)(
)C3
=O)CC
c1cccc(C2
c1(C2
)C2=O)
c1cccc(N
CCN2
)C1=O
=O)CC1
(C)O
c1ccccc1C
c1cccc(OC
c1cccc(C)c1
c1ccc2c(c1)
(C)C(=O)OC(C)(C)C
c1ccc(Cl)c(Cl)c1
(C(=O)OC(C)(C)C)
[C@H]1CC
[C@@H](c2cc
c(Cl)c(Cl)c2
c2ccc(C(=O)OC
)cc21
c1cc(C(=O)OC
[C@H](
N(C)C(=O)OC(C)(C)C
C(=O)OC)
C(=O)OC(C)(C)C)
c(Cl)c(Cl)c1
c2cc(C(=O)OC
)ccc21
C(=O)(OC(C)(C)C
)N(C)
O=C(OC(C)(C)C
c1cc(Cl)c(Cl)cc1
O=C(OC)
c1c(C(=O)OC
c1c(
c(Cl)c1Cl
N(C)
c(C(=O)OC)cc1
C(=O)(OC)
Oc1ccc(C
CCCCCCCC
S(=O)(=O)c2cc
c(C)cc2
OCC1
c1ccc(C)cc1
OC)cc1
S(=O)(=O)c1ccc(C)cc1
C1(C)C
CCCCCCC
)C(C)
c1cc(C)ccc1
C(CCCCC
C1(C)
c2cc(OC
CCCCC1
c(C)cc2)
c12cc(OC
2CCC(
c3ccc(C#N)cc3
NS(=O)(=O)
c2ccc(C#N)cc2)
CCN1C(=O)
c(NS(=O)(=O)
c1ccc(S(=O)(=O)N
3CCC(
c(C#N
C)c1
2CCN(C(=O)
c(C)
c4cccc
C1CN(C(=O)
c2ccc(C)
c3cccc
c1(C)cc
)cc(C(=O)N
CCN(C(=O)
)c2)cc1
)cc2)CC1
cn2)cc
c2)
(-
cc1-
N#
#N
)CCN
CCS
c1cccc(F)c1
c2c(C)cc
c(S
CC)c1
n1c(N
c(C(=O)NC
c2cccc(F)
c(C)cc
N1(c2cc
c3cccc(F)c3
)n2)
CCOC
[C@@H]1CO
(CO)
COCC
c2cccc(F)c2
CC)
C1OCC
[C@H]1CO
c1ccc(F)cc1
c1c(C)cc
c1c(F)cccc1
[C@H]1C
c1cc(F)cc
(CNC(=O)
[C@H](CO)
CC1(C)
[C@@]2
[C@]1
[C@@]
#
CC1)
[C@]
(Cl)ccc2
[C@@](C)
#CC
3CC3)
[C@@]1
C(F)(F)F)cc1
CC1CC1
)cc(
C(F)(F)F)c1
)C(F)(F)F
[C@]2
[C@@]2(C)
c1ccc(C(C)(C)C)cc1
c1cc(C(C)(C)C
)ccc1C
)c1C
c(N)cc1
C(#N)c1
C(=O)c1ccccc1
)c(C#N)c1
)c(C#N
)c(N
c1(C#N
c1ccccc1)N
C#N)cc1
#N)
c2ccc3c(c2
S(=O)(=O)C
c2ccc(F)cc2)
nn3
)C(C
=C(C)
Fc1ccc(C
c3ccc(C
C(C#N)
NC(C)
)ccc1F
c2cc(C
=C3
)ccc2n1
c(F)cc1
c2ccc(C3
C1C(C
(C(=O)OC(C)(C)C
c1c(C2
c1cc(F)cc(F)c1
c1cc2ccccc2
)C(=O)N
)NC(=O)C
(F)cc
c2cc3cccc
[nH]c(C
3cccc
)S
)C(=O)N2
c1c(F)cc(F)cc1
c3cc(F)cc
(F)c3
[C@@H]3
[nH]c2c1
C1(=O)N
(c2ccccc2)
NC(=O)C
c2cc(F)cc
(F)
c2cc(F)cc(F)c2
c2ccccc2)cc
c1ccc(OC)cc1
(C)C)n
C(=O)NCC
c(C(=O)NCC
(-c3cc
c(OC)cc3
c1cc(-n2
c1ccc(-n2
c(OC)cc2)
c3c(N
4CCOCC4)n
c12)
OC3
c2ncnc(N
(CCN
c4c(
2CCOCC2)
c3nc(N
CC(C)(C)OC
5CCOCC
5)n
cnc4
c3c2
CC1(C)C
CN1CCOCC1
3)C
c2C
2)C
CN(C)
OC1(C)C
c3ncc
nc1-
nc(-c3cc
C#
)ncc1
C1(O)
(Cl)c(N
c4c(F)cc
cc4
c3ccc4c(c3
)ncc2
)c(F)cc
)n3
c3c(F)cccc3
CO2
c2c(F)cccc2
2CC3
)C2)
)CN(
C(=O)N1CC
2CC2)cc
N1CC2
c1cccc(C(F)(F)F)c1
)C1CC1
CN(
c1no
2CCC(N
c3cc(-c4cc
no
C1CN(c2n
)no
CCN(c2n
3)o
c(C#N)cc3
F)cc1
)cc(F)
BrC
c1ccc(C(=O)O)cc1
C(Br)c1cc
c(C(=O)O)cc1
c1(CBr)cc
c1cc(CBr
)c(F)cc1
c1(C(=O)O)cc
c1c(C(=O)O)cc
CBr
c1cc(C(=O)O)ccc1
CC(=O)O
CC(=O)O)
O)c1
c2)CC1
C(C(=O)O)
(CC(=O)O)
CCC3
(CC2)
(c2ccc(OC)cc2)
(CC1
)OCCO2
c(OC)cc1
c1cc(OC)ccc1
C1=
C1=C(
c2ccc(OC)cc2)
OCCO2
c3ccc(OC)cc3
O1CC
)N(C
2C(=O)N
)C(=O)N1
C1CCN(C(=O)OC(C)(C)C)CC1
N(C)C(=O)
c1cccc(
N1(C(=O)OC(C)(C)C)CC
c2ccc(Br)cc2
)CCCC1
(O)CN
c1([N+](=O)[O-]
)cc(Br
NCC1
(Cl)(Cl)Cl
C(Cl)
(Cl)Cl
C=C
(Cl)C
(C(=O)NCC
c1(OCC
c2cc(OCC
n(C)c1
OCC[Si](C)(C)C
(C)cc
n(C)
c3)
c(C)nc2
c1cn(C
nc(C)
c3)n
[Si](C)(C)
c(C)n
[Si](C)(C)C
n(C)c3
)n1cc
)OC
c1(C(=O)NC
c1n(C
n1c(C)
I
CCOCC1
[C@H](C)C
[C@H](C)C1
[C@H](C)
[C@@H](C)N
)CCOCC1
)CCO1
CCC(
(I)c1
c1ccc(I
2CCOCC
c1cnc(N
c(I)c1
c1ccnc(N
c1(I)cc
cnc1N
c(C(=O)OC
c5ccccc5
n3-
c3cccnc3
c2ccc(-c3n
)-
c(-c2ccc(C
)CCC3
c1ccccc1N
)CCC2
n2-
c2cccnc2
c2ccccc2-
3)ccc1
c3n(
)c(-c3cc
c(C4
-c1ccccc1
c1ccccc1-
c3c(c1
3)c1
CCCC2
C1CC(=O)
C(CC(=O)O)
c2cccc(-
c1ccc(C(F)(F)F)
c(C(N)=O)
c1cccc(-
[nH]2)c1
c1ccc(-c2cn
c1cc(-c2cn
c1(-c2ccccc2
C(F)(F)F)cc
cc(-
(N)=O)
ccc1-
)c(C(F)(F)F)c1
)c1ncc
c1ccc(-c2ccccc2
-c1cn
n1cc(-
C(N)=O
)(=O)
2)cccc1
2CCC3
c2ccccn2)
c3ccccn3
c2cc(C(F)(F)F)cc
c3ccc(C(F)(F)F)cc
[C@@H](C)C
)C(
cc(C(F)(F)F)cc
[C@@H](C)C1
c1cc(C(F)(F)F)
nn1
CCBr
C(CBr
C(Br)C
n1nc(C
)nc(C
c1(C(=O)OC
c1c(C(F)(F)F)
c(C(F)(F)F)cc
CC(N
c1ccc(F)cc1)
c1cccc(N)c1
c1ccc(F)c(F)c1
c1c(N)cccc1
c1(C(N
c2ccc(F)
c2ccc(F)cc2)cc
cc(N
c1cc(C(N
c2cccc(N
c(C(N
c1(N)cc
cc(C(N
c2ccc(F)cc2)c1
c1cc(F)ccc1
c(C(C)
NC(
c1ccc(C(N
c2ccc(F)cc2)cc1
)c2)cc
c1cc(F)c(F)cc1
(C(C)
c1ccc(Br)
O=S(=O)(N
)s1
)sc1
c2ccc(Br
)s2)
)nc1Cl
(Cl)n
CCC(=O)
CCN(CC)CC
)c(OCC
)CO
N(CC)CC
c2ccc(O
c3ccc(F)cc
c3ccc(F)cc3
c(NC(=O)
c2ccc(F)cc
c(Oc2cc
C(=S)N
=S)N
C(=S
(NCC
S=C(N
(c1ccccc1
N(C(C)=O)
C(=O)CC
NC(=O)CC
C(CO)
(N)
(N)C
)C1CCCCC1
c2cccc(C
)CCCCC1
C1CCCCC1
C)cc
)cc(C)c1
c(C)cc1
c(=O)c(C(=O)O)cn
)c(F)cc2
c1c(F)
c1c(=O)
c(C(=O)O)cn
c1nc2c(
c2nc3c(
c1c(C(=O)O)
c2cc(F)
c(N3CC
c(F)cc2
)cc(C(=O)O)
c2c(cc1
C(NCC
CNCC
c2ccc(-c3cc
c6cccc
)o
4CCN(C)CC
c-2
c1(F)
5CCN
c5cccc
n2)ccc1
CCN(C)CC1
N1CCN(C)CC1
4)cc
-3
c1cccc(-c2n
3CCN(C)CC
oc(C
2CCN(C)CC
c1c2n
c1cs
c(I
cs1
c1(I
s1cc
(C(=O)OCC)
cs
)cs
c2c(cccc2
OC(=O)C(C)(C)C
C1=O)
c2cccc3c2
[C@@H]1N
[C@H]1N
(-c3ccccc3
ON
c2c1cccc2
(c2ccccc2)(c2ccccc2
(c2ccccc2)(c2ccccc2)
c1(-c2cn
[nH]c2
[C@H](OC(=O)
[C@@H](CO)
nc3
o2)cc1
[C@H]3C
O[C@@H]1
O[C@H]1
oc(-c3cc
=O)C
nc12
)cc2cc
c1(-c2ccc(C
c3ccc(O)cc3
)cn2
(C)C)cc
c(-c2cn
c2ncc(-c3cc
(C)C)cc3
c1cc2ncc
n1cc(-c2cc
(O)cc
c1(C(=O)O)
c(C(=O)O)
c1c(C)
s2
c2c(C)
sc2c1
[C@@H](N)C
[C@H](C(=O)OC
[C@H](N)
c1ccc(OC)cc1)
c2ccc(OC)cc2
CCCO
[nH]c(=O)
)c(=O)[nH]
OCCC
[nH]c1=O
C(CC)
O=c1[nH]
c3cc(C
c(F)c3
OC)CC1
c(F)cc3
c(F)c2
c(CCC
c(C(=O)O)cc2
c1cc(F)ccc1-
c(C(=O)O)cc
c(C(=O)O)cc3
N2CCC(N
)c(F)
c1ccc(F)cc1F
c2ccc(F)cc2
F)c1
C1(c2cc
3CCC(N
F)CC1
cc2c(
)CCN(C
)C2=O
c1(CCC
CCN1C
2CC2)c1
c1cc2c(
c3cc(Cl)ccc3
)n2)cc1
c(C)c2
)n2)ccc1
n(-c3cc
c(C)c(C)
(Cl)ccc1
)n2)cc
c(C)c1C
CC(C
)cc2c(cc1
c1c2c(cc
)c(OC)cc2
c1cn2
c(C(=O)OCC)cn
3)C1
c12cc(C
c3ccccc3)cc2
c(F)c(F)
c3cc(OC
C(c1ccccc1
c1ccc(Cn2
c3ccc(OC
c(C(C)C
c(F)c1F
c2ccc(F)c(F)c2
c1cccs1
c1ccsc1
cccc1
nn[nH]
c1ccc([N+](=O)[O-]
[nH]2)
c(O)
c(O)c1
c2cccc([N+](=O)[O-]
n1nn
c3c(OC
)cccc3
Oc2ccc(C
)cccc4
c2ccc(C(C)C
)CCCC2
)c1ccc(C
(C)C)ccc1
C1CCC
c2ccccc2)ccccc1
)cc2)cc
C(C(=O)
)=O)cc1
C(N)C
C(N)=O)
)=O)cc
c(CCN
(C(N)=O)
=N
c1C#N
c1ccc(C#N
#N)C
(C)=O
c(C#N)c1
(C)=O)cc1
(C)O)
c2cc(-
(c3ccccc3)c3ccccc3
nc2-
c1ccc2c(c1)CC
c(CC)n
[C@H]3CC
[C@H]2CC
c3cc(-
c4nn
c2nc(C
C)n
O)cc2
c2ccc(-c3ccccc3
c(-c2ccccc2
c1nc(OC
c(Cl
c1cc(C(=O)O)
ccc1C
CC=C
(C(=O)O)cc
c1cc(CO
(F)ccc1
c1Cl
cnc2c1
N1CCC
[C@@H]21
c4[nH]
[C@@H]4
[C@@H]12
cnc12
c1c(F)cc
c2c(F)cc
F)cc
c1c(C=O)cc
c1(C=O)cc
c1ccc(-c2ccccc2)cc1
(C)=O)cc
c1cc(-c2ccccc2
cc2)cc1
CS
c(-c4ccccc4
c3cc2
Cl)cc1
O)ccc1
c(-c3ccccc3
[nH]c12
Sc1n
O)cc2)
C(S
C[C@@H]1
CN2
c3c(cc
4CCNCC
[C@@H](C)O
[C@@H](C)
[C@H](C)O
NC(=O)C2
c3cc4
c3c(F)
cc3c(
N1CCNCC1
C(=O)C2
2)C1=O
c2cc3c(
c2c(F)
c2cc3
N2C
C2=O
O=S(=O)(
c3ccc(C)cc3
c(Cl)nc1
c(Cl)n
c1(Cl)n
c(C(F)(F)F)
Clc1n
c(Cl)s
c1(C(F)(F)F)
n2ccnc2
)c[nH]
C(F)(F)
nc4
(F)F
(F)(F)
c1(-n2
n(-
C1(F)
n1ccnc1
=C(OC
3CCN(C
)CC3)
C(C1
N1CCC2(CC1
[C@@H](F)
C2)c1
(C)c2
[C@H](F)
n1c(Cl)cc
c([N+](=O)[O-]
c1c(Cl)n
)c(C)cc
(F)F)cc
S(C)(=O)=O)cc1
(F)F)
S(C)(=O)=O)cc
c2ccc(S(C)(=O)=O)
cc2)
FC(F)
O=C1CC
c(OC)c3
c(S(C)(=O)=O)
c2cccc(-c3cc
)c21
CN(C(=O)OC(C)(C)C)CC
c3c(C)cc
CCN1C(=O)OC(C)(C)C
(Br)c3
c2c(Br)cc
N(C)CC
CC(C)(C)OC(=O)N1CC
(Br)c2
)cc2c(
CC3)n
)cn2)CC1
3c(
c4ncc
4)CC2)
c(C3
)cc1C
)c(CN
OC)CC
N)
c(N)n1
c1ccccc1OC
c3c(C
c1cccc(OC)c1
nn1-
n1(-
c2ccccc2)n
(c2n
c1ccc(Oc2cc
=O)cc2)
NC(C)=O
)ccc1[N+](=O)[O-]
c(NC(C)=O)
(C)N
Oc1ccc(N
[C@](C)
(c3cc
[C@@]3
=C(N
c4ccc(OC)cc4
CO1
(c1ccccc1)
(NC(
N1CCCC
)CN(C
C(CC)C
C1C(N
C)CC
2)c1C
C)C
(CCCC)CCCC
OB(O)
c2cc(O
B(O)
CCN(C(=O)OC(C)(C)C)CC1
(=O)OCC
2CCN(C(=O)OC(C)(C)C)CC
B2
B1
C(=O)OCC)
c12c(cc
cnc1C
c(OC)cc2
/C(=C\
C)c2
c3ccc(F)
)\
c1nc(C)
c1c(OC)cc
n3C
c(C)cc3
c(C)n2
c(cc
O[Si](C)(C)C(C)(C)C
(C(=O)OC(C)(C)C)C1
C[Si](C)
C(=O)OC(C)(C)C)c1
CN1C(=O)OC(C)(C)C
[Si](C)(C)C(C)(C)C
(CO
ccccc2
3CCOCC
(C#N)
C1COCCN1
N1CCN(C(=O)
N1CCOCC1
c34
c3ncn
c1ccc2n
)c(C)
c(Nc3cc
c2ccc(Oc3cc
)ncn2
)OCO2
OCO2
=C(C)C
c(C=C
c1ccc(C(=O)OC
c2co
c2ccc(CC
CC(=O)OC(C)(C)C
c1ccc(CC
c1ccc2cc
(F)c2
(F)cc1
sc2
c2cccc(OCC
)cc(-c2cc
C(=O)OCC)c1
sc3
c1cccc(OCC
[C@@H]1CN
2CCCCC2)
3CCCCC3
c([N+](=O)[O-])cc3
c2ccccc2)C
c1cc([N+](=O)[O-])ccc1
C1CCC(
[C@@H]2CCN
c3ccccc3)C
(=O)N
c2ccc([N+](=O)[O-])cc2)
[C@@H](OC
=[N+]=[N-])
[C@@H]1O
[C@@H](O
[C@H](O
[N+](=[N-]
)[C@H]1
)C=C
=[N+]=[N-]
[N-]
=[N+]
)c([N+](=O)[O-])c1
(C)c3
c1-c1ccccc1
c2cccc(C)
c3ccccc3)ccc2
NCCO
oc2
OCCN
N)cc1
OC(
SC(=O)N
c1ccc(-c2ccc(C
)N(C)C(=O)
N1CCN(
[C@@H](c3cc
c1cc(C)cc
[C@H](c2cc
C)CC1
[C@@H]3CC
)nc1-
c1cccc(C#N)c1
c2cccc(C#N
)sc2
#N)c1
sc(N
)N1
(C#C
c1(S(=O)(=O)
[C@H](CC
[C@H](C)CC
[C@H](NC(=O)OC(C)(C)C
[C@@H](CC
(OC(=O)
[C@@H](OC(=O)
c(CO)
C(=O)OC)c1
C(=O)OC)cc1
(C(=O)OC)
CO)
c1cc(O)
oc(=O)
c1cccc(O)c1
(O)c1
c2c(O)
c3cc(C)cc
c2cccc(O)
c3ccc(N)cc3
)c(C)c1
c1cc(N)ccc1
)N1CC
(c2ccc(Cl)cc2)
(c3ccc(Cl)cc3
2CC3CC
c1ccc(S
c1cc(S
(S
c1c(S
3)c12
c2cc1OC
c1ccc(Cl)c(C
(OC)c(OC
)sc2c1
c3cc(OC)c(OC
3)s
c4)cc3
c2cc(OC)c(OC)cc2
c2cc(OC)c(OC
)cc(C(F)(F)F)c1
4)cn
5CC
c3cc(C(F)(F)F)cc
(C(F)(F)F)c3
c2cc(C(F)(F)F)cc(C(F)(F)F)c2
(NC(=O)C
n2c(=O)
c1ccc(N)cc1
c1c(C)n
c1n(-
c3cccc(N
)c2n1
c1(C=O)
c2ccncc2
c1C=O
cc(C=O)
c(C=O)
C=O
c1ccc(Cl)cc1)
C(=O)CC1
Clc1ccc(C
CCC1=O
[C@@H]4CC
3CCOCC3
c4cccnc4
cc(CN
[C@H]12
(Cl)cc
(Cl)c3
OCC2
)c(OC)c3
c2ccc([N+](=O)[O-])cc2
c3cc(Cl
n(CCN
c2c(C(=O)N
c12c(cccc1
NCC2
c2cc(O)ccc2
CCCN1
CN(C)CC
2C(=O)
=S
3)C2
c(C(=O)OC(C)(C)C
c1ccc(C(=O)
c4ccc(F)cc
c2ccn
c3ccccc2
C1(O
CCN1CC
)ccn2
)cc(C)
2CC(=O)
(CCO
c2ccccc2F)
)c(Br
c1(Br
(C)n1
nc(OC
(C)n
c1ccc(Cl
c(Cl)cn1
S(=O)(=O)CC
c1ccc(Cl)cc1Cl
(C)(C)C)cc1
(C)(C)C)
(CCOC
c(Cl)cc1Cl
sc(C
CC(C)(C)C
c(C(=O)OC)c1
COc1cc
CCC2)
C(COC
c(C)o
(C)CCC
C1CCC1
OC)n
5)cc4
4)c2
c(-c3cn
C#CC
c(Cl)c3
)n2)c1
)CC(=O)
(C)(C)O
CC(C)O
(-c2n
OC(C)C
c1c(-c2n
4)C
3CC4CC
5)C
C1C2CC3
4)C3
)CC(C
C12CC3CC
3)C2)
c1c(-c2ccccc2
c1cc(I
c2ccc(I
(I
c1ccc(I)cc1
c1c(I
)c2)n1
(N1
c2ccccc2C1
OC1=O
(C(=O)OC(C)(C)C)C
)C2)cc1
(C(=O)OC)c1
c(-c3n
C(C)CC
2CCCCC2
)c(C(F)(F)F)
)ccc(OCC
N1CCCCC1
CN(CCC
c1nc2ccccc2
C1N(C
(C)C)C
N(CCC
c2nc3ccccc3
)N(CCC
(C)C)C1
Cl)n
c(C(=O)OC)cc3
c1ccc(C(=O)OC)cc1
c2ccccc12)
)CCCC
c3c4c(
nc2c1
Cl)CC1
c(C(=O)O)c1
c1ccc(C(=O)O)
(C(=O)O)c1
(CC=C
C(=C)C
C=O)
[C@@H](C)CC
(C=O)
c1cc(C=O)
c(-c3ccccc3)
c(-c2ccccc2)
c(O)c2
c1nc(-
oc1-
Nc1ccc(C
CN(CC
c(F)cc3)
[C@H](N)C
2)ccc1F
)(C
cc2C
OC(C)(C)
oc1C
[C@@H](C(=O)OC
(CCCN
[Si]
NC(C)=O)
c3cc(F)
(F)c(N
S(C)(=O)=O)c1
)cc(O
oc2c1
c4cc(OC
o2)
(OCC)
(OCC)OCC
N=C
C(=N
/C(
[nH]cc2
Nc1ccccc1
c4ccc(OC
)cc4)cc3
3)cn
)ncn1
c3cc(OCC
OCCOC
c1c(CC
c1cn(C)
c1c(Oc2cc
c2)n1
C(O)(C
c2ccc(F)cc2)CC1
NC2
c3cc(OC)ccc3
c2cc(OC)ccc2
C1NCC
c2c(n1
[C@H]4
(=C)C
CC(
cs2)
cc1C
c3ccccc3)n
c2ccccc2)n1
4CCN(C
2)nc1
Nc1ncc
c2cs
c2nc(-c3cc
C1(C)(C)C
CC1(C)O
B(c2cc
B2OC(C)(C)C(C)(C)O2)cc1
[C@H](CN
N1CCCC1
B3OC(C)(C)C(C)(C)O
B2OC(C)(C)C(C)(C)O
B1OC(C)(C)C(C)(C)O1
OC(C)(C)C(C)(C)O1
C1CCCN1
2)C3
Br)C
)C(N
C(C)(C)C)
O[C@H](C
c1cc(=O)
c3c(F)cc
c3cccc(Cl)c3
)cc(=O)
c2[nH]c(=O)
(F)cc2
(=N
c1ccccc1)c1ccccc1
c1cccc(C(=O)
2c(
CCO2
n2CC
cccc2C
N2C(=O)
C(O)CC
C(CCO)
S(C)
S(=O)
C(c1n
)c(F)c2
c(N)c2
c(=O)cc
)c(F)c3
)c1F
CCOCC
#N)cc1
(CC(C)C)
ccn1
N(C(=O)OC(C)(C)C)
c1cc(C=O)ccc1
(C(=O)OC(C)(C)C)CC2)
nc(C(F)(F)F)
(-c4cc
c1cc(S(=O)(=O)
2CCCN
c(=O)[nH]
c3ccncc3
scc
c1sccc1
c(S(=O)(=O)
c2sccc2
(c3ccccc3)
C(Br
N(C(
C(C(=O)N
CCCC(=O)
CC(C)(C)O
CCC2(C)C
(C)(C)O)
n2c(
c(Cl)c4
[Sn](CCCC)
(CCCC)
[Sn](CCCC)(CCCC)CCCC
c1([Sn](CCCC)(CCCC)CCCC
)cnc1
c2cccc(OC
c3cccc(OC)c3
C1C(
c2ccc(C)cc2
C(=O)O)cc1
C(=O)O)cc
c4cc(F)cc
N1C(=O)OC(C)(C)C
2CCC2)
(=N)N
)n2C
c2ccc(C(=O)
C(=N)N
)n(C)
C(=O)N2C
c2c(C)n
#C[Si](C)(C)C
c2scc
n2c1
c2cccc(C)c2
3C(=O)
c2nc(C)
c2no
c(=O)[nH]1
(CCO)
CCO)
CCCO)
)cn3
)cnc12
NC(=N
OC)C
)C(=O)C
(C(=O)OC)C
c2c(-c3ccccc3
CCCCCC
CC2)cc
C1CCNCC1
CC3)
c(OC)n
[nH]c3
c4cc5
n(CCC
)c(=O)n(C
(c2ccc(F)cc2)
[C@H](C)N
C(=O)N(
2CCCC2)cc1
c3ccc(-c4cc
c1c(C)cccc1
c(Oc3cc
c(C)n1
c(-c5
)c1cn
[C@@H](O)C
c2cc3c(cc2
n[nH]
c1n[nH]
c3cc4c(cc3
c3ncnc(N
c2c(=O)
c12n
(C(=O)OCC)CC
)CCCN
CCCCCCCCCCCC
[C@@H]2O
[C@H](CO)[C@@H](O)
CCCCCCCCCCCCCCCC
C(CCCCCCCCC
CCCCCCCCCC
C(CCCC
)CCCCCC
N(C1
c2ccc(=O)
CC2)cc1
)COC
C(=O)N(C)
N(C)C1
c2cnc(N
C1CN(C)
(C)CC1
n1cc(C
(Cl)cc2
c(C)n3
/C=C/
OCCCC
C(\
(=O)OC(C)(C)C
C1O
(=O)OC
CN3
c3cc(C)
)CCCCC
c(-c2ccc(F)cc2)
c(-c5cc
C1CNCCN1
cc(OC
c3ccccc32)cc1
2=O
nn2
CC(=O)OC)
c(C(O)
C(O)(
c2cc(Cl)cc
)c(CC
c(C)nc1
c2c(OCC
c3c(C)
)c2C
c(Br)cn
c1(CO)
c1(Br)cn
n1cc(Br
O=S
c(S(=O)
CC#N
N#CC
5)c4
OCCO1
s2)cc1
(=O)=O)
(=O)=O
S1(=O)
(-c3cn
S(=O)(
=NC
c2c(cc
c2cnccc2
c(Cl)ccc1
c(N)
c3cc(OC)c(OC)cc3
O=C(C1
N(C(=O)C
[C@@H](CN
(C(=O)OC(C)(C)C)C2
O)C
n3c(
n3cn
)nn1
c1ccc(/C=C/
c(/C=C/
c1(/C=C/
(/C=C/
c(CCCC
c3ccccc3c2
c3)c2
ncc(C
)c2c(
c1ncc(C
=O)c2
c2ccc(C(F)(F)F)cc2)
sc1-
nc(C)c2
c(C)no
(C(=O)OCC)CC1
c2cc(Br)ccc2
c3cc(Br
)CC2)CC1
c(OC(F)(F)F)cc
[C@H]4CC
n5
c1ccc(OC(F)(F)F)cc1
c2ccc(OC(F)(F)F)cc
2CCN(c3n
CCN(C)C
(C)C)c(C
)cc1OC
c1cc(C#C
c1ccc(C#C
c2ccc(C(F)(F)F)cc
)NC
(C(=O)OCC)c1
(CC#N
)n(-
2CN
C1C(=O)N
)cc2)ccc1
c(C#N)cn
c3c(n2)
c2cc(Br
c1c(Br
c1ccc(O)
c(C=O)cc1
C(C)(
oc2C
n1cc(N
3CCN(C(=O)
=CCCC
CNC(=O)OC(C)(C)C
c1ccc(C(C)C)cc1
4CCCCC
3cc
c2cccc(OC)c2
c1cc(OC)c(OC
c1c(OC)cccc1
)OC1(C)C
C(=C/
C(=O)O)c1
C(NC(=O)OC(C)(C)C
2CCNCC2)cc1
2CCNCC2)cc
3CCNCC3
CC2)ccc1
c2c3ccccc3
n2cnc3
[C@H](OC(C)=O)
[C@@H](OC(C)=O)
(C)OC
c2c(Cl)n
cc(C(F)(F)F)c1
c2cccc(C(F)(F)F)c2
)c(I
(c2ccc(N
Nc1ccc(N
c3cccc(C(F)(F)F)c3
c(-c4cn
)cc(C#N
)c(C(N)=O)
c1nc(Cl)n
nc(Cl)n
n1c(Cl)n
c(Cl)nc2
c2nc(Cl)n
C(O)CC1
c(Br)cc3
c1c-2
c3ccc(Br)cc3
c2ccc(Br)cc2)
CN(C(=O)OC(C)(C)C)C
c2ccccc2C1=O
[Si](C)
(Br)cc1
NC1CC1
c3cc(F)ccc3
c2cc(F)ccc2
c12[nH]
2CCN(CCC
c(Cl)cc2)
c(C)c(N
c1c(N)cc
c(C)c3
)nc1C
)c(Cl)c2
(CC(C
3)C1)C2
c2ccc(O)
c2ccc(-c3
=N1
(C=C
c1c2ccccc2
[C@H](C(=O)O)
)nc1N
[C@@H](C(=O)O)
)cc(OCC
c(-c2ccccc2)c1
(C(=O)OCC)C
B2OC(C)(C)C(C)(C)O2)
c1(B2OC(C)(C)C(C)(C)O
2)cn
(C)(C)O1
B(
1(C)C
(C)(C)OB(
[SiH]
(OC(C)(C)C
C(=O)(O)C
P
C(=O)C(C)C
c2c(C)cc(C)
c(C)cc(C)
c1c(C)cc(C)
)ccc(F)c1
c1cccc(Br)c1
c2ccc(C(F)(F)F)
=CC(=O)
[C@]4
[C@@]4
[C@]3
[C@]2(C)
=CC1
c3ccccc3C2
c1cc(Cl)n
NC1=O
3CCOCC3)
3CCOCC3)n
(C)nc2
[N+]
NCc1ccccc1
C(Cl)CC
C(Cl
c2c3c(cc
C(O)C1
)ccc(Cl)c1
2CCOCC2)cc1
(N)CC
c(OCCN
c(SC)n
C(C=C
CCl
(N(C
/C(C)
=C(/
=C(\
C(Br)
2CCN(C)CC2)
N1(C)
=NN
NN
c1ccc(Br
(C)C)CC1
CC(C)(
cc1Br
(S(C)(=O)=O)
SC1
c(NC(=O)C
nccc1
2CC2)cc1
S(=O)(N
O=S(N
C1(=O)CC
(Cl)cc3
(N)c1
c1cccc(S(=O)(=O)
c2c(C#N
)cc(Br)c1
2CCNCC
c2ncc(Br
)cn2)cc1
c(C=O)c1
)c3cc
c2ccc(C)cc2)
(-c3n
C(=O)OC(C)(C)C)cc1
CCN(C)C1
c(N)cc3
c4)n
c3cccc(OC
)c(Cl)n
Nc1cn
)=O)C(C)(C)C
[C@H](OCC
CNC
c2c([N+](=O)[O-]
N=C(
c(O)cc
c(NC(
3)n2)
C(C(N
(=O)=O)c1
S1(=O)=O
7
c2cc3cc
c(Cl)c(Cl)c3
c2ccc(Cl)c(Cl)c2
[n+]([O-]
[n+]
c1c(OC)c(OC
(C(C
CC(O
[C@@H](NC(=O)OC(C)(C)C
CCCCO
c(OCCCC
(C(C)(C)C
)OCCO
)ncc3
(=O)C
(C(=O)OC)CC
c1(Cl)ncc
=C=S
C(=S)=N
c1c(Cl)cccc1Cl
)CC3)n
cn2)c1
(C2
c(-c3ccc(Cl)cc3
c1(Cl)cc(C
)c(N)c1
)c(O)cc1
/C=C(\
ccc1OC
OCO
NC(C
c2cc(Cl)
CC(OC
Cl)C1
)cnc3
)=O)ccc2
4c(
cn(C
c1ccccc1Cl
nccc2
c1ccc(Cl)nc1
(F)ccc2
C(=O)C(C)(C)
CC(C)(OC
)=C
)c(C)c2
c2c(Cl)cccc2
OC(C)
)(C)C
3CCNCC3)n
=CCN
c4c(cc
B
c1(B2OC(C)(C)C(C)(C)O2)cc
)cc(O)
=C(O)
c1c(O)
c2ccc(C(C)(C)C
[nH]n1
C(C)(C
c(-c2ccc(Cl)cc2)
nc1Cl
3CC3)c2
c3c(=O)
8
c5c(
(C)c(=O)
nc(Cl)c1
(CC)(CC)
C(F)F
c(C(=O)C
c(OC(C)C
)c2)C1
(Br)n1
C(Br)CC
)NC(=O)C2
NCCC
C1N(
cc(C(C)(C)C
(C(
Cl)CC
c(=O)n(C)
)C(=O)N(
)OCO
cc(C(F)(F)F)
c2cc(O)
c1ccc(CBr)cc1
c1c(C=O)
)C(=O)N(C
N1C(=O)c2ccccc2C1=O
(OC)OC
(N(C)C
(c1ccccc1)(c1ccccc1)c1ccccc1
c2ccccc2)cccc1
c(F)cc3)n
[C@H](OC
B2OC(C)(C)C(C)(C)O2)c1
c1n(C)
CCC(=O)N
)cc1)C
[C@H](O)C
)c(C)n
CCCCl
(OC)C
c2c(cccc
c1ccc(C=O)cc1
c1cccc(C=O)c1
OC(C)(C)O
(Br)
[C@@H](CC(C)C)
c(Br)c2
c(Br)c3
c(c1
c1c(cc
)=O)C
C3CCCCC3
C2CCCCC2)
c2ncc(C
[Se]
CCN(C(=O)OC(C)(C)C)C1
(C(F)(F)F)c2
c(OC)cc
CNC1
)c(C(N
NCCN
(N1CC
c(Cl)ccc2
(Cl)n1
[nH]1cc
c(NC(=O)OC(C)(C)C
(OCCO
C(C(C)(C)C
CCCBr
)cc2c(c1
c2c(Cl)cc
c(Cl)n1
N(C)OC
c1ccccc1)CC
c3c(Cl)cc
Cl)ccc1
c2c(C(F)(F)F)cc
OC(N
(C(C)C)
(C)(C
S(N)(=O)=O)
S(N
)(=O)=O
c2cccc(Br)c2
=O)cccc1
/C=C\
NC(C)(C)C
(=O)=O)cc1
4c(cc3
(=O)=O)cc
c2n(C
)=O
c3c(cn
n(COCC[Si](C)(C)C
n2c3c(
[Si](C(C)C)
[Si](C(C)C)(C(C)C)C(C)C
c2cc(C#N
(C(C)C)C(C)C
)(=O)N
)=O)c1
C(C(F)(F)F)
C(F)F)
c2c(F)cccc2F)
(O)C1
(CCCCC
(C(N
c3c(Cl)cccc3
O=S(
CC1)C
)NC(
c3c(cccc3
=CCC
C(OC(C)(C)C
/C(=N
n2nn
FC(F)(
=C(Cl)
CCNC1
c3cnccc3
c1c(C(N
)=O)cccc1
(O)cc1
NC3
[S@@]
[S@]
C(Br)c1ccccc1
[C@@H](N)CC
[N@+]
[N@@+]
(CBr
OC(C)(C)C(C)(C)O
C(Cl)C
)F
(S(=O)
c2ccc(C(N
)=O)cc2)
(Br)C(=O)
N1CCC2
[SiH2]
[C@H](C(N
[C@@H](C(N
S(=O)(=O)C(F)(F)F)cc
S(=O)(=O)C(F)(F)F)
CC(OC(=O)
C(N)=N
/C(=C
C/C=C\
B(O)O)cc
B(O)O)
c1c(B(O)O)cc
c1cc(B(O)O)
c1(B(O)O)cc
[se]
[PH4]
C(F)(
C(N)=S
c1ccc(B(O)O)cc1
B(O)O)cc1
c1cc(B(O)O)ccc1
B(O)O
C(=O)(Cl)
O=C(Cl)
(=O)Cl
C(C(
)c2c(cc
C(=O)(OC(=O)
B3
c2n(C)
[P+]
=C=O)
)=O)CC
c1cccc(B(O)O)c1
B(O)O)c1
FC(
S(=O)(=O)Cl
S(=O)(=O)(Cl)
[C@@H](NC(
[PH2]
CC(C)(OC(=O)
c1c(cccc1
[Sn]
COC(
)Cl
c1(B(O)O)cccc
(N1C
)C)
OB(
C(=O)(Cl
C(=O)Cl
[NH3+]
NO
N1C(=O)CCC1=O
C(I
cccc2)
S(=O)(=O)(Cl
CI
IC
c2c3c(ccc2
c1(B(O)O)ccccc1
)(=O)OCC
c1(B(O)O)
[C-]
[N+](
[SH]
O(C(
CNC(
OC(=O)OC(C)(C)C
[NH2+]
(C(C)(C)C)C
[P+](c1ccccc1)(c1ccccc1)c1ccccc1
[N+]([O-]
)[O-]
[Si](C(C)(C)C
BrC(Br)
[PH]
O(C(C)(C)C
)CBr
C(=O)(Cl)OCC
C(N1
(Br)Br
[O-][N+](
OOC(=O)
c3c(cccc
C(=O)=N
[s+]
p
[S+]
9
%10
[SiH3]
.
[O-]C
S(C)(=O)(=O)Cl
C(=O)=NC
CC(=O)Cl
C(C)(=O)Cl
C(=O)(OC(=O)OC(C)(C)C)OC(C)(C)C
OC(C)(C)C)OC(C)(C)C
S(=O)(=O)(Cl)c1ccc(C)cc1
BrN1C(=O)CCC1=O
C(=O)(Cl)C
C(C)(=O)OC(C)=O
C(=O)(Cl)c1ccccc1
[Mg+]
OOC(=O)c1cccc(Cl)c1
[SnH]
[N-]=[N+]=[N-]
=[N-]
[C-]#N
[Cu]
C(C)I
OO
[NH4+]
C(=O)(Cl)CC
[Zn+]
[S-]
BrC(Br)(Br)Br
C[Mg+]
)=O)ccc1
[Zn]
O=S(Cl)
[Mg]
[n-]
<unk>
<sos>
<eos>
<mask>
<sum_pred>
<sum_react>
<0>
<1>
<2>
<3>
<pad>
