COC(=O)
[C@H](C
CCCN
)NC(=O)N
c1cc(OC
)cc(C(C)(C)C)c1O
C(N
)CCC
[C@H](N
C(=O)N
)cc(C(C)(C)C)c1
O)
C(=O)OC
[C@@H](CCCCN
)(N
NCCCC
c1(O)
c(NC(=O)N
)C(=O)OC
)cc(OC)cc1
C(C)(C)C
C(=O)(N
N[C@@H](C
N(C(=O)N
)C(=O)OC)
c1c(OC)cc(N
C(=O)N[C@@H](C
)c(O)c1
COc1cc(N
)c(O)c(C(C)(C)C)c1
CC(C)(C)
)cc(N
)c1O
O(C)c1cc(N
c1(N
)cc(OC
O(C)C(=O)
O
c1c(N
c1c(OC
)cc(C(C)(C)C
NC(=O)N
C(CN
)CC
c1(C(C)(C)C
C(C)(C)(C)
O=C(N
c1cccc2
cnccc1
2)
c1cc([N+](=O)[O-])c(S
c2c(Cl)cncc2
Cl)s1
[O-][N+](=O)
c1cc(C(=O)N
c2cccc3cnccc2
3)
sc1
S
c1c(Cl)cncc1Cl
O=[N+]([O-])c1cc
(C(=O)N
c1(NC(=O)
c2cc([N+](=O)[O-]
)c(S
c3c(Cl)cncc3
Cl)
s2)cc
cc2
cnccc12
n1cc(Cl
c2s
c(C(=O)N
c3cccc4
cn
ccc3
4)cc2
[N+](=O)[O-]
)c(Cl)c1
[N+](=O)([O-])c1cc
S(
c1s
3)cc1
[N+](=O)[O-])c1
c(Cl)cncc1Cl
N(C(=O)
s1)
c1cccc2cnccc12
s1
3)cc
([N+](=O)[O-])c1
c1ccc(NC(=O)
s2)
c2ccncc12
c1ncc(Cl
)c1Cl
c1cc
c2cnccc2c1
NC(=O)
c1([N+](=O)[O-])cc
c1(S
[N+](=O)[O-])
c1(C(=O)N
([N+](=O)[O-]
Cl)s
c1(Cl)cncc(Cl)c1
CCN(CC
)C
c1ccc(-c2n
c(C)c(C
Oc3cc
c(
[C@H](CC(=O)N
4
[C@@H]4C
c4ccccc4)
c4cc
o
n4)cc3
)s2)cc1
o1cc
[C@@H](C
C(=O)N2
C(=O)OC[C@@H]2C
c2ccccc2)
c2ccc(OC
c3s
c(-c4cc
c(CN
(CC)CC
)cc4)n
c3C
)cc2)n1
c1(OC
c2sc(-c3cc
)cc3
)nc2C
)ccc(
c2cco
n2)cc1
c1ccccc1
C[C@H]1
N1C(=O)C
[C@@H](
c1ccc(OC
)cc1)
on1
c1cccc(C
[C@H]2C
OC(=O)N2
C(=O)C
[C@@H](c2cc
c(OC
)cc2)
n2)c1
c1cc(-c2n
)s2)ccc1
CN(CC)CC
c1cc(
no1
c1(C)nc(-
c2ccc(CN
(CC)CC)cc2)
COc1ccc(
s1c(-
nc(C)c1
C(C)
N(CC)C
)ccc1
C(=O)N1
[C@@H]1C
c1ccccc1)
O(C
c1sc(-
)cc2)nc1
C)
c1ccc(
c1(CO
c2ccc(
C(=O)N3
[C@@H]3C
c3ccccc3)
c3cc
on3
sc(-
nc1C
n1c(-
s
c(CO
)cc2)c1C
N1(C(=O)C
c2cc
on2)
[C@@H]1Cc1ccccc1
n1o
ccc1
)nc2C)cc1
C1(=O)
OC[C@H](C
Cc1n
c(-
C(c1ccccc1)
[C@H]1
CC1(C)CC
2CCN(c3cc
S(=O)(=O)
c(NCC
5
CN(C(C
F)C
)c([N+](=O)[O-]
)c4
)c(O
c4cn
c5
[nH]cc
c4)c3
)CC2)
=C(
c2ccc(Cl)cc2)C1
c1cc(Cl)ccc1
C1=C(C
N
CCC
(C)(C)C1
C(F)
C(CF)
N1CC
(CN
c2ccc(S(=O)(=O)
c3ccc(N
4CCN(CC
c6cc
c(Cl)cc
6)CC
(C)(C)CC
5)CC4)cc3
c3cn
c4[nH]ccc4c3
)cc2
[N+](=O)[O-])C1
N1(CC
2
c3ccc(Cl)cc3
)CC(C)(C)
CC2)
CCN(c2cc
CC4
)c3
)c2)CC1
C1CN(CC
CCN1
c1ccc(C(=O)N
c2ccc(N
CC3
F)
C3
)c([N+](=O)[O-])c2
c2cn
c3[nH]ccc3
c2)c1
c1cc2cc
(O
c3cc(N
5)CC
4)ccc3
C(=O)NS(=O)(=O)
)cnc2
[nH]1
C1(C)(C)
CC
)ccc(N
2CCN(CC3
c4ccc(Cl)cc
4)CC
3)CC2)cc1
Oc1cn
c2[nH]ccc2c1
c1ccc(N
CC2
C2)
c([N+](=O)[O-])c1
)c1ccc(N
C1C(CN
)CN1
C(C
F
c1(Cl)ccc(C2
=C(C
3CCN(c4cc
c5cc
6
)c5
c5cn
c6
c5)c4
3)CC
2)cc1
c12ncc
)c3)cc1
cc
[nH]2
)S(=O)(=O)
c2)cc1
N1CCN(CC
2)CC1
c1n
c2[nH]cc
c2cc1
Oc1cc(N
3)CC2)ccc1
c1ccc(S(=O)(=O)
3CCN(CC4
c5ccc(Cl)cc
4)CC3
F)C1
O=S(=O)
(NC(=O)
c1cc(C2
2)ccc1Cl
CCO
c1ccc(O
c2ncnc3
c2cnn3
C2CCN
(C(=O)OC
3CCCC
3)CC2)
c(F)c1
n1(C
2CCN(C(=O)OC
ncc2
c(O
c3ccc(OCC)cc3
ncnc2
1
C1CCCC1
OC(=O)
N1CCC(
n2ncc3
c(Oc4cc
c(OCC
)cc4
F)n
cnc3
C1CC(
2)CCN1
1CCCC1
N1(C(=O)OC
2CCCC2)CC
C(
c1cc(OCC
)cc(F)c1
c1ncnc2
c1cnn2
C1CCN
2CCCC2)CC1
c1(O
3)CC2)cc
)cc1F
C1CC
C(OC(=O)
N2CCC(
n3
ncc4
c(Oc5cc
)cc5
F)ncn
c4
3)CC2)C1
C1CN(C(=O)OC
2CCCC2)
CCC1
n1ncc2
c1c(OCC
)ccc(O
3)CC2)c1
c1nc(O
c2ccc(OCC
)cc2F)
c2cnn(C
3CCN(C(=O)OC
4CCCC
3)c2n1
)ccc1O
C(C)O
n1cc2
n1
c12cn
n(C
4)CC3)c1
c1ccc(OCC
n1cn
c2c(cn
n2
C1(
cnc32)
CCN(C(=O)OC
Cn1cn
c(-c2cc
(C#N
)ccn2)c1
-
c1ccc(-n2cccn2)cc1
n1cc
cn1-
c1ccc(-
c2c(-c3cc
)ccn3
)ncn
2C)cc1
N#C
c1ccnc(-
c2ncn
(C)
c2-
c2ccc(-n3cc
3)cc2)c1
c1cnn(-c2cc
c(-c3
c(-c4
cc(C#N
)cc
n4)n
cn3C
)cc2)c1
c(C#N)cc1
-c1n
(C)c1-
c1(C#N)cc
nc(-
c1nc(-c2cc
)ccn2)
c(-n3cc
cn3)cc2)
n1C
c1cc(-c2c(-c3cc
)ncn2C
)ccc1-
n1cccn1
c1(-c2c(-c3cc
)ccc(-
n2cc
cn2)cc1
c1-
c1cc(C#N
)ccn1
c1ccn
n1-
n1(C)
c1c(C#N
)ccnc1
c1(-c2cc
ncn
ncn1
C
c1cn
c(-c2n
cn(C)
cn3
)cc2)cc1
C#N
C(#N)
)cc(-
c1cc(-n2cc
2)ccc1-
c1c(-c2cc
2CCCCO2)
c(-c2ccc(OC
c3ccc4ccccc4n3
)ccc(OC
2CCCCO2)c1
c2ccc3ccccc3
c1cc(-c2cc
)ccc2OC
2CCCCO
2)ccc1OC
c1ccc2ccccc2n1
C1CCCC(O
c2ccc(C#N)cc2
)cc2)O1
O(
c1ccc(C#N)cc1
)C1
CCCCO1
c1(COc2cc
c(-c3cc
(C#N)ccc3
OC3CCCCO
3)cc2
c2ccccc2n1
c1cc(COc2cc
3)cc2)
nc2ccccc12
c12ccccc1nc(C
Oc1cc
)c1ccc(-c2cc
2CCCCO2)cc1
c1cccc2nc(C
)ccc4
OC
4CCCCO
4)cc3
)ccc12
c12cccc
c1ccc(C
)n2
C1CCC(O
OC1
C1CCOC
)cc2)C1
n2)cc
c1cc(C#N)ccc1
OC1CCCCO1
c2ccc(C
)nc2c1
c1cccc2cc
c(COc3cc
)nc12
2CCCCO2)cc
c1cc2ccccc2nc1
COc1ccc(-c2cc
COc1ccc(C
(O)C
c2c(Cl)c[n+]([O-]
)cc2Cl
)c2c1
(CCC
C1
)O2
c1cc(OC)c2c(c1
C(O)C
c1c(Cl)c[n+]([O-])cc1Cl)
[O-][n+]1
(Cl)c(C
C(O)
)c3c2
OC2
(CCCC
2)O
3)c(Cl)c1
c1(Cl)
c[n+]([O-]
)cc(Cl)c1
CC(O)
c1ccc(OC)c2c1
O(C)c1ccc(C
[n+]1([O-]
)cc(Cl)
c(C
c12c(C
c3c(Cl)
Cl)cc
c(OC)c1
C1CCC
2(C1
)O
c1c(OC)ccc(C
Cl)c1
O2
2O
O1
c2c(OC)ccc(C
Cl)c2
2CCCC2
Clc1
c12c(OC
)ccc(C
c1cc(C
)c2c(c1
)OC1
c2c(C
c(OC)c2
OC(C
c1(C
c1c(Cl)c(C
c(Cl)
c[n+]1[O-]
CC(C)(C)OC(=O)N
c1ccc(Br)cc1Cl
NC(=O)OC(C)(C)C
)c1ccc(Br)cc1
Cl
)ccc(Br)cc1
c1cc(Br
)c(Cl)cc1
Br
c1(Br)ccc(C(=O)N
c1c(Br)cc
c1(Cl)cc
(Br)ccc1
c1cc(Br)ccc1
(NC(=O)OC(C)(C)C
)C(=O)
N(NC(=O)
)C(=O)OC(C)(C)C
c1ccc(Br)cc1
OC(C)(C)C
O(C(=O)N
)C(C)(C)C
C(C)(C)(C)OC(=O)N
CCOP(=O)
(COC
c1nc2c(N)n
cnc2
n1CC
c1ccccc1)OCC
c1nc(N)c2
nc(C
P(=O)(OCC)OCC
)n(CC
c3ccccc3)c2n1
n1c(C
)nc2c(N)n
cnc21
)c1ccccc1
O(CC)
P(=O)
c1ccccc1)C
c1ccccc1CC
C(Cc1ccccc1
)n1
c(COC
c1(N)n
c1nc(C
)n2CC
C(OC
)c1
nc2
c(N)n
n1cnc(N
)c2nc(C
c3ccccc3)c12
c12nc(C
c3ccccc3
)c1ncnc2
c1(CC
n2c(C
)nc3
c(N)ncnc3
2)ccccc1
n1cnc2c(
c2ccccc2)c1
c1cccc(CC
2)c1
c2ccccc2)c2
ncnc(N)c12
c12ncnc(N)c1
O=C(O)
CO
NC(=O)NC
c1cccc2ccccc12
c1cccc2cccc
OCC(=O)O)
c12
c1ccc2c(C
cccc2c1
C(NC(=O)N
c1cc(CN
c2ccccc2c1
O=C(NC
c1cccc2ccccc1
2)N
OCC(=O)O
OC(=O)CO
(OCC
(=O)O)
C(=O)NC
C(O
c1cccc2ccccc12)
C(=O)O
N(C
c2cccc(CN
c2c1
c12ccccc1c(C
OCC(=O)
O)ccc2
c12ccccc1cccc2
CNC(=O)N
C(=O)O)
O)cc
cc12
c1(CN
cccc2
ccccc12
C(=O)(NC
c1ccc(CN
c2ccccc12
c1ccc2ccccc2c1
CCOC(=O)
c1nn
[nH]c1
C(=O)
c1ccc(OC)c(OC)c1
c1(C(=O)
c2ccc(OC)c(OC)c2
)[nH]
nnc1
C(=O)OCC
c1cc(OC)c(OC)cc1
C(=O)c1[nH]
c1(OC)cc
(C(=O)
c2[nH]
nnc2
)ccc1OC
)c(OC)c1
O=C(OCC
)c1nn
C(=O)(OCC
c1cc(C(=O)
C(C)OC(=O)
)cc(OC)c1OC
[nH]1nn
c(C(=O)OCC)c1
c1(C(=O)OCC
)nn
O(C)
n1n
c(C(=O)OCC
)c(C(=O)
c2ccc(OC)c(OC
)c2)[nH]1
n1n[nH]
c(C(=O)
)c2)c1
c1c(C(=O)
)ccc(OC)c1
O(CC)C(=O)
O=C(
)c1[nH]
C(=O)(
CNC(=O)
[C@@H](NC(=O)
[C@@H]1CCCN1C(=O)
[C@@H](NC(=O)OCc1ccccc1)C(C)C
)C(C)C
[C@H](C(=O)
N1CCC[C@H]1
CC(=O)N
[C@H](C(=O)N
CC(=O)OC
)C(C)C)
OCc1ccccc1
C(C)(C)
[C@H](NC(=O)
[C@@H](NC(=O)OCc1ccccc1
C(NC(=O)
[C@@H](NC(=O)OC
N(CC(=O)N
O=C(C
c1ccc(COC(=O)N
2CCC
[C@H]2C(=O)N
)C(C)C)cc1
c1(COC(=O)N
)ccccc1
c1ccccc1COC(=O)
[C@@H](C(=O)N
N1C(=O)
C(=O)(C
CC(C)
[C@H](NC(=O)OCc1ccccc1
)C(=O)N1CCC[C@H]1
)N
c1cccc(COC(=O)N
c1ccc(CN2CC
C(NC
c3c[nH]
C1(NC
c2c[nH]
cn2)
CCN(Cc2ccccc2)CC1
c1c[nH]cn1
c1cccc(CN2CC
C1CC(NC
CCN1Cc1ccccc1
c1ccccc1CN1CC
cn2)CC1
N1CCC(NC
C1CN(Cc2ccccc2)CCC1
NC
2CCN(Cc3ccccc3)CC2)
c[nH]1
c1(CN2CC
3)CC2)ccccc1
N1(Cc2ccccc2)CC
c1(CNC
c[nH]
cn1
C1CCN(Cc2ccccc2)CC1
)c1c[nH]
n1c[nH]cc1
CN
c1[nH]cnc1
[nH]1cn
c(CNC
2CCN(C
c3ccccc3)CC2)c1
c1ccc(OCc2ccccc2
)c(Br)c1
c1ccc(O)cc1
c2ccc(O)cc2
Br)ccccc1
c1ccccc1CO
c1cccc(CO
Br)c1
c1ccc(CO
Br)cc1
O(Cc1ccccc1)
c1(OCc2ccccc2
)ccc(O)cc1
c1cc(O)cc
(Br)c1
c1cc(OCc2ccccc2
)c(Br)cc1
c1(O)cc
c(OCc2ccccc2
c1c(O)cc
c(OCc2ccccc2)c1
c1(Br)cc
(O)ccc1
c1cc(O)ccc1
n1nc(-
c2ccc(O)cc2)
c2cccc(Cl)c2
c(-c3ccc(O)cc3
)nn(C
(C)C
)c12
c1ccc(-c2nn(C
(C)C)c3
c(Cl)cccc2
(Cl)c1
n(C(C)C
)nc2-
c1(-c2nn(C
c(O)cc1
c1cc(-c2nn(C
3
(C)C)c2
c(-c2nn(C
n1(C(C)C
)nc(-
c(Cl)cccc1
)nn2
C(C)C
c1ccc(Cl)c2
c1c(-
c1cc(Cl
)c(-
c1(-
c2ccc(O)cc
2)n
c1ccc2c(-c3cc
c(O)cc3
Cc1ccccc1
2Cc3ccccc3
c3ncccc3
c1cnc2c(c1
)N(C(=O)
C)cc1
)Cc1ccccc1
S2
c12ccccc1
CN(C(=O)
c3ccccc3C
c1cccnc1
c2ccccc2C
N1C
c2ccccc2S
c2ncccc21
c2ccc(C(=O)N
3C
c4ccccc4
c4ncccc4
)ccccc1C
c1ccnc2c1
N1(C(=O)
c2ccc(NC(=O)
)cc2)C
n1cccc2c1
Sc1ccccc1
CN2C(=O)
c2ccccc2C)cc1
c1ccc(C)
c1ccc2c(
n1)
S1
c2ccccc2
c2cccnc21
c12ncccc1
c1(C)ccccc1
c1cccc2c1
c1ncccc1
)C2
c1cc(NC(=O)
C(=O)N1C
C1c2ccccc2
c2ncccc2
c(C)c1
c1cccc(C(=O)N
c1C
FC(F)(F)
c1ccc(N2CC
c3ccccc32)
c(Br)c1
c1(C(F)(F)F)cc
c(N2CC
O1CCN(
c2ccc(C(F)(F)F)cc2
Br)
c2ccccc21
c1cc(C(F)(F)F)cc
N1CCO
(C(F)(F)F)cc
c1
N1(
)CCO
OCCN2
c1ccc(C(F)(F)F)cc1
C(F)(F)(F)
C1CN(
c2ccccc2O1
c1ccc2c(c1)OCC
N2
c1cc(C(F)(F)F)ccc1
c1(N2CC
c3ccccc32)cc
c(C(F)(F)F)cc1
N(
Br)CC
c1c(C(F)(F)F)cc
c3ccccc32)c1
c1cc(N2CC
c(Br)cc1
C(F)(F)F
C1CO
c2ccccc2N1
c1ccc2c(c1
)N(
c1(SC
)ncc
cc1F
c1(F)cc
cnc1
SC(C)C
c(SC
(C)C)c1
)c(F)c1
c1ccc(F)
(C)C)n1
n1cccc
(F)c1
COC(=O)C(C)(C)C
N1CCN(C
2=N
n3cc
(C)cc3
c1c(Cl)ccc2
(C)cc1
(C)(C)C(=O)OC
)CC1
)=N2
O=C(OC
)CCN1
C1=N
c2ccc(Cl)cc2
(C)cc2
c12cc(Cl)ccc1
N=C(
)CC1)
c1cc(C)
C2
C(=O)C(C)(C)C
C(C)(C)(C
c1(C)cc2
n(c1
c1cc(Cl)ccc1N
=C2
C(N1CCN(C
)C(C)(C)
CC(C)(C
c1(Cl)ccc2c(c1
c1cc(Cl)cc2c1
c2cc(Cl)ccc2
N=C(N
2CCN(CC
c2cc(C)
cn2
c12cc(C)
cn1C
c1ccc2c(c1)C
C1CN(C
CC(C)(C)C(=O)OC
C(=O)(OC
CCN(
c(F)ccc1
NC(C)C
)C1CCNCC1
CC(C)N
c1ccc(F)nc1
N(CC
N1CCC(N
(CC
)c2n
c(F)ccc2
c(NC
(C)C)c(N
(CC)C
2CCNCC2)n1
c1cc(NC
2CCNCC2)nc1
N(c1n
C1CC(N
2CCNCC2)
n
C1(N
)CCNCC1
)ccc(F)
nc1
C1CNCCC1
)c1n
c1ccc(NC
n1c(F)cc
c(N
C(C)C)c1
c1cc(F)
nc(N
2CCNCC2)c1
C(C)(C)N
N(CC)
(
O=C1NC(=O)
/C(=C/
4CC4)cc
(NC
4)nc2
N1
C1CC1
Nc1cc(N
C2CCCC
c2c(
/C=C3\
C3=O)
n12
c12nc(N
C3CCCC
3CC3
/C=C1\
C1=O
O=C1N
/C1=C
\
3)nc12
c2cc(NC
3CC3)n
3ncc
/C=C4
4=O)
c3n2)
CCCC1
c1nn2
3)nc2c1
n1cc(
/C=C2\
C2=O)
c2nc(N
)n12
C1(=O)NC(=O)
C1CCC(N
c3n
2)C1
2CC2)
n2ncc
c2n1
c1cc(N
cnn1
2)C1CC1
C(=O)NC(=O)
/C1=C/
c1(
cnn2
c2cc(N
3)n
c3c(
3)CC1
=C\
2)cc
(NC2CC2)
COC
c1cc(Cl)cc(Cl)c1
C(OC)
C(=O)(OC(C)(C)C)
C(OC)O
O(C(=O)
C(C)(C)(C)OC(=O)
CC(C)(C)OC(=O)
O=C(OC(C)(C)C)
)
(OC
(Cl)cc(Cl)c1
c1c(Cl)cc(Cl)cc1
c1(Cl)cc(Cl
Clc1cc(Cl
c1c(Cl)cc
)cc1Cl
O(C)C
c1cccc([N+](=O)[O-])c1
C(N)
)cccc([N+](=O)[O-])c1
c1ccc([N+](=O)[O-])cc1
)cc([N+](=O)[O-])c1
c1ccc(CN)cc1
cc(C
N)c1
[N+](=O)([O-])
c1cccc(CN)c1
O=[N+]([O-])
c1c(CN)cccc1
C#C
c1co
[C@H]3CN
4CCC3CC4
)cc12
c1c(C(=O)N
[C@H]2CN3CCC2CC
3)ccc2
cc(C#C
C1CN2CCC1
c3o
c1cc2o
)c2cc1
[C@H]1CN2CCC1CC2
2CCN
1C
[C@@H]2NC(=O)
c1ccc2o
c1o
4CCC3CC
#C
o1
c2cc(C(=O)N
C(#C
co
[C@H]1CN
2CCC1CC
N12CCC(C
C1)
c(C#C
)co
C12CCN(C
C1)C
c12cc(C(=O)N
c1(C#C
c2ccc3o
2CCN1CC2
(C
OCCO
S(C)(=O)=O)
c1cccc(Cl)c1
c1ccc(Cl)cc1
OC(C)=O
O=C(C)
c1(C(C
OC(C)=O)
cccc(Cl)c1
CS(=O)(=O)
OCCOCC
(OC(C)=O)
C(C)(=O)
C(OCC
OS(C)(=O)=O)
C(OC(C)=O)
O(C(C)=O)
c1c(Cl)cccc1
C(COCC
)OS(C)(=O)=O
O(CC
OCC
)S(C)(=O)=O
C(COS(C)(=O)=O)
O=S(C)(=O)
c1ccc(C(C
cc1Cl
c1cc(Cl)cc(C
OC(C)=O)c1
Clc1cccc(C
S(C)(=O)(=O)
c1ccco1
N1CCC(C
c2ccc3cc
2CC
c2cncc
(c2
c2ncc(Cl)c(n2)N
CC1
CCN
(C(=O)NC
c2ccco
)c1cc
c1cncc(c1
)Nc1ncc(Cl)c(
)N2
c12cc
c3ccco
)Nc1nc(
ncc1
Cl)N
)CC2
c1ccoc1
(Cl)c2
nc1N
C1CC(CC
Oc2cc
3)CCN1
C1CN
2)CC
(Cl)c(
n1)N
C3CCN
)c(c1
Clc1cn
c2nc1N
c2)CC
c2cc(
ccc2
c2n
c1ncc2
c12cncc
(c1
ncc1Cl
)c(
c2ncc
Nc1n
C1(CC
N(C(=O)NC
co1
n1cc2cc
O=
C1CN(c2cc
ncc2)
c1ccc(OCc2ccccc2)cc1
n1ccc(N
c(OCc4ccccc4)cc3
C2)cc1
c(OCc3ccccc3)cc2)
CN1
c1ccncc1
c1cnccc1
N1CCN(c2cc
C(=O)C1
Oc2ccc(N
3CCN(
c4ccncc
=O)cc2)c1
CC(=O)N1
c1cc(OCc2ccccc2)ccc1
ncc2)CC1
=O
CN(c2cc
=O)cc2
2CCN(c3ccncc3
=O)ccc1
=O)cc
c(OCc2ccccc2)cc1
=O)cc1
)C(=O)C2
)ccncc1
CCC(N
CCCNC(=O)OC(C)(C)C
n2cccc2
c(=O)
n1Cc1ccccc1
CCNC(=O)OC(C)(C)C
)C(CC
(N
c1cc2
c(=O)n(C
)c(C
(CC)N
)nn2c1
N(CCCN
C(CC
NCCCN
)n(C
c2ccccc2)c(=O)
cn12
)nn3
cccc3
c2=O)c1
c1ccccc1Cn1
c1=O
O=c1
c2cccn2
c1ccc2c(=O)
)nn12
C(CNC(=O)OC(C)(C)C
)CN
C(CCN
)NC(=O)OC(C)(C)C
c(=O)n1C
c1ccccc1)OC(C)(C)C
c1(=O)
c2ccccc2)c(C
)c2=O
CC(=O)
c1ccccc1O
c1cnn(C
(CC2CCCC2)
c(=O)c1
CC(C(=O)O)
n1ncc
C(C)=O)cc1
C(CC1CCCC1
ncc
(C(=O)O)
c1(Oc2ccccc2
C(C)=O)
cnn(C
C(=O)(O)
C1CCC(CC
=O)C1
cc(O
)C(=O)O
c1cccc(O
3CCCC3
)C(=O)O)
C(C)=O
c1cc(Oc2ccccc2
(C)=O)c1
c(=O)c2
c1c(Oc2ccccc2
C(=O)O)c1
n1cc(O
C(C)=O)cc
(=O)
c1nn(C
c(=O)cc1
Oc1ccccc1
c1(C(C)=O)
ccccc1
c1ccc(Cl)
c(-c2ccccn2)c1
c1ccc(-n2cn
cn2)nc1
c3ccc(-n4cn
4)nc3
)ccc2
)ccccn1
c2ccc(-n3cn
3)nc2
n(-c2cc
c(-c4cccc
n4)c3
)cn2)c1
c2ccccn2)cc
)ccc1Cl
c1ncn
-c1ccc(C(=O)N
c2ccc(Cl)
c(-c3ccccn3
)c2)cn1
n1ccccc1
n1cc(C(=O)N
)c2
n1cncn1
cn3)n
c1ccccn1
c1cccc(-c2cc
Cl)n1
c1cc(Cl)
c(-c2cccc
)cnc1-
c(-n2cn
cn2)ccc1
c1c(NC(=O)
)ccc(Cl)c1
c1ccc(-c2cc
Cl)nc1
n1(-c2cc
)cn2)
cncn1
c1cc(-n2cn
C=C1
C(=C
C1=C
(C(C)=O)
C1CC2
C1OC2
=C
C1(C
(C)=O)
CCC2
=C(C1
C1CCC2
O=C
(C)C1
C1C2
C12
=C(CCC
(C)=O)CC1
C1CC(C
=C1
(=C
2CCC(C
O1C2
C(=C)
=C2CC
=C)
C=CC
=CC(=O)OCC
c1cc(CC
)ccc1Br
c(CC
)cc1
Brc1ccc(C
C=
CC(=O)OCC)cc1
C(=CC
)C(=O)OCC
=CC
)OCC
C(C)OC(=O)C
N1CCN(c2n
nc(NC
4CCOCC4)c3
c(-c2cc3
3CCN(C(=O)OC(C)(C)C)CC
3)n2)cc1
NC1CCOCC1
O1CC
c2cc(-c3cc
cncc
c4c(N
4CCN(C(=O)OC(C)(C)C)CC
4)n
n2)CC1
n2)
CCO1
C1CN(C(=O)OC(C)(C)C)CCN1
3CCOCC3)c2
c2c(N
3CCN(C(=O)OC(C)(C)C)CC3)n
)cc2c1
C1COCCC1N
c1cc(-c2cc3
3)n2)cc
)cc2cn
2CCN(C(=O)OC(C)(C)C)CC2)n1
2CCN(C(=O)OC(C)(C)C)CC2)
nc(-c2cc
c1(-c2cc3
2CCOCC2)c1
c1(NC
2CCOCC2)cc
(-c2cc3
)nc(N
n1c(-c2cc
N1CCN(C(=O)OC(C)(C)C)CC1
N1(c2n
3)CCN
(C(=O)OC(C)(C)C)CC1
CN1C
c2cc(Cl)ccc2-
c(Br)n
N1(C)C
c12cc(Cl
n1c(Br
)nnc1
CN(C)C
c12ccc(Cl)cc1
c(Br)n1
-2
c1cc(Cl)cc2
c1cc2c(cc1
Cl)C
N(C)C
)CN(C)C
c1c(Cl)ccc2c1
c1cc(Cl)ccc1-2
c12nn
-c1ccc(Cl)cc1
c(Br
)n2c1
c2n(c1
c1(Br)n
n1-c1ccc(Cl)cc1
c1nnc2
nc(Br
)n2-
CN(C)C(=O)
[C@@H]1CCCN1
C(=O)OCc1ccccc1
[C@@H]1(C(=O)N
(C)C)CC
CN1C(=O)OCc1ccccc1
C(=O)N(C)C
N(C)(C)
C1C
(C)C)N
(C(=O)OCc2ccccc2)C1
c1ccc(COC(=O)
N2CCC
(C)C)cc1
c1cccc(COC(=O)
(C)C)c1ccccc1
c2ccccc2)CCC
)N(C)C
(C)C)
N1C(=O)OCc1ccccc1
C(=O)(OCc1ccccc1)
O=C(OCc1ccccc1)
(C(=O)OCc2ccccc2)
[C@@H]1
O(Cc1ccccc1)C(=O)
CCOC(=O)C
c2ccc([N+](=O)[O-]
)cc2C
SCC
(F)(F)F)c1
c1c(C
Oc1ccc([N+](=O)[O-])cc1
CSCC
(F)(F)F
c1(CC(=O)OCC
C(SCC
(F)(F)F)
c1cc([N+](=O)[O-])ccc1O
c1cc(CC(=O)OCC
C(SC
OC)
C(C(=O)OCC)
c1(Oc2cc
(CC(=O)OCC
OC)cc
c([N+](=O)[O-])cc1
c1cc([N+](=O)[O-]
)cc(C
Oc1cc(C
c1cc(Oc2cc
(F)(F)F)cc1
c1(OC)ccc(C
C(=O)OCC)cc1
CSC
c1c([N+](=O)[O-]
)ccc(Oc2cc
OC)c1
S(C
O(CC)C(=O)C
CCN(S(=O)(=O)
c2cccc3
)OC(C)(C)C
(CNC(=O)OC(C)(C)C
(Cl)c12
C1CN(S(=O)(=O)
C(=O)OC(C)(C)C
C1CCN(S(=O)(=O)
c1(S(=O)(=O)N
)CC2)cc
C1(CN
)CCN(
c1cncc2
cccc
(S(=O)(=O)N
3CCC(C
)CC3)c12
c1(Cl)cn
cc2cccc
c1cc(S(=O)(=O)N
c2c(Cl)cn
cc2c1
)CC3)c2c1
NC(=O)OC(C)(C)C)CC1
c1ncc
c(S(=O)(=O)N
)CC3
)cccc12
)cccc2c1
[C@@H]2CC
[C@@H](O)CC2)
[C@@H]1(N
c2ccc(C(=O)OCC)cc2
[C@@H](O)CC1
c1cc(C(=O)OCC
N[C@@H]1CC
C1C[C@H](N
[C@H]1O
[C@@H]1CC[C@@H](N
[N+](=O)[O-])CC1
(C(=O)OCC
)ccc1N
[C@@H]1CC[C@@H](O)CC1
(O)CC
[C@@H](N
[C@@H](O)CC
Nc1cc
c(C(=O)OCC)cc1
c1c(C(=O)OCC
C1C[C@H](O)CC
c1ccc(C(=O)OCC)cc1
C(=O)(OCC)
O=C(OCC)
c1cc(C(F)(F)F)cc(C(F)(F)F)c1
[C@@H]1CCCC
NC1CCN(C
c1(C(F)(F)F)cc(C(F)(F)F)cc
(OC)c1
)c(C(=O)N
[C@@H]2CCCC[C@@H]2
2CCN(C(C)=O)CC2)
c(C(F)(F)F)c1
)cc(C(F)(F)F)cc1C(F)(F)F
[C@H]2CCCC
[C@H]2NC(=O)
c2c(OC
)cc(C(F)(F)F)cc
C(F)(F)F)
)c1c(OC
(OC)
2CCN(C(C)=O)CC
C2CCN(C
C(F)(F)F)C1
C(F)(F)F)CC1
N1(C(C)=O)
FC(F)(F)c1cc(C(F)(F)F)cc
C1CN(C(C)=O)
N[C@H]1
CCCC
[C@H]1NC(=O)
c1c(OC)cc(C
(C(F)(F)F)
2)c1OC
[C@@H]1(NC(=O)
c1(OC)cc(C
(F)(F)F)cc
(C(F)(F)F)c1
(C)=O)CC
CCCCC
c3ccccc3c2n1
CCCCN
S(=O)(=O)c1ccccc1
C(CCC)C
)n
(CCCCN
c3ccccc3)c1
nc2N
c1nc(N
)c1nc(C
S(=O)(=O)N
)nc2c(N)nc3ccccc3c21
c1cccc(S(=O)(=O)N
c4ccccc4c3
C(CCCN
c(CCCCC
c12c(nc(C
c1ccccc12
c1ccc2nc(N
)c3n
c4ccccc4)c3
c1(CCCCC
c1ccc2c(c1)nc(N
S(=O)(=O)(N
C(CC)CC
c1cccc2nc(N
N(CCCC
)S(=O)(=O)c1ccccc1
c1c(N)n
CC(C)C
n1c(=O)
n(C)c(=O)
)cn
c3c[nH]c4cc
c(Cl)cc3
)nc21
Cn1c(=O)
c2n(CC
N(CCN
c1cc(-c2c3c(
=O)
n(CC
n2C
c2c[nH]c3ccc(Cl)cc2
(C)c1
CCNC(=O)
c1c(Cl
)ccc2[nH]
n3n
c4c(c3
c3cc(C(=O)N
)c(=O)
n4CC
c2c3c(
3)n1
)cn2C
c(=O)n(C)c(=O)
nn1C
c1c[nH]
c2ccc(Cl)cc12
)nc2n1
c12c(-c3cc
(CC(C)C
)c(=O)n(C)c2
CCNC
n1c2c(
)n1C
c(Cl)cc1
3)c(=O)
c1ccc2[nH]cc(C
C(c1c[nH]
2)n1
c2c(c1
-c1cc
)cn1C
nn(C
4)
[nH]1cc(C
n2n
c3c(c2
n3CC
c2cc(Cl)ccc12
c1c2c(=O)
Cn1cc
C(C)C)cc1
c1(Cl
)NC(=O)
C(c2ccccc2)
(c2ccccc2
)C(=O)N1CC
CN1CCN
(c2ccccc2)CC1
N1C(=O)N(C
2CCN(c3ccccc3)CC2)
(c1ccccc1)c1ccccc1
c1ccc(C2
(c3ccccc3
C(=O)N(C
CCN3CCN(
c4ccccc4)CC3
)C2=O)cc1
c1(N2CCN(C
CCN3
c4ccccc4)(
c4ccccc4)C3
=O)CC
C1(c2ccccc2
C1(=O)N(C
C(=O)NC1
c1cccc(C2
)C2=O)c1
c1(C2
)C2=O)
c1cccc(N
=O)CC2)c1
O=C1N(C
CCN2
C(c3ccccc3)
N1(C
(c2ccccc2)CC
)C1=O
)C2=O)CC1
c1ccc(N2CCN(C
=O)CC2)cc1
O=C(C)O
c1ccccc1C
c1cccc(OC
c1cccc(C)c1
c1ccc2c(c1)
[C@@H](N(C)C(=O)OC(C)(C)C
)CC[C@H]2
c1ccc(Cl)c(Cl)c1
CN(C(=O)OC(C)(C)C)
[C@H]1CC
[C@@H](c2ccc(Cl)c(Cl)c2
c2ccc(C(=O)OC)cc21
c1cc(C(=O)OC
[C@H](
[C@@H]2
N(C)C(=O)OC(C)(C)C
C(=O)OC)
[C@H](N(C)
C(=O)OC(C)(C)C)
c3cc(C(=O)OC)ccc3
c(Cl)c(Cl)c1
(c2ccc(Cl)c(Cl)c2
c2cc(C(=O)OC)ccc21
C(=O)(OC(C)(C)C
)N(C)
O=C(OC(C)(C)C
c1cc(Cl)c(Cl)cc1
[C@@H]1CC
O=C(OC)
c1c(C(=O)OC
)ccc2c1
Clc1ccc(
2)cc1Cl
c1c(
c(Cl)c1Cl
N(C)
c2ccc(C(=O)OC)cc2
c12ccc(C(=O)OC)cc1
C(=O)(OC)
Oc1ccc(C
2(C)C
)ccc3
CCCCCCCCO
S(=O)(=O)c2cc
c(C)cc2)cc1
CCCCCCC1
OC)cc2
OCC1
c1ccc(C)cc1
c1ccc(OCOC)cc1
)CCCO
S(=O)(=O)c1ccc(C)cc1
OC)ccc1
C1(C)C
)ccc2C1
OCOC
(C)(
C(CCCCCCCC
)C(C)
)CO2
c1cc(C)ccc1S(=O)(=O)
OCCCCCC
C(CCCCC
C1(C)
(c2ccc(OC
OC)cc2)
c2cc(OC
S(=O)(=O)c2ccc(C)cc2
OC)cc1
CCCCC1
CCCCCCC
S(=O)(=O)c2ccc(C)cc2)
c12cc(OC
2CCC(
c3ccc(C#N)cc3
)CC2)cc1
NS(=O)(=O)
c2ccc(C#N)cc2)
CCN1C(=O)
c(NS(=O)(=O)
c2cccc(C(=O)N
c1ccc(S(=O)(=O)N
3CCC(
c4ccc(C#N)cc4
)CC2)ccc1
C)c1
2CCN(C(=O)
c3ccc(C)
c4cccc
c(C)
C1CN(C(=O)
c2ccc(C)
c3cccc(C(=O)N
)CCC1
c1(C)cc
c1(NS(=O)(=O)
)cc(C(=O)N
CCN(C(=O)
)c2)cc1
c2ccc(C#N)cc2)CC1
(NS(=O)(=O)
)c2)c1C
)ccc2C
)cccc
N#Cc1ccc(C
c1cc(-
cn2)cc
(C(F)(F)F)cc(C(F)(F)F)c2)
(C(F)(F)F)cc1C(F)(F)F
(-
c1[nH]
cnc1-
(C(F)(F)F)cc(C(F)(F)F)
n1c[nH]
cc1-
N#CC1
CCN(C(=O)OCc2ccccc2)CC1
#N)CC1
c1(COC(=O)
N2CC
#N)CC
c1cccc(COC(=O)N2CC
C(C#N
)CC2)c1
N1(C(=O)OCc2ccccc2)CC
(C(=O)OCc2ccccc2)CC
#N
C1(C#N
)CCN
(C(=O)OCc2ccccc2)CC1
C(#N)C1
CCS
c1nc(N2CC
OC[C@@H]2C
c1cccc(F)c1
c1cccc(CNC(=O)
c2c(C)cc
(N3CC
OC[C@@H]3C
O)nc2
nc(S
CC)c1
c1(SCC
n1c(N2CC
c(C(=O)NC
c2cccc(F)c2)c1
)c1c(C)cc
(N2CC
O)nc1
N1(c2cc
c3cccc(F)c3
)n2)
CCOC
[C@@H]1CO
c1(CNC(=O)
)cccc(F)c1
[C@H]1(CO)
COCC
c2cccc(F)c2
c1c(N2CC
CC)
c2cccc(F)
c2)c1C
C1OCCN(c2cc
[C@H]1CO
c1(F)cccc(C
c1ccc(F)cc1
c1c(C)cc
c1c(F)cccc1
[C@H]1C
OCCN1
c1cc(F)cc
(CNC(=O)
C1COC
[C@H](CO)
CC1(C)
[C@@]2(C)CC
[C@]1
[C@@](O)(C
#
CC1)
OC2=O
C1(C#C
[C@](O)
(c2cc(Cl)ccc2
[C@@]2
3CC
[C@@](C)
O2)
O=C1
#CC
3CC3)
C(F)(F)F)CC
[C@]1(C)C
[C@@]1
)C2(C)C
C(F)(F)F)cc1
CC1CC1
)(
)cc(
C(F)(F)F)c1
[C@@](C
[C@](O)(C
)C(F)(F)F
O1C(=O)
[C@]2(C)CC
C2(C)C
[C@@]2(C)
[C@@]12
C(#
[C@]2
[C@@]1(C)C
c1ccc(C(C)(C)C)cc1
c1cc(C(C)(C)C
)ccc1C
c(C(C)(C)C)cc1
c1cc(C(C)(C)C)cc(N
)c1C
c(N)cc1
c(C)c(N)c1
c1ccc(C)c(N)c1
c1c(C(C)(C)C
)ccc(C)c1
c2cccc(NC
C#N)c1
C(#N)c1
)cccc1
C(=O)c1ccccc1
c1ccccc1C(=O)N
c1cccc(NC
)c1C#N
)c(C#N)c1
)c(C#N
)c(N
c1(C#N
)c(NC
)cccc(N
c1ccccc1)N
)C(=O)c1ccccc1
C#N)cc1
=C(C#N)
c2ccc3c(c2
S(=O)(=O)C
c2ccc(F)cc2)
nn3
)C(C#N)
=C(C)N1
Fc1ccc(C
c2nn
(C(=O)OC(C)(C)C)
c3ccc(C4
C(C#N)
=C(C)NC(C)
=C4
)cc23)cc1
3)ccc1F
n1nc(N
c2cc(C3
=C3
)ccc21
n1c(N
)ccc2n1
)cc23)cc
c(F)cc1
O=S(=O)(C
c1ccc(F)cc1)N
c2ccc(C3
=C2C
)ccc2c(c1
C1C(C
#N)
=C1C
nn
(C(=O)OC(C)(C)C
c1c(C2
=C(C#N
c1cc(F)ccc1C
C1(C#N)
c1cc(F)cc(F)c1
c1cc2ccccc2[nH]1
)C(=O)N
[C@@H]1C(=O)N
[C@@H]1c1ccccc1
)NC(=O)C
)[C@@H]1
c1(F)cc(F)cc
c2cc3cccc
c3[nH]
[C@@H]2C(=O)N
[nH]c(C
[C@H](NC(=O)C
c1ccccc1)c2
3ccccc3
c1cc(F)cc(F)c1)
[C@@H](c1ccccc1)
c1ccc2c(c1)S
[C@H](c1ccccc1)
)C(=O)N2
Fc1cc(F)cc
c1c(F)cc(F)cc1
c1ccc2cc(C
c3cc(F)cc(F)c3
[C@@H]3
[nH]c2c1
C1(=O)N
[C@H](c2ccccc2)
[C@@H]1NC(=O)
NC(=O)C
c2cc(F)cc(F)c2)
[C@@H](c2ccccc2)
Sc2ccccc21
c1ccc([C@H]2
Sc3ccccc3
c2cc(F)cc(F)
c2cc(F)cc(F)c2
[nH]c2ccccc12
c2ccccc2)cc
(F)cc(F)c1
c2ccccc2NC(=O)
[C@H]1c1ccccc1
c1c(OCc2ccccc2
)c(OC
-c1ccc(OC)cc1
(C)C)n
(-c2ccc(OC
C(=O)NCC
c(C(=O)NCC
(-c3ccc(OC)cc3
c1cc(-n2
c3ccccc3)c2
c1ccc(-n2
O(Cc1ccccc1)c1
c(OCc2ccccc2)
c(OC)cc2)
)c(OCc2ccccc2)c1
c1cc(OC)ccc1-
CN(C
c1ccccc1)c1
c3c(N
4CCOCC4)n
cnc3c2
c2c1C
OC(C)(C)C2
N(C)(C
c(N(C)C
)nc1
c21
C1COCC
N1CCN
c3c(c12)
OC3
c2ncnc(N
4CCOCC4
)c12)
C1CN(CCN
c2o
c4c(c2
(C)(C)OC
CCN2CCOCC2)
c3nc(N
c12)
CC(C)(C)OC
O1C
5CCOCC5)n
cnc4
c3c2
CC1(C)C
CN1CCOCC1
)c1ncn
c12c(
3)C
c3
c2C
C(c1ccccc1)N
c12c3c(
2)C
c2
CN(C)
N1(CCN
c4c(
C1c2c(
OC1(C)C
O1CCN(C
4)CC1
c1ccc(COc2cc
c(-c3ncc
4CCCC4)n
3)cc2)cc1
c1ccc(-c2ncc
3)cc2)ccccc1
nc1-
nc(-c3cc
)n2)C1
c3ccccc3)cc2)
c2nccc(N
3)n2)ccc1
C2CCCC2)
c1(-c2ccc(OC
C2CCCC2)n1
c1cccc(COc2cc
c1(OCc2ccccc2)cc
c(-c2ncc
c1nccc(N
NC1CCCC1
C#
Nc1nc(N
(O)
(CO)
CN3CC
)ncc1Cl
C1(O)
c3ncc(Cl)c(N
c4c(F)cccc4
c3ccc4c(c3
4CC
)ncc2
)c(F)cccc1
c1cc(F)c(N
#C)c1
c1ccc(F)c(N
N1(CC)CC
(CO)CO
)n3
CC#C
Cl)c1F
O=C(NCC
#C)
C1Oc2cc
(O)CO
)CNC(=O)
c1cc(Nc2ncc
(Cl)c(N
c3c(F)cccc3
N(CC)CC
CO2
)ncc(Cl)c1
C(C#C
N(CC#C
c2c(F)cccc2
N(c1nc(N
)ncc1
c(F)cccc1
2CC3
)C2)nc1
c2ccccc2C(F)(F)F)
)CN(
)cn1
)C2)cc
c(C(=O)NCCC
FC(F)(F)c1ccccc1
C(=O)N1CC
4CC4
C3)C2
)ccc1C(=O)N
2CC2)cc
C3)c1
2CC2)ccc1
N1CC2
C(F)(F)F)C
c1cccc(C(F)(F)F)c1
C(CNC(=O)
)C1CC1
c1ccccc1C(F)(F)F)
CN(
c3ccccc3C(F)(F)F)
c1no
2CCC(N
c3cc(-c4cc
c(C#N)cc4
no
3CC3)CC2)
C1CN(c2n
c(C(C)(C)C
)no
2)CCC1
c2ccc(C#N
CCN(c2n
)no2)CC1
(C(=O)N(C
3CC3)C
3CCN(c4
nc(C(C)(C)C
3)o
)ccc(-c2cc
(C1CC1
c(C#N)cc3
c1nc(C(C)(C)C
)no1
o1nc(-
F)cc1
2CC2)CC1
C2CCN(
no2)
3)CC2)CC1
c1ccc(CBr
BrC
c1ccc(C(=O)O)cc1
C(Br)c1cc
c(C(=O)O)cc1
c1(CBr)cc
c1cc(C(=O)O)cc
CBr
c1cc(CBr
)c(F)cc1
c1(C(=O)O)cc
c(CBr
C(=O)(O)c1ccc(C
c1c(C(=O)O)cc
c(CBr)c1
(C(=O)O)ccc1
c1cc(C(=O)O)ccc1
CC(=O)O
CC(=O)O)
CC(=O)O)c1
c2)CC1
C)S(=O)(=O)
C(C(=O)O)
CC(=O)O)cc
CC(=O)O)cc1
(CC(=O)O)
C1CCN(C(=O)
=CCC3
(CC2)OCCO
C1(c2cc
=CCC
2(CC1
)OCCO2
c(OC)cc1
c1cc(OC)ccc1
3)ccc1OC
C1=C(
c2ccc(OC)cc2)
C1C=C(
2OCCO2
c3ccc(OC)cc3
(c2ccc(OC)cc2)
=CCC1
c1ccc(OC)cc1
O1CCOC1
C1COC2
)CC2)O1
c2ccccc2)N(C
2C(=O)N
)C[C@H]2
c2ccccc2)CC1
c2ccccc2)CC
N1C(=O)OC(C)(C)C
CC(C)(C)OC(=O)N1CCC(N
C1[C@@H](
C1CN(C(=O)OC(C)(C)C)CCC1
N1C(=O)N
)C[C@H]1
[C@@H]2CN
C2CCN(C(=O)OC(C)(C)C)CC
)CN(C(=O)
)C(=O)N1
C1CCN(C(=O)OC(C)(C)C)CC1
O=C(NC)
C(=O)(NC)
N(C)C(=O)
c1cccc(
N1(C(=O)OC(C)(C)C)CC
NCC1
(O)CCCC
2)ccc(Br)cc1
c2ccc(Br)cc2
)CCCC1
(O)CN
c1ccc(Br)cc1[N+](=O)[O-]
C1CCC(O)
(Br
CC1(O)
c1(Br)ccc(N
Brc1ccc(N
C=CC(=O)OCC
(Cl)(Cl)Cl
C(=O)(C=C
)OCC(Cl)(Cl)Cl
O=C(C=C
C(Cl)(Cl)Cl
C=C
C=C)
C(Cl)(Cl)
(Cl)C
OC(=O)C=C
ClC(Cl)
CC1CC
)c1cc(OCC
(F)(F)F)ccc1
OCC(F)(F)F
FC(F)(F)CO
2CCCCN
(C(=O)NCC
c1(OCC
O(CC(F)(F)F)
OCC(F)(F)F)
C1CCCCN1
C1CCCN
C1CNC(=O)
C1(CNC(=O)
c2cc(OCC
CCCCN1
C1CCC(C
NC1
c(OCC(F)(F)F)
c1cnn(C)c1
)c(C(=O)NC
(C)(C)C
OCC[Si](C)(C)C
n1(C)cc
c(C(=O)NC(C)(C)C
)cn(C
c1c(C(=O)NC
)c2nc(N
n(C)
c3)
c(C)nc2
n1COCC[Si](C)(C)C
CC(C)(C)NC(=O)
c1cn(COCC[Si](C)(C)C
nc(C)
c3)nc12
C[Si](C)(C)CCOC
(C(=O)NC(C)(C)C
c(C)n
O(CC[Si](C)(C)C)C
[Si](C)(C)(C)CCOC
c12nc(C)
c3cnn(C)c3
C(OCC[Si](C)(C)C
)n1cc
n1(COCC[Si](C)(C)C
C(C[Si](C)(C)C)OC
c1(C(=O)NC
c1n(C
C(=O)NC(C)(C)C
c2cnn(C)c2
)nc2
c1(C)n
)cnn1C
n1c(C)
C[C@@H](N
I
)C1CCOCC1
[C@H](C)C
2CCOCC2)
ncccc1
I)
[C@H](C)C1
CCOCC1
[C@H](C)
[C@@H](C)N
)CCOCC1
C1COCCC1
)CCO1
(I)c1
c1ccc(I
2CCOCC2)n1
c1cnc(N
c(I)c1
c1ccnc(N
c1(I)cc
cnc1N
c1cccnc1N
CC(C)(C)OC(=O)NC1
(c2cc
c(C(=O)OC
c5ccccc5
n3-
c3cccnc3
c3ccccc3-
4)cc2)
c2ccc(-c3n
c4n(
c3-
c3ccc(C
5)cc3
)-
c(-c2ccc(C3
(NC(=O)OC(C)(C)C)CCC3
c1ccccc1N
)CCC2
c4ccccc4)cc3
n2-
c2cccnc2N
c2ccccc2-
3)ccc1
C1(NC(=O)OC(C)(C)C
c3n(
4)cc2)c1
)c(-c3cc
c(C4
(NC(=O)OC(C)(C)C)CCC4)cc3
-c1cccnc1
c1(-c2n
c2ccccc2)cc1
)ccc(C2
)CCC2)cc1
c1cccc2c1-
n12c(
-c1ccc(C
-c1ccccc1
Nc1ncccc1
Nc1ccccc1
O=C(O)CC
/C=C2\C(=O)N
C(=O)CCC2
/C=C3
\C(=O)N
3)c(C
c3c(c1
CCC(=O)O)
C(=O)CCC
c12c([nH]
3)c1
CCCC2=O
C1(=O)CCC
c1ccc2c(c1)NC(=O)
/C2=C\
c1[nH]c2c(c1
C1CC(=O)
c2c([nH]
3)c2
[nH]
C1CCC(=O)
c2c1[nH]
/C=C1
c3ccccc31
CCC(=O)O
OC(=O)CC
C(=O)(O)CC
C(CC(=O)O)
c1ncc(-
c2cccc(-
c2)[nH]1
c1ccc(C(F)(F)F)
c2cccc(-c3cn
c(C(N)=O)
3)c2)c1
c1ccccc1-
c1cccc(-c2cn
[nH]2)c1
c1ccc(-c2cn
[nH]2)cc1
c1cc(-c2cn
[nH]2)cc
(-c2ccccc2
c1(-c2ccccc2
C(F)(F)F)cc
cc(-
c1(C(N)=O)
ncc(-
[nH]3)c2
c2cccc(-c3ccccc3
C(F)(F)F)c2
ccc1-
)c(C(F)(F)F)c1
)c1ncc
c1ccc(-c2ccccc2
-c1cn
(N)=O)
[nH]c1-
c1cccc(-
n1cc(-
)[nH]c1
C(N)=O
C(N)(=O)
c1c(-c2cn
2)cccc1
2CCC3(CC2)OCCO
3)nc1
C1CC2(CCC1
c2ccccn2)
CCC2(CC1)OCCO2
c1ccnc(C
C12(CCC
c3ccccn3
CNCCN1
2CCNC
[C@@H]2C
c2cc(C(F)(F)F)cc
C1CNC
[C@H](C)N1
c3ccc(C(F)(F)F)cc3
[C@@H](C)C
[C@H]1(C)C
NCCN1
c1ccc2c(c1)C(
C[C@@H]1C
cc(C(F)(F)F)ccc1
[C@@H](C)C1
)C(
2c1
c1cc(C(F)(F)F)
nn1
CCBr
C(CBr
C(Br)C
n1nc(C
BrCC
n1(CC
)nc(C
c1(C(=O)OC
)cc(C(F)(F)F)
c1c(C(F)(F)F)
nn(CC
Br)n1
n1c(C(F)(F)F)cc
CC(N
C(c1ccc(F)cc1)
c1cccc(N)c1
c1ccc(F)c(F)c1
c1c(N)cccc1
)c1ccc(F)cc1
c1(C(N
c2ccc(F)c(F)c2)
c2ccc(F)cc2)cc
cc(N)c1
c1cc(C(N
c2cccc(N)c2
)ccc1F
c(C(N
c2cccc(N
c1(N)cc
cc(C(N
c2ccc(F)cc2)c1
c1cc(F)ccc1
c(C(C)
NC(
c1ccc(C(N
c2ccc(F)cc2)cc1
c1cccc(C(N
)c2)cc
c1cc(F)c(F)cc1
c1ccc(F)cc1)
c1cc(C(C)
)cc(F)c1F
(C(C)
COc1n
c(Cl)cnc1
c1ccc(Br)s1
O=S(=O)(N
c2ncc(Cl
c(Br)s1
c1cc(Br)sc1
)nc1OC
)sc1
c(Br)ccc1
OC)S(=O)(=O)
c2ccc(Br
)s2)
(Cl)nc1
c1(OC)n
c(Cl)cn
)s2)c1
c(OC)n1
Clc1cnc(N
)nc1Cl
(Cl)n
CCC(=O)
CCN(CC)CC
)c(OCC
CC)cc1
C(=O)(CC
)CO
O=C(CC
)C(=O)CC
c1cc(Cl)c(N)cc1
)c1cc(Cl)
C(C)N(CC)CC
C(C)C(=O)
)c(Cl)cc
c1cc(OCC(=O)
(OCC(=O)
)N(CC)CC
N(CC)(CC)CC
c1cncc
[C@@H](COC
c1ccccc1)C(=O)N
c1ccc(Oc2ccc(F)cc2)cc1
c1cccc(COC
c2cnccn2)
c2ccc(O
c3ccc(F)cc
c1cnccn1
c1ccc(COC
c3ccc(F)cc3
c(NC(=O)
[C@H](COC
c3cnccn3
c1cc(O
c2ccc(F)cc2)ccc1
NC(=O)[C@H](C
)[C@H](C
c(Oc2cc
OCc2ccccc2)
c2ccc(Oc3ccc(F)cc3)cc2)
c1cc(F)ccc1O
c1(COC
c3ccc(F)cc3)cc2
c1cnc(C
C(=S)N
NC(=S)N
C(=S)
(NCC
S=C(N
N(Cc1ccccc1)
c1ccccc1CN
(c1ccccc1
(c2ccccc2)
c2cc(NC(=O)
)ccc2N1
(C)CC
(C)(C)
N(C(C)=O)
c(NC(=O)CC
C(=O)CC
c1(NC(=O)CC
)cc21
NC(=O)CC
C1(C)CC
(NC(=O)CC
(C)c1ccccc1
NC(CO)
C2CCCCC2)c1
(N)
C2CCCCC2)cc1
C(N)CO
C2CCCCC2
(N)C
O)c1
O)cc1
NC1CCCCC1
)cccc(C
)C1CCCCC1
c2cccc(C
O)c2
)CCCCC1
C1CCCCC1
Nc1cccc(C
C1CCCC(N
c2)C1
C)cc
)cc(C)c1
c(C)cc1OC
c1(OC)ccc(N
C)c(C)c1
O(C)c1ccc(N
COc1ccc(N
c1c(OC)ccc(N
c1(C)cc(OC
CCNCC1
cc2F)
c(=O)c(C(=O)O)cn
O=C(O)c1cn
(CC)c2
NCC
)C3
)c(F)cc2c1=O
c1(F)cc2
c1c(F)c(N
)C2)
c1c(=O)
c(C(=O)O)cn
c1nc2c(cc1
F)c(=O)c(C(=O)O)cn
c2nc3c(
)CCC(C
c1c(C(=O)O)
c2cc(F)
c(N3CC
C(CNCC
)C3)n
)c(F)cc12
c(F)cc2c(=O)c(C(=O)O)cn
(F)c(N
c1n(CC
)cc(C(=O)O)
c2=O
n1cc(C(=O)O)c(=O)
c2c(cc1
C(NCC
CNCC
CN1CCN(C
c2ccc(-c3cc
n4cc
c6cccc
(F)
c-
4)o
)cc2)CC1
4CCN(C)CC4)cc3
2)cc2
nc(-c3cccc(F)c3F)nc-2
c1(F)c(F)cc
cc1
5CCN(C)CC
5)cc4)n
c1cc(-c2cc(C
c5cccc(F)c5
c-4
n2)ccc1
CN1CCN(C)CC1
c1ccc(-c2cc(C
N1CCN(C)CC1
c3cnn(C
c4cc(-c5cc
CCN(C)CC
6)cc5
4)cc
-3
(F)c1F
c1cccc(-c2n
3CCN(C)CC3)cc2
cc3
c4cccc(F)c4
c-3
c2cn(C
3)ncc
c1cccc(F)c1F
n1oc(C
2CCN(C)CC2)cc1
c1(-c2cc(C
)ccc(CN
3CCN(C)CC3)cc2)
n3)cc2)
CCN(C)CC1
2CCN(C)CC2)cc
c(-c2cc(C
2CCN(C)CC
c1cc(Cn2
c1c2n
c(-c3cccc(F)c3
c-2
cnn1C
c1cs
c(I)n1
c(C(=O)OCC)cs1
c1(I)n
s1cc
c(I
c1(C(=O)OCC)
cs
C(=O)(OCC)c1
O=C(OCC)c1
n1c(C(=O)OCC
)csc1
N[C@H]1C
c2c(cccc2-
c2ccccc2)N
C[C@H](N
OC(=O)C(C)(C)C
c2cccc(-c3ccccc3)c2
O(N
C1=O)
c2cccc3c2
SC[C@H](N
3)ccccc1
SC
[C@@H]1N
C1S
c2c(cccc2
-c2ccccc2
[C@H]1N
(-c3ccccc3
ON
[C@H]1(N
)CS
C(=O)(O
c2c1cccc2
c1ccc2c(c1)c(-
c1cn[nH]c1
C(c1ccccc1)(c1ccccc1)c1ccccc1
c1ccccc1C(c1ccccc1)(c1ccccc1)n1
[nH]c2)
c2cc([N+](=O)[O-])ccc21
c1cccc(C(c2ccccc2)(c2ccccc2)n2
nc(-c3cn
c3cc([N+](=O)[O-])ccc3
(c2ccccc2)(c2ccccc2)c2ccccc2)
c2ccc([N+](=O)[O-])cc12
c1ccc(C(c2ccccc2)(c2ccccc2)n2
c1(-c2cn
[nH]c2
c1ccc(-c2cc3
[C@H]4C
[C@H](OC(=O)
c5ccccc5)
[C@@H](CO)
4)c(=O)
nc3
o2)cc1
c1cc2cn
[C@H]3C
O3
c1ccccc1)C(=O)O
c4ccc(C
)o
c2=O)
O[C@@H]1CO
O[C@H]1C
O[C@@H]1C
O)c1ccccc1
O[C@H]1
(-c3cc
oc(-c3cc
c4nc3
=O)O
o2)ccc1
[C@H]1O[C@@H](
c3nc2
=O)C
c1c(-c2ccc(C
c(=O)n(
3)cc12
C(C)CCC
O)ccccc1
c(-c2ccc(C
nc12
n1(
OCc3ccccc3)
)cc2cc
c1ccccc1)O
c1(-c2ccc(C
c3ccc(O)cc3
c2ccc(O)cc12
c12ccc(O)cc1
c1ccc(N(C)C)cc1
)cn2
(C)C)cc
c(-c2cn
c2ncc(-c3cc
(C)C)cc3
c1cc2ncc
)nc2cc1
c1cc(N(C)C
n1cc(-c2cc
)cc2)n
c2cc(O)ccc12
(O)cc
C(=O)(O)c1s
c1(C(=O)O)
c(C(=O)O)
(F)(F)F)cc12
cc(C(F)(F)F)cc
c1c(C)
s2
c2c(C)
sc12
sc2c1
c(C(=O)O)s
c1cc(C(F)(F)F)cc2
c(C)c12
c1(C)
[C@@H](O)
[C@@H](N)C
C(=O)OCc2ccccc2)cc1
[C@H](N)C(=O)N
[C@H](C(=O)OC
[C@H](O)
[C@H](N)
c2ccc(OC)cc2)c1
c2ccc(OC)cc2)cc1
c1ccc(OC)cc1)
c2ccc(OC)cc2
N[C@@H](CO)
CCCO
-c1nc(N
)c(=O)[nH]1
Oc1ccc(C)cc1
O(CCC
)c1ccc(C)cc1
c(C)cc1
(C)ccc2
[nH]c(=O)
c1N
c1cc(C)cc(-
)c(=O)[nH]
OCCC
[nH]c1=O
c1(=O)[nH]
)c1N
C(CC)O
c(-c2nc(N
2)cc1C
c1(-c2nc(N
2)cc(C)
c(N)c1N
O=c1[nH]
Nc1nc(-c2cc
)c(N)n
C(=O)N(C1
CCN(C
c3cc(C
4CC4)
c(-c4ccc(F)cc
4F)
c(F)c3
OC)CC1
c2cc(C3CC3)
c(F)cc3F)
c(F)c2
c(CCC
c(C(=O)O)cc2
c1cc(F)ccc1-
2CCC(N3CC
c4nc(C
c(C(=O)O)cc
c(OC)c1F
c2cc(C(=O)O)
C1CCN(C
C1(N2CC
c(C(=O)O)cc3
c1cc(CN2CCC(N
)c(F)
c1ccc(F)cc1F
c1(OC)c(C
N2CCC(N3CC
4C3
(C2CC2)
c2ccc(F)cc2
F)c1F
3CCC(N4CC
5C
4=O)CC3
F)CC1
cc2c(
)CCN(C
1CCN(C
)C2=O
c2ccc(F)cc2F)c1
c1(CCC
C1CC(N2CC
CCN1C
c1cc(C2CC2)
c2ccc(F)cc2F)
c(-c2c(C
)cc(CN
)c(OC)c2
c1(F)
c(OC)c(C
2)cc(C
2CC2)c1
c1cc2c(nc1
c1ccc(-c2c(C
c1ccc(-n2cc
c3cc(Cl)ccc3
)n2)cc1
c(C)c(C)c2
)ccc(NC(=O)
)n2)ccc1
c1ccn(-c2cc
)n1)
c1cc(Cl)ccc1[N+](=O)[O-]
)nn1
c(C)c(C)c1
n(-c3cc
c(C)c(C)
c3)n
(Cl)ccc1
c3)n2)c1
c1(-n2cc
)n2)cc
c1c(-n2cc
c(C)c1C
(C)c1C
n1c(NC(=O)
c1cc(C)c(C)cc1
-n1cc
c1(C)cc(-
COc1cc2c(cc1
)cc2CC1
CC(C
c1cc2c(cc1OC
F)CC
N1(C(C
)c(OC)cc1
CCN(C(C
c1([N+](=O)[O-]
)cc2c(cc1
c1c2c(cc
)c([N+](=O)[O-])cc1
)c(OC)cc2
)c([N+](=O)[O-])cc2
O(C)c1cc2c(cc1
(CF)
c1cn2
c3c(cc(C
c1=O)
c2cc(C
c(C(=O)OCC)cn1
c23
c(=O)c(C(=O)OCC)cn
3)C1
c12cc(C
3)CCC2
)cn3
(C(=O)OCC)c(=O)
c32
c1cc2c3c(c1
c(C(=O)OCC)cn
3CCC
CCC3
c(C(=O)OCC)cn2
CC(C)(C)OC(=O)NCC
NCC#C
2)C(C)(C)C
c1n(
(C(=O)OCC)c2
c2ccc(OCc3ccccc3)cc2
c3ccc(F)c(F)c3
)c(C(C)C
c1cc(CNC(=O)
c2c(C(C)C
c3cc(OC
c(F)c(F)c4
c1(F)ccc(C
3)cc1F
C(c1ccccc1)n1
c(C(C)C)
c2ccc(OCc3ccccc3
c3ccccc3)c2c1
c1ccc(Cn2
c(F)c(F)
c3ccc(OCc4ccccc4)cc3
c(C(C)C
c2cc(OCc3ccccc3
c1c(C(C)C
)c(C(C)C)n
2Cc1ccccc1
c1c(CNC(=O)
c(F)c1F
c1ccc2
c(OCc3ccccc3
c2ccc(F)c(F)c2
c1cccs1
C(=O)(O)CNC(=O)
N(CC(=O)O)
C(=O)c1cccs1
cs1
c1ccsc1
s1cccc1
c1nnn[nH]1
c2nnn[nH]
2)cccc
c1ccc([N+](=O)[O-]
C(=O)Nc1n
nn[nH]1
c2nnn
[nH]2)
c(O)
c(O)c1
c1([N+](=O)[O-])cccc
2)c1O
c2cccc([N+](=O)[O-])c2
n[nH]1
n1nn
O)n1
nc1NC(=O)
c1ccc(N(C
c3c(OCc4ccccc4
)cccc3
c1ccc(COc2ccc(C
C3CCC
c4c(OC
)cccc4
c3ccc(C(C)C)cc3
)cc2OC
c1cc(N(C
2)ccc1
CCCC3
)c2)
c2ccc(C(C)C
)CCCC2
)c1ccc(C(C)C)cc1
c1(OCc2ccccc2)ccc(C
C2CCC
CCCC2
)cc(OCc2ccccc2)c1
c1cc(C(C)C)ccc1
c2c(OCc3ccccc3
)cccc21
c1(COc2ccc(C
c2ccccc2)ccccc1
c1(C(C)C
)cc2)cc
)cccc2
C(C(=O)
C(N)=O)cc1
C(N)C
C(CN)
c1(CCN
C(N)=O)
c1cc(CCN
C(N)=O)cc
c(CCN
O(c1ccc(C
CN)cc1
)c1ncccc1
c2ccc(CCN
(C(N)=O)
c1cnc(O
c(C(N)=O)c1
c1(C(N)=O)cc
)c1cccnc1
=N
C#N)
c1ccc(C#N
c2cc(C(F)(F)F)ccc2
)ccc(C(F)(F)F)cc1
)N(C(C)=O)
N(N
)C(C)=O
c(C#N)c1
C#N)C
c(C#N)c(N
c1cc(C#N)c(N
(C)=O)cc1
CCc1n
(C)O)
nc2n1
c2cc(-
nnn3
(c3ccccc3)c3ccccc3
n1c(CC
c(C)cc
nc2-
c2ccc3c(c2)CC
c(CC)nc3
(c2ccccc2)c2ccccc2)c1
c1ccc2c(c1)CC
nc21
C(C)(O)C
c(CC)n
[C@H]3CC
c4cc(-
c5nn
nn5
c5ccccc5)(c5ccccc5)
nc1-c1ccccc1
C(c1cc(C)
n1)C
(C)O
c1nc(CC
n2C(c2ccccc2)(c2ccccc2)
c(-c2ccc3c(c2
c3c(c2)CC
nnn1
[C@H]2CC
c3cc(-c4ccccc4
c4nn
nn4
c4ccccc4)ccc3
c2nc(C
(C)c12
CC(O)C
C)n
O)cc2
[C@H]1(
C1C[C@H](
c2ccc(-c3ccccc3-
c(-c2ccccc2
nc32)cc1
C=CCN
c1nc(OC
c(Cl
)c(=O)n1
ccc1C
CC=C
)nc(OC
c(Cl)c1
c(C)c1-
)n(-c2cc
(C(=O)O)cc
)c1=O
c1c(Cl)c(OC
)c(=O)c2
c(F)cc1F
n1c(OC
c2C)c1
NCC=C
c1cc(CO
)c(F)cc1F
c1(F)cc(F)ccc1
)c(=O)c1
(C(=O)O)ccc2
C)c(N
c(-n2
c3ccc(F)cc3F)
c(Cl)c2
=O)c1
Fc1cc(F)ccc1
N(CC=C
CN1C(=O)
c1ccc2[nH]
cnc2c1
N1CCC
c3ccc(C(=O)O)cc3
[C@@H]21
[C@H]1CCCN
c3ccc4[nH]
[C@H]1C2
c(C(=O)N3CCC
[C@@H]4
c[nH]2
c1cc(C(=O)O)
c2ccc3[nH]
c2)
c3cc(C(=O)O)ccc3
[C@@H]12
c2cc(C(=O)O)ccc2
3)ccc12
c12ccc(C(=O)O)cc1
c4ccc(C(=O)O)cc
4C
cnc12
c[nH]c12
C1C[C@@H]2
c1c(F)cc(C
c2c(F)cc
F)ccccc1
=O)cc1F
F)c1
c(F)cc
)c(F)cc
c1(F)cc(C
=O)cc(F)c1
c1cc(C=O)cc
c1c(C=O)cc
c1(C=O)cc
c1ccc(-c2ccccc2)cc1
C(C)(=O)O
(C)=O)cc
c(-c2ccccc2)cc1
c1cc(-c2ccccc2
(C)=O
(C)=O)ccc1
c1(-c2ccccc2)cc
(C)=O)cc2
c1ccc(OC(C)=O)cc1
c1ccc(-c2ccc(OC
cc2)cc1
CSc1n
c(-c4ccccc4
O)cc3
)c(Cl)cc2
c3cc2
Cl)ccc1
Cl)cc1
O)ccc1
[nH]c2cc1
c(-c3ccccc3
c1c(Cl)
[nH]c12
c(-c3cc4
c4cc3
Cl)cc2)
c1cc2[nH]
c(S
nc2cc1
c12cc(-c3cc
Cl)cc2
O)cc2)
c(Cl)cc2
C(S
(Cl)
c1cccc(O)
c1(O)ccccc1
C[C@@H]1
CN2
c3c(cc
5CCNCC
c4c3
[C@H]2
[C@H](C)O1
2C
c1cc3
4CCNCC
4)no
[C@@H](C)O
[C@@H](C)
c1c2c(cc3
4CCNCC4)n
oc1
C(=O)NC1=O)
[C@H](C)O[C@H](C)C
NC(=O)C2
c3cc4
N3C
c3c(F)
3)CC2
C(=O)NC2=O)
c12cc3c(
onc2
N1CCNCC1
)N1C
3)C(=O)N
C(=O)NC1=O
oc3
C(=O)C2
2)C1=O
c2cc3c(
c2c(F)
N3
c2cc3
N2C
C(=O)NC2=O
[C@@H]1(C)C
CC21
C12(C
S(=O)(=O)c2ccc(C)cc
(S(=O)(=O)
ncccc12
O=S(=O)(c1ccccc1
(CC#N)
c(C(=O)OC)
c12cccn
(CC#N)C
c2c(C(=O)OC
c2ccccc2)ccc1
n1cccc2
S(=O)(=O)c3ccc(C)cc3
)N(C
c2cccnc2
S(=O)(=O)(
)N(CC
#N)C
c1ccccc1S(=O)(=O)
n1c(CN
n1(S(=O)(=O)
O=S(=O)(c1ccc(C)cc1
C(=O)(OC)c1
N#
CC(C)OC(=O)
c(Cl)nc1
(C)C)s
c(Cl)n
C(=O)OC(C)C
c1(Cl)n
c(C(F)(F)F)
(C)C)s1
Clc1n
c(Cl)s
c1(C(F)(F)F)
nc(Cl)
c1nc(Cl)
n2ccnc2
)c[nH]
C(F)(F)
(-n3
n4ccnc4
(F)F
n3ccnc3
)c2=O)cc1
C(F)(F)C1
C1(F)(F)
C1CC(F)(F)
)c2=O)
C1N(c2cc
2CCC(F)(F)
n1[nH]
C3)n
2)c1=O
c1(-n2
n(-
C(F)(F)C
cn3)c2
FC1(F)
c1cn(-
=O)cn1
[nH]1cc(-
n1ccnc1
c2ccccc2C2
SCC1
(CCN
N2CCC3
SC2
=C(O
CCCO1
C1CCOC1
CCC2(CC1
SC1
C(=O)C1=O
=C(OC
(CC4
C2=O
CN(CC
3CCN(C
)CC3)
c1ccccc1C(=O)
SCC3
4)CC3)
C1COC(C
C2=O)C1
c1ccc2c(c1)C(=O)
2(C
C(C1
N1CCC2(CC1
C1CC2(CCN1
[C@@H](F)
C2)c1
(C)c2
[C@@H](F)C1
c1nc(Cl)cc
)C[C@@H]1
[C@H](F)
n1c(Cl)cc
c1(Cl)cc(C)
c([N+](=O)[O-])c(N
C2)n1
c1c(Cl)n
(Cl
)c(C)cc
[N+](=O)([O-])c1
O=[N+]([O-])c1
COc1c(OC
(F)F)cc
c2cccc3c2CCC3
c1ccc(S(C)(=O)=O)cc1
(F)F)
c2ccc(S(C)(=O)=O)cc
c2c(-c3cccc
4c3
CCC4
c(OC(F)F)
c2ccc(S(C)(=O)=O)cc2)
C(=O)CC2
FC(F)
Oc1ccc(-
c2OC
S(C)(=O)=O)cc1
c(OC(F)F)c1
S(C)(=O)=O
O=C1CC
c1ccc(OC(F)F)
c(OC)c1OC
c(OC)c3
c3ccc(S(C)(=O)=O)cc3
CCC2=O
c1(S(C)(=O)=O)cc
c2cccc(-c3cc
)c21
(C)CC3
CN(C(=O)OC(C)(C)C)CC2
CN(C(=O)OC(C)(C)C)CC
c3c(Br)cc
c3c(C)cc
c32)
CCN1C(=O)OC(C)(C)C
(C)CC2
(Br)c3
(C(=O)OC(C)(C)C)CC
c3c1
CCN(C(=O)OC(C)(C)C)CC
CN2C
O(C(=O)N1CC
c2c(Br)cc
N(C)CC
CC(C)(C)OC(=O)N1CC
c31
)N(C)C2
c(C)c2
)CCN(C(=O)OC(C)(C)C)CC
(Br)c2
O=C(OC(C)(C)C)N1CC
C(C)(C)(C)OC(=O)N1CC
C1CN(C(=O)OC(C)(C)C)CC
c4cc(C
=CCN(
S(C)(=O)=O)CC
)ncc4
)cc2c(
[C@@H](C1
c3ncc
(CC)cn
C1CN(c2ncc
)cn2)CCC1
3)ncc2
C1CCN(
c2ncc(CC
)cn2)CC1
4)ncc3
(CC)cn1
C1CC(c2cc
3c(
O[C@@H](C
2CCN(
c4ncc
4)CC2)
C3)
=CCN1
S(C)(=O)=O)CC1
CCN(c2ncc
c(C3
S(C)(=O)=O)CC3
)cc1C
[C@H](C1
c1cc2c(cn1
)cnc(N
N1CC=C(
c2cc3c(cn2)
COc1ccccc1
n(-c3ccccc3)c2
N)CC1
N1(c2ccccc2
n2nc(C
)c(CN
3CCN(c4ccccc4
OC)CC
c1c(C2CC2)
nn(-
N)
N1CCN(c2ccccc2OC)CC1
c3ccccc3OC
c(N)n1
C1CN(c2ccccc2
c1ccccc1OC
c3c(C
4CC4)n
c1(OC)ccccc1
c1cccc(OC)c1
c1c(CN
c(C2CC2)
nn1-c1ccccc1
c1nn(-
c(N)c1
)CC2)ccccc1
n1(-
c2ccccc2)n
c1(C2CC2)
C1(c2n
n(-c3ccccc3
)c(N)c2
2CCN(c3ccccc3
)nc2)cc1
c1ccc(Oc2ccc(N
C(C)=O)cc2)
NC(C)=O
c1ccc(NC(C)=O)cc1
c2ccc(NC(C)=O)
)ccc1[N+](=O)[O-]
c1cc(Oc2ccc(N
c(NC(C)=O)
c([N+](=O)[O-]
c1(NC(C)=O)cc
Nc1ccc(O
c1cc(NC(C)=O)
ccc1O
O=C(C)N
Oc1ccc(N
C2=N
[C@](C)
(c3cc
CO2)
c2ccc(OC)cc2)cc
c1ccc(OC)c(N
c2ccc(F)
[C@@]3
(C)N=C(N
c4ccc(OC)cc4
)OC
(c2cc(N
)ccc2F)
=C1N
c1ccccc1C(N
CO1
OC[C@@H]1
(c1ccccc1)
c1ccc(F)c(
[C@@]2(C)N=C(N
(c3ccc(OC)cc3
[C@]1(C)
c2ccccc2OC
F)cc
c3ccccc3)N
(C)C)C(=O)
[C@H](c3cc
c(OC)cc3
C1(c2ccccc2)
[C@H](c2ccc(OC)cc2)
c1([C@H]2
C(CN(C)C)
2CCN(C)C
C(CN1C(=O)
=C(c2ccccc2)
c1(OC)ccc(
O[C@@H]1
(CCN(C)C)
[C@@H]1(O)
CCCC(N
C(CCC)
N1CCCC
C1CCCN(C
CN(CCCC
)CN(C
C2CC
C(CC)C
)C1CC
C1C(N
C)CC
CN1CCCC
3)c(C)c2
2)c1C
Nc1ccc(-
C)C
c(-n2ccnc2
(CCCC)CCCC
OB(O)
c2cc(O
c3cccc(CN
4)c3
(C(=O)OCC)C1
c2cccc(O
c3ccc4c(
B(O)OC
CC(=O)OCC)c2
)CCN(C(=O)OC(C)(C)C)CC1
CC(=O)OCC
c2ccc3c(c2)
B(O)
CC(=O)OCC)c1
c1ccc(Oc2cc
c3c(c2)
CN1CCN(C(=O)OC(C)(C)C)CC1
CC(C)(C)OC(=O)N1CCN(C
c1c(O
3CCN(C(=O)OC(C)(C)C)CC3)c2
2CC(=O)OCC
2CCN(C(=O)OC(C)(C)C)CC2)cc
c1cccc(CN
c12cc(O
C(CC(=O)OCC
B2O
B1
C(=O)OCC)
2CCN(C(=O)OC(C)(C)C)CC2)c1
)CCN1C(=O)OC(C)(C)C
c12ccc(O
COc1ccc(-
c2[nH]cnc2
C)C(=O)N
c12c(cc
c1ccc(OC)cc1OC
cnc1C
c(OC)cc2
C)C(=O)N2
c1cc2c(
c(-c3ccc(OC)cc3
c1c(F)ccc2c1
c[nH]c1
OC)c2
c(F)
/C(=C\
C)c2
c1cc(OC)cc(OC)c1
c1(-c2c(F)cc
c(OC)cc1OC
c3ccc(F)
c(OC)cc4
OC)c3
C(=C1
)\
c1nc(C)
c1c(OC)cc
c(-c2c(F)cc
c1(F)ccc2c(c1
c1cc2c(cc
c3nnc(C)
c1(C)nn
c2ccc3c(cc
n3C
n1nc(C)
Cn1
c(C)cc2
c(C)nn2
c1(Cn2
c(C)cc3
c2nnc(C)
c(C)n2
c(cc
n2c(C)n
n23)c1
c1c(C)n(C
c2ccc3n
C(c1ccccn1
CC(C)(C)OC(=O)N1CCC
O[Si](C)(C)C(C)(C)C
[Si](C)(C)
CN2C(=O)OC(C)(C)C
[C@H](CO
N(C(=O)OC(C)(C)C)C1
C[Si](C)
[C@H]2CCCN2
C(=O)OC(C)(C)C)c1
[C@H]1CCCN1C(=O)OC(C)(C)C
CC(C)(C)[Si](C)(C)
[Si](C)(C)C(C)(C)C
COc1cccc(C
(CO
)n2)CC
CN1C(=O)OC(C)(C)C
CO[Si](C)(C)C(C)(C)C
[C@H]1CCCN1
2CCOCC2)CC1
c2cccc3ccccc2
2CCN(CCN
3CCOCC
[C@](C)(C
c2ccccc2OC)
C1COCCN1
)[C@H](
N1CCN(C(=O)
)N1CCOCC1
c3cccc4ccccc34
4CCOCC
c1ccc(OC)c(
O(C)c1ccccc1
3CCOCC3)CC2)
CCN1CCOCC1
c2cccc(
3)c2c1
c3ncn
c1ccc2n
cnc(N
c3ccc(Oc4cc
c(C)nc4
)c(C)c3
O[C@@H](C)
Nc1ccc(Oc2cc
c2)c(C)c1
c3cccc(O
[C@H](C)O
ncnc(Nc3cc
c2ccc(Oc3cc
)cccc2n1
Nc1ncn
c1cc(C)ncc1
3)cc1C
c1(C)cc(N
c1ccc(C)nc1
[C@@H](C)C(=O)N
)ncn2
ncnc2N
Cc1cc(N
)cnc1C
CC(C)=C
c1ccc2c(c1)OCO2
c1(C=C
c2c(c1)OCO2
OCO2
=C(C)C
)cc2c1OCO2
c(C=C
O1CO
C1Oc2ccc(C
)cc2O1
CC(C)(C)OC(=O)N1CCC(C
c2ccc(C(=O)OC
C(CO
c1ccc(C(=O)OC
)C1CCN(C(=O)OC(C)(C)C)CC1
C(CCO
C3CCN(C(=O)OC(C)(C)C)CC
CC1CCN(C(=O)OC(C)(C)C)CC1
c2co
[C@H](C)CCCC
C(=O)OC(C)(C)C)c2
c2ccc(CC)cc2)
c2c(O
)ncnc12
cc(-c3cc
c(CC)cc3
C(CCC
CC(=O)OC(C)(C)C
)cc3)
O[C@H](C)
c12ncn
c1ccc(CC
c1ccc(CC)cc1
c1cncc(F)c1
c1ccc2cc
c3cncc
(F)c3
)c(=O)c2c1
c(C(F)(F)F)cc2
c(=O)n1-
c(=O)n(-
c1ccn(-
c1cncc(-
)c(=O)c12
c2cncc(F)c2
c1ncc(F)cc1
c1(F)cn
c(Cl)nc1-
nc1-c1n
sc1C(=O)OCC
c1nnc(-
c2nc(Cl)
sc2
C(=O)OCC)n1
C(=O)OCC)n
)s
)c1s
co2)c1
co2)
c(C(=O)OCC)s1
c2cccc(OCC
CCC(=O)OCC
)cc(-c2cc
S(=O)(=O)CCC
C(=O)OCC)c1
CCCCCO
sc3
)cc(S(=O)(=O)
)c2)cccc1
CCCCCCO
CCC)c1
c1cccc(OCC
C(CC)
)c1)
(OCCCCCC
c3cccc(OCC
CCOC(=O)CC
O(CC)C(=O)CC
CCC)cc1
[C@@H]1CN
2CCCCC2)
c2ccc([N+](=O)[O-])cc2)C1
3CCCCC3)
c3ccc([N+](=O)[O-])cc3
)C2)c1
[C@@H]1(C
c2ccccc2)C
C1CCCCC1)
c1cc([N+](=O)[O-])ccc1
OC(=O)N
)C2)ccccc1
C1CCC(
[C@@H]2CCN
c3ccccc3)C
c2ccc([N+](=O)[O-])cc2)CC1
(=O)N
c3ccccc3)CC
)ccc([N+](=O)[O-])cc1
c1ccc([N+](=O)[O-])cc1)
C1[C@@H](N
c2ccc([N+](=O)[O-])cc2)
C1C[C@@H](C
C1CCCC(
c1([N+](=O)[O-])ccc(OC
(C(=O)OCc2ccccc2)C
[C@@H](OC
(CC)CC)
[C@@H](NC(C)=O)
[C@H](N=[N+]=[N-])
[C@@H]1O
(CC)O
(C(=O)OCC)
[C@@H](OS(C)(=O)=O)
=[N+]=[N-])
[C@H](OS(C)(=O)=O)
[C@H]1OC
[N+](=[N-])=N
)[C@H]1
C(=O)(OCC)C1
)C=C
=[N+]=[N-]
[N-]=[N+]=N
(OS(C)(=O)=O)
CCC(CC)
c2ccc(Br)cc2)cc1
c2ccc(NC
)c([N+](=O)[O-])c1
c1ccc(Br)cc1)
c2ccc(Br)cc2)cc
c3cccc(C)c3
c3ccccc3)cc2
c1cccc
c1-c1ccccc1
C(C)=O)c1
c2c(C)cccc2
-c3ccccc3
c3ccccc3)cc1
c1(C)cccc
c2cccc(C)
C1C(C)
c3ccccc3)ccc2
c1cccc(C)c1-
c3ccc(NC(=O)
(C)c4
NCCO
C(CN)O
O(CCN
c1(OCCN
oc2
OCCN
c1cc(OCCN
c2)cc
N)cc1
c2ccc(OCCN
)cc2)cn1
ncc1-
C=C(
cc1[N+](=O)[O-]
C(C)OC(
(=C)OCC
C(=C)OCC
)c1[N+](=O)[O-]
c1cccc(-c2ccc(C
C3SC(=O)NC3
c2ccc(-c3cccc
C2SC(=O)NC2=O)cc1
c1cc(CC2
SC(=O)N
C2=O)ccc1
c1ccc(-c2cccc(C
3)c2)cc1
c1(CC2
C2=O)cc
c(-c2cccc(C
2)cc(-
c(C(=O)N(C)C
SC(=O)NC
4=O)cc3
)c2)o1
SC(=O)NC1=O
3)c2)ccc1
no2)cc1
c1ccc(-c2ccc(C
=O)cc2)cc1
)on1
)N(C)C(=O)
N1CCN(
[C@@H](c3cc
[C@@H]2CC[C@@H](N
)CC3)CC2)
C)CC2)
c1cc(C)cc(C)c1
c(C)cc1C
[C@H](c2cc
)CC2)CC
C)CC1
[C@@H]3CC
c4ccc(C)cc
C1C[C@@H](N
c1ccc(C)cc1C
CC[C@H]1
c1sc(N
)nc1-
c1cccc(C#N)c1
c2cccc(C#N)c2
)sc2
cc(C#N)c1
c1nc(N)sc1
c2nc(N)sc2
c1ccc(-c2nc(N
)cccc(-
c1cccc(-c2nc(N
c1c(C#N)cccc1
)sc(N
sc(N
s1c(N)n
c2cccc(C#N
n1c(N)s
)CC[C@H]1
C(=O)(CN
)N1
(C#C
C(#C)
[C@@H](C#N
C1C[C@H](C
(C#N)CC
)C1CCCC1
CC(=O)N2
#N)C1
S(=O)(=O)c2ccccc2)c1
c1cc(C)cc
(C)cc
S(=O)(=O)c3ccccc3
O=S(=O)(O
2CCN(C(=O)OC(C)(C)C)CC2)cc1
c1(S(=O)(=O)
[C@H](CC
O=C(O
[C@H](C)CC
[C@H](NC(=O)OC(C)(C)C)C(=O)O
(C(C)C)CC
[C@@H](CC
)NC(=O)OC(C)(C)C)
(OC(=O)
[C@@H](C(C)C)
O[Si](C)(C)C(C)(C)C)
[Si](C)(C)C(C)(C)C)
[C@@H](OC(=O)
C(C)(C)(C)[Si](C)(C)
[C@@H]1CC[C@@H](C
COC(=O)C
c(CO)
C(=O)OC)c1
c1cc(CO)
C(=O)OC)cc1
OCc1ccc(F)cc1
C(C(=O)OC)
c1(CC(=O)OC
c1(CO)cc
Oc2ccc(C
c(CO)c1
)c1ccc(C
C(Oc1ccc(C
CO)
c1cc(COc2ccc(C
C(=O)OC)c2
O(C)C(=O)C
OCc1ccc(OC
c1cc(O)
oc(=O)
c1c(O)cccc1
C3=O
O=c1o
c3c(O)cc
3)C(=O)
c1cccc(O)c1
c1(=O)o
(O)c1
c2c(O)cccc2
O)cccc1
c3cc(C)cc
c2cccc(O)
Oc1cccc2c1
c2cccc(O)c2
(O)c3
o1c2c(
O)C(=O)
c(=O)o
c3c(c2c1
Oc1cc(C)
c3ccc(N)cc3
c(C)c(C(=O)OCC
c12ccc(N)cc1
c(C(=O)OCC)c(C)
c1cc(N)cc2
)c(C)c1
c1cc(N)ccc1
c12cc(N)ccc1
Nc1ccc2[nH]
c2ccc(N)cc2
)ncc12
)N1CC
2CC2
(c2ccc(Cl)cc2)
(c3ccc(Cl)cc3
2CC3CC
C1N(C(=O)
CC12
2CN(C(=O)
cc(C(=O)N
(c1ccc(Cl)cc1
)C3)cc1
Clc1ccc(C2
cc(F)c1
N1CCN(c2ncc
c3ccc(S
)cc23)CC1
c2ccc(S
c1ccccc1S
c1ccc(S
c3ccnc(N
(C)(C)C)c1
c2)ccccc1
c1cc(S
)cc2c(N
ccc12
c2cc(S
c1c(S
c2ccnc(N
3)c12
c1ccc(C(C)(C)C
c1cccc(S
COc1cc2
ncnc(N
c(Cl)c(C(F)(F)F)
c5)cc4
s3)
c2cc1OC
c1ccc(Cl)c(C(F)(F)F)c1
c4cc(OC)c(OC)cc3
4)s
c3cc(OC)c(OC)cc2
3)s
c(Cl)c(C(F)(F)F)c3
c1(OC)cc2
c1cc2c(N
s3)n
c1c(OC)c(OC)cc2
O(C)c1cc2
c4)cc3
c2cc(OC)c(OC)cc2n1
FC(F)(F)c1cc(N
C(=O)Nc2cc
c4ncn
c5cc(OC)c(OC
5)s
c1(Nc2n
c2cc(OC)c(OC)cc12
c12cc(N
c3cc(OC)c(OC
c1(C(F)(F)F)cc(N
c(Cl)c(C(F)(F)F)c1
)sc3
)cc(C(F)(F)F)c1
c3nc(NC(=O)C4CC4)cn3
FC(F)(F)c1cc(C(=O)N
c3ccc4
nc(NC(=O)C
5CC5)cn
n3)c2
nc(O
c3cccc(NC(=O)
c4cc(C(F)(F)F)cc
cc(NC(=O)C
c1cccc(NC(=O)
c3cc(C(F)(F)F)cc(C(F)(F)F)c3
)cc(C(F)(F)F)cc(C(F)(F)F)c1
c2cc(C(F)(F)F)cc(C(F)(F)F)c2
c2nc(NC(=O)C
)cn2n1
c2cc(C(F)(F)F)cc(C(F)(F)F)c2)c1
4n3
n1cc(NC(=O)
c1(NC(=O)C
c2cccc(NC(=O)
)c2)n
(NC(=O)C
c2cccn
c2n(-
c2cccc(N)c2)c1
Nc1cccc(-
n2c(=O)
c1(N)cccc
c1ccc(N)cc1
c1(-n2c(=O)
c1c(C)n
)c2ncccc12
c1n(-
c1ccnc2
c(=O)n2-
)nc(C)
c3cccc(N)c3
)c2n1
c3ccccc3)C(=O)
)C(=O)O)cc1
c2cc(S(=O)(=O)N
)C(=O)O)cc
c2ccccc2)C(=O)
O)cc2c1
[C@H](NS(=O)(=O)
C(=O)O)c1ccccc1
)S
c2ccccc2O
c1(C=O)
c2ccncc2
c1C=O
cc(C=O)
c2cnccc12
c12ccncc1
c(C=O)
cs2
csc12
c1cc2s
c2cn1
scc2
C=O
c2ccc(Cl)cc2)CC1
C(c1ccc(Cl)cc1
C(=O)CC1
2)ccc(Cl)cc1
CN1CC
c1cc(CN2CC
2CCC(=O)CC
Clc1ccc(C
C(=O)CC2)cc1
c2ccc(Cl)cc2)
CCC1=O
c2c(c1)CC
5CCOCC5
n3)
nc(CN
[C@@H]4CC
c5cccnc5
)cn12
4CCC
[C@@H]5CC
[C@@H]5
3)CCO1
3CCOCC3
c2cn3
3)CCOCC1
c3ncccc
c2c1CC
c12cccc(N
3CCOCC3)n1
c4cccnc4
c1cc(N2CCOCC2)
cc(CN
[C@@H]2N(C
n2)C1
[C@H]1[C@H](C
[C@H]2[C@@H]1
[C@H]12CC
[C@H]12
COc1ccc(CN
(Cl)cc
(Cl)c3
2COC
c2ccc([N+](=O)[O-])cc2)cc1
c(OC)c(OC)c1
O=[N+]([O-])c1ccc(C
OCC2
(c3cc(Cl)cc(Cl)c3
c2ccc(OC)c(OC)c2)cc1
c3ccc(OC)c(OC)c3
)C(C
c2ccc([N+](=O)[O-])cc2
c1([N+](=O)[O-])ccc(C
COc1cc(CN
(Cl)cc(Cl)c2
)CCN1C
(c2cc(Cl)cc(Cl)c2
[N+](=O)([O-])c1ccc(C
c3cccc4c3
c2ccc(Cl)cc21
(Cl)ccc3
4)CC2)cc
c3cc(Cl)ccc2
3)CCC1
n(CCN
c2c(C(=O)N
c4cccc5
5)CC3
)OCC2
c12c(cccc1
)CCO2
n1(CCN
c2cc(Cl
)ccc12)
c1ccc2c(c1)CCN2
c1cc2c(cc1O)
c1cc(O)cc2c1
NCC2
c12cc(O)ccc1
c1c(O)ccc2c1
c2ccc(O)cc21
c2cc(O)ccc2
c2cc(O)ccc21
c2ccccc2N(C
CCN(C)C)
C(CCC(=O)OCC
)C1C
CC1C
C(=O)(CCC
c1ccc2c(c1)N(C
CCCN1
c2ccccc2CC
C1(CCC
C(=O)OCC)C
C1CCCC
(=O)OCC
2CCCC
CN(C)CC
c1csc(N
2C(=O)
=S
c(C#N
)cs
2)C(=O)
(c2n
C1Cc1ccccc1
csc(N
C(c1ccccc1
c(C#N)
=S)N
c1ccc(CC2
(c3n
3)C2
C(=S
c1(C#N)
c1ccccc1CC1
n1c(C#N
c1cccc(CC2
c1(N2C(=O)
c1ccccc1[N+](=O)[O-]
c1(C(=O)OC(C)(C)C
c(C(=O)OC(C)(C)C)c1
c1ccc(C(=O)OC(C)(C)C
(C(=O)OC(C)(C)C)c1
c1([N+](=O)[O-])ccccc1
[N+](=O)([O-])c1ccccc1
O=[N+]([O-])c1ccccc1
CN2CC
c3ccn
c4ccccc3
4)CC2)CC1
[C@@H](CCN
3CCC(O
c4ccc(F)cc4F)
2CCC(O
c2ccn
c3ccccc23)CC1
c5ccc(F)cc5
)ccnc12
c1cnc2ccccc2c1
C1(O
c3ccccc23)CC
CCN1CC
c1ccc(F)cc1F)
C1CCN(CC
c4ccccc34
CCC1O
c5ccccc4
c1cccc2ncc
N1CCC(O
C1CC(O
CC3)CC1
)ccn2
)cc(C)
)c1cc(C)
c2c(c1)
2CC(=O)O
COc1cc(C)
2CC(=O)
(CCO
c12cc(OCC
c2C1
c2ccccc2F)
)c(Br
c3c(Br
n4
3)c1F
c2nn3
F)nn
c2c(Br
c3ncnn3
c1(Br)c(OC
n2c(-c3ccccc3
c(C)c2c1
3)c(F)c1
)c(Br)c2
nc(-c3ccccc3
Br)n
(C)n1
nc(OC
-c1ccccc1F
n(C)c1
n1(C)n
2C3
SCCS
c2ccc(Cl)cn
C2=C(
S2)
C(OC(=O)N
2CCN(CC)CC2)
c1ccc(Cl)cn1
N1CCN(CC)CC1
Clc1ccc(N
2C(=O)C3
)CC2)nc1
c1(Cl)ccc(N
CCN(CC)CC1
c(Cl)cn2)
2CCN(CC)CC
c(Cl)cn1
C1CS
(OC(=O)N
C1CN(CC)CC
N1C(=O)OC
OC[C@H]1
c1cc(-c2ccccc2)ccc1
c1ccc(-c2ccccc2)cc1)
S(=O)(=O)CC
[C@H]3
C1OCC
c1ccc(-c2ccc(
c(-c3ccccc3)cc2)
)cc2)ccccc1
)ccc1-c1ccccc1
c1ccc(Cl)cc1Cl)
#CC(C)(C)C
(CCOC)
Clc1cc(Cl)ccc1
C(=O)N(CC
c1ccc(Cl)cc1Cl
c1sc(C
(C)(C)C)cc1
OC)C(=O)
C(#CC
(C)(C)C)
(CCOC
c2ccc(Cl)cc2Cl)
c(C(=O)OC)s1
c(Cl)cc1Cl
O=C(OC)c1
sc(C
CC(C)(C)C
c1(Cl)cc(Cl)ccc1
c(C(=O)OC)c1
c2ccc(Cl)cc2Cl
COc1cc
2(C)
CCC2)
nc(C)o
C(COC
c(C)o
(C)CCC
c(Nc3cc
4COC
)[Si](C)(C)C
C1CCC1
c2ccc(C(=O)NC
3COC
OC)n
c2c1c(-
c2cc1-
c3ccc(C(=O)NC
(C)CCC1
(COCC[Si](C)(C)C
5COC
5)cc4
4)c2
c(C)nc12
(-c2cc
c1cc(C(=O)NC
c2nc(OC
c5c4
2)cc1OC
c2cc(-c3cn
5)c3
)c1nc(N
c1ccc(C(=O)NC
3)cc1OC
c2ccc(-c3cn
4)cc12
C#CC
C(CC#C
(CC#C
)CC#C
O=C(OC)C
-c1no
c(OC(C)C)
c(Cl)c2)n1
C(CCC(=O)O)
c(OC(C)C)c(Cl)c3
)n2)c1
)CC(=O)O
c(CC)
c(CC)c1
c2CC
C(C)(C)O
c(-c3cccc
)no2)cc
CC(C)O
(-c2n
OC(C)C
2)cc(Cl)c1
c(OC(C)C)c(Cl)c2
c1c(-c2n
c(OC(C)C)c1
c1cncc(N
2CN(C
4)C
c2ccccc2OC)cc1
CC1CN(C
cc(N
3CC4CC
5)C
C1C2CC3
c2ccccc2OC)c1
4)C3
C12CC3
CN(C1
)CC(C
C12CC3CC
(CN(C
)CN2
C1C2CC3CC(C
3)C2)
OC)cn
c1ncc(N
c1ccc(OC)c(-
c2cncc(N
5)C4
c1c(-c2ccccc2
)cncc1
c1ccc(CNC
C1NC
c1ccc(N(C)C
c2ccc(N(C)C
c1([N+](=O)[O-])cc(C
2CCN(C(=O)OC(C)(C)C)CC2)ccc1
c1c(CNC
c1cc(CNC
c1(N(C)C
c1cc(I
c2ccccn2)c1
c2ccc(I)cc2
)cccc1-
c2ccccn2
(I
c1ccc(-c2ccccn2)cc1
c1ccc(I)cc1
c1c(I
c(I)cc1
c1(-c2cccc(N
c3ccc(I)cc3
c1cccnc1-
[N+](=O)[O-])cc1
)c2)n1
c1(I)ccc(N
CCN1CCN(C
c3cc(C(F)(F)F)ccc3
c3ccccc32)CC1
(N1CCN(C
=O)CC1
OC2=O)
OC(=O)N1
c2ccccc2C1
c4cc(C(F)(F)F)ccc4
C(=O)O1
=O)CC2)
OC1=O
[C@@H](N)
c3ccc(F)cc3)C
CCCN(C(=O)
[C@H]2CN(C(=O)OC(C)(C)C)CC
[C@H]2N
c2ccc(F)cc2)C1
N[C@@H]1
CCN(C(=O)OC(C)(C)C)C
C(=O)N1CCC
C1CN(C(=O)OC(C)(C)C)C
)C2)cc1
C(=O)(OC(C)(C)C)N1CC
N)C
(C(=O)OC)c1
ncccc2
c(-c2ccc(C)cc2)c1
C(CCC)C(=O)OC
(CCC)C(=O)OC)
c(-c3ccc(C)cc3
c2cccnc12
c(-c3cccc4
ncccc3
)ccc(C)cc1
c2cccc(-c3n
c(C)cc2)n1
c1cc(C)ccc1
)c1c(C)n
c(C)cc2)
c(-c3n
4)n3
C(C)CC
c(-c2ccc(C)cc2)
c1ccc(OCCCN
2CCCCC2)cc1
c1c(OCCCN
2CCCCC2
)ccc(C#N)c1
CN1CCCCC1
c1ccc(C#N)c(C(F)(F)F)c1
c1cc(OCCCN
N1(CCC
)c(C(F)(F)F)c2
)ccc1C#N
)ccc(OCC
(OCCCN
)c(C(F)(F)F)cc1
C(COc1ccc(C
N1CCCCC1
CCN1CCCCC1
c1(OCCCN
CN(CCC
)c(C(F)(F)F)
c1nc2ccccc2[nH]1
CCCc2cccnc21
C1N(C
c1ccc2nc(C
c12cccnc1
(C)C)C
C(CC(C)C
N(CCC
[nH]1c(C
c2nc3ccccc3
c(CN(C
c1(CN(C
c2ccccc2[nH]1
3)[nH]c12
C(CN(C
)[nH]2
C(c1n
)N(CCC
(C)C)C1
(F)(F)
Cl)n
Cl)nc2
c2c(C(N)=O)
c(C(N)=O)cc
c1cc(C(N)=O)
O=C(N)
Cl)[nH]
COC(=O)c1ccc(C
CCN2C(=O)
)O[Si](C)(C)C(C)(C)C
C(=O)N2CCC
c2ccc(C(=O)OC)cc2)
O[Si](C)(C)C(C)(C)C)c1
c3ccc(C(=O)OC)cc3
)c2)ccccc1
c1ccc(C(=O)OC)cc1
c1cccc(Oc2ccccc2)c1
O(C(C
)[Si](C)(C)C(C)(C)C
N1C(=O)CC
)ccc1C(=O)OC
C(CCC1
c1ccc(C(=O)OC)cc1)
(OC(C
c1(C(=O)OC)ccc(C
c1cc(C(=O)OC)ccc1
c1c[nH]c2ccccc12)
c1c2c(n
c3ccccc1
3)CCCC2
CCCCCN
)CCCC
c[nH]c2ccccc12
c1c3c(
c12ccccc1c(N
C(CCCCN
c3c4c(
c5cccc
c[nH]c2c1
c1ccc2c(N
nc2c1
)CCCC3
c1cccc2n
c3c(c(N
c4c[nH]
c5ccccc45
CNC(=O)CC
c1c[nH]c2ccccc12
c2c1n
c(C(C)(C)C)n
C(F)(F)CC
n1c(C(C)(C)C
2CCC(F)(F)CC2)
C(F)(F)CC1
c1ccc2c(c1)n
C(=O)OC)CC1
)nc(C(C)(C)C
C(CC(=O)OC
CCC(C
)c(C(C)(C)C
(C(=O)OC)C1
)CCN1C(=O)
cncc2
Cl)CC1
cc(Cl)c1
c1ncnc(N
2CCN(C(=O)OC(C)(C)C)CC
2)c1Cl
c1cncnc1
c1ccccc1C(=O)O
C(=O)(O)c1ccccc1
OC(=O)c1ccccc1
c1ccc(SCC
c(C(=O)O)c1
c1ccc(C(=O)O)
c(SCC
c1cccc(C(=O)O)c1
(CC=C
C(C=C)
C(=C)C
[C@@H](CC=C
C=O)
[C@@H](C)CC
)cc(F)
(F)c(F)cc1
c1c(F)c(F)cc
=C)c1
(C=O)
c1cc(C=O)
(C=O)c1
[C@@H](C(N)=O)
CNCC1
CC(=O)N(
[C@@H](CC)
C1N
[C@H](CC)
3)ccc2c1
c(-c3ccccc3)
o2)cc
c4cc(O)cc
)o2)c1
c3cc(O)cc
c(-c2ccccc2)o1
cc(-c3cn
c2cc1O
)o2)cc1
c(-c3cn
c(O)c2
o2
c1ncc(-c2cc
c3cc(O)ccc3
c2)o1
c1nc(-c2ccccc2)
oc1-
cc2cc
Nc1ccc(C
c3ccccc3)C2)cc1
c2ccccc2)C1
c1ccc(N)cc1)
c2ccc(N)cc2)
c1(N)ccc(C
N[C@H](C
c1nc(-c2ccc(F)cc2)
c2ccccc2c1C
)c1nc(-
c(F)cc3)
c[nH]2)
Fc1ccc(-
[C@H](N)C
4)n2)cc1
4)c[nH]
c1(-c2ccc(F)cc2)
c2c[nH]c3ccccc2
c1cccc2c(C
c1-c1ccc(F)cc1
c2ccc(F)cc2)nc1
2)ccc(F)cc1
2)ccc1F
n1c(-c2ccc(F)cc2)
)(C
c12ccccc1[nH]cc2
c2c(C(=O)
c3cc(OC)c(OC)c(OC)c3
(CC3
(NC(=O)OC(C)(C)C)C
OC(C)(C)OC
c1(OC)c(OC
)cc(C(=O)
c2cn(CC
c3cc(OC)ccc2
COC(C)(C)
)cc(OC)c(OC)c1OC
OC(C)(C)
n1cc(C(=O)
c2cc(OC)c(OC
)c(OC)c2)
c2ccc(OC)cc21
OC(C)(C)OC1
OCC(C
c1c(OC)ccc2
OCC(C)(C)
[C@@H](O[Si](C)(C)C(C)(C)C
oc1C
[C@H](O[Si](C)(C)C(C)(C)C
OS(=O)(=O)
C[Si](C)(O
[C@@H](C(=O)OC
(CCCN
[Si](C)(C)O
[C@H](O[Si](C)(C)C(C)(C)C)
Cc1o
CC(C)(C)[Si](C)(C)O
oc1C)
NC(C)=O)
oc1=O
c2nc(C(=O)NC
c3cc(F)c(N
c1c(F)cc
c3cccc
c1c(C(C)
S(C)(=O)=O)c1
Oc1n
c(NS(C)(=O)=O)
c(F)c2)
coc1
c1cccc(CC)c1
co2)cc1
CS(=O)(=O)N
c1cc(F)c(NS(C)(=O)=O)
c2cccc(CC
c2cccc
(CC)c1
S(C)(=O)(=O)N
)cc(O
O=S(C)(=O)N
COc1cc(OC
oc2c1
c(OC)cc(OC
c1c2
CCN(CCN
2CCCCC2)C1
c1c(OC)cc(OC)cc1
c3c(OC
)cc(OC)cc3
c4cc(OC
)cc(OC)c3
4)C2)
)cc(OC)c2
)cc(OC)c1
o2)
CN(CCN
2CCCCC2)CC1
c2cc(OC)cc(OC)c2
c1cc(OC)cc2
O(C)c1cc(OC
c1c(OC)cc2
(OCC)
(OCC)OCC
)oc2c1
C(OCC)
oc(C
[C@H]1(NC(=O)
2CCC1CC2
)oc12
c1cc2cc(C
C(C)OC
o1c(C
/N=C/
)c1ccccc1C
=C/
c1(C(
c1cccc(C(
c2ccccc2C)c1
/C=N/
C(=N
/
C)c1ccccc1
C)\
c(C(
/C
/C(
c2ccccc2C)
c1ccc(C(
c3ncccc2
c2ncccc12
c2ncccc2c1
[nH]cc2
n2cc(-c3cc
nc4
[nH]ccc3
c2ccc(NC(=O)N
[nH]c2n1
C(c1ccc(OC)cc1
[nH]ccc2
c4ccc(OC
)cc4)nc3
)cc2-
c2ccnc3
c1cc(NC(=O)N
[nH]ccc12
c2cc[nH]c12
c1ccc(NC(=O)N
)cc4)cc3
4)cc2)cc1
c1(NC(=O)N
[nH]1ccc2
3)cn
)cc1)c1ccccc1
c1cccc(NC(=O)N
CCN(CCCC
C1Cc2ccccc2
N(CCCC)CCCC
)ncn1
c1ccc(-c2
2CCc3ccccc3
2C)c1
C(CCC)N
c2cc(C(=O)OC)ccc2
c(C(=O)OC)cc2
C(=O)N2CC
N1CCc2ccccc2C1
c3ccccc3C2)
c2ncnc3cc(OCC
(OCCOC
O(C)CC
OCCOC
Oc1cc2
COCCO
)cc2n1
C(COC)O
c1c(CC
Oc1cccc(C
C(=O)OCc2ccccc2)c1
)C(=O)OCc1ccccc1
c1ccc(CCN
C(=O)OCc2ccccc2
c3nnn[nH]
)NC(=O)OCc1ccccc1
cc(CCN
C(=O)OCc3ccccc3
C(=O)OCc1ccccc1)
c(S(C)(=O)=O)
c2ccn(C)
c1cn(C)nc1
(O[C@@H](C)C
c1ccn(C)n1
c3cc(F)
c(S(C)(=O)=O)cc3
c1c(Oc2cc
[C@@H](C)CO
n(C)n1
c1cc(S(C)(=O)=O)
c3ccn(C)n3
c(S(C)(=O)=O)cc1
c1c(F)
c2)n1
)c1cc(F)
c1ccc(C(O)
C(O)(C
2CC2)CC
C1CC(O)
c1cccc(C(O)
c2ccc(F)cc2)CC1
c2ccc(F)cc2)CCN1
c1cc(C(O)
CN1CCC(C
c1(C(O)
c2ccc(F)cc
C(C1CC1)
)C(O)
COc1ccc2c(c1)CC
NC2
c1cccc(COc2ccc(C
c4cc(OC)ccc4
c3cc(OC)ccc3
c1cc(OC)cc2c1
C(c1ccc(OC
)NCC2
c2cc(OC)ccc2
c2ccc(OCc3ccccc3)cc2)
c1ccccc1COc1ccc(C
c1c(OC)ccc2c1
CCNC2
C1NCC
c2cc(OC)ccc21
c2cc(CN
c2nccnc2
c12cc(CN
c(CN)cc1
c1cc(CN)ccc1
c2c(n1
nc1S
[C@H]1CCC
n2cc(C
[C@H]3CCC
[C@H](N(C)C
c(N4CC
4)cccc3
[C@H]2CCC
[C@H]4
)cn2c1
[C@@H](N)C1
[C@@H](N(C)C
C1[C@H](N
)n1cc(C
nc(C(=O)NC
)s1
C(=O)NC1CC1
sc1N
c1nnc(N
C1(NC(=O)
c2nnc(N
)s2)CC1
C1CC1NC(=O)
C=C(C)
(=C)C
c2)n
NC(=O)OC
C(=C)(C)
c(-n3
)cc1cc
CC(
c1c(-n2
nc(C(C)(C)C)cc2
c2ccc(-n3
c1cc2n
c2cccs2)
sc1C
c1csc(C
C2=O)c1
cc1C
C1(=C
c2cccs
c(N(C)
nc(-c3ccccc3)n
[C@@H](CNC
c4ccccc4)n
3)n2)c1
c1cc(N(C)
c3ccccc3)n2)
c2ccccc2)n1
[C@H](CNC
c3ccccc3)n
N(C)(
c1(N(C)
c2ccccc2)nc1
c(-c5ccccc5
)nc4
3)n2)CC1
cc3c(n2)
N(c2cc
4CCN(C(C)=O)CC
4)n2)
c1ccccc1-c1n
cc2c(n1
C3CCN(C
(C)=O)CC3
CC2)n1
3)n2)
c1nc(-c2ccccc2
2)nc1
Nc1ncc
CC2)nc1
n1cc2c(
c2nc(-c3ccccc3
2CCO
N(c1ncc
)C1CCN(C
N1CCC2(CC1)OCCO2
2(CCN
OC)CC2)
)CCC2(CC1
CN(c3cc
c1cc(OC)c(N
c(-c2ccccc2)n1
Oc2ccccc2
c1(-c2ccccc2)n
c2ccccc2[N+](=O)[O-]
)cs1
)c1cs
c1cccc(-c2nc(C
Oc3ccccc3
)cs2)c1
c2cs
c(-c3ccccc3)n2)
s1cc(C
)nc1-c1ccccc1
c(-c2ccccc2)nc1
c(COc3ccc(C
c5ccccc5)cc4
2)ccc1C
Oc3ccc(C
c3ccc(OC
c4nc(-
c4C
)c(OC)c3
c1c(CO
c2nc(-c3cc
c(C(=O)OC)c3
)oc2C
)c1OC
=O)cc1OC
c(C(=O)OC)c2
)oc1C
(OC)c1OC
c3nn(-
=O)ccc1OC
c1c(-c2nc(C
c1cccc(-n2
C(C)(C)C1
C1(C)(C)C
OC1CC
C1(O)CC
C1Cc2ccccc2C1
c1ccc2c(c1)CCC2
CC1(C)OB(c2cc
3CCC[C@@H]3
3CCCC3)cc2)
c1ccc(B2OC(C)(C)C(C)(C)O2)cc1
N1CCC[C@@H]1
CN1CCCC1
[C@H](CN
C1(C)(C)OB(c2cc
)N1CCCC1
2CCCC2)cc
c(B2OC(C)(C)C(C)(C)O2)cc1
[C@H]1(CN
c2ccc(B3OC(C)(C)C(C)(C)O3)cc2)
c1cc(B2OC(C)(C)C(C)(C)O2)ccc1
c2ccc(B3OC(C)(C)C(C)(C)O
3)cc2)C1
2CCCC2)ccc1
B1OC(C)(C)C(C)(C)O1
OC(C)(C)C(C)(C)O1
C1CCCN1C
CCC[C@@H]1
c2ccc(C(=O)O)cc2
2CC3CC(C
2)CC1C3
Br)C1
C1C2CC3CC1CC(C
2)C3
C(C)(C)Br
Br)C
2C3CC4CC(C3)CC2C
C12CC3CC(C1
)C(N
C12CC3CC(C1)CC(C
C1C2CC3CC1
4)c1
[C@@H](O
c2n[nH]
c4ccc(OCC
COS(C)(=O)=O)
cc4
[C@H](OC(=O)C(C)(C)C)
[C@@H](OC(=O)C(C)(C)C)
O[C@H](C
OCCCO
[C@@H]1[C@@H](C
)C(=O)C(C)(C)C
cc2)
[C@@H]3O[C@H](C
c3ccc(OCC
[C@@H]1O[C@H](C
[C@H](O
[C@H]1(C
C(C)(C)C)
S(C)(=O)
c1cc(=O)[nH]
cc12)
c1cc(Cl)cc(N
c2cc(=O)[nH]
c3c(F)cc
c2cccnc2)c1
c1cccnc1)
c1(F)cccc2
c3cccc(Cl)c3
)cc(=O)
c2[nH]c(=O)
c1ccc(C(=O)
[nH]1c(=O)
