.
<unk>
<sor>
<eor>
<sop>
<eop>
<mask>
<sum_pred>
<sum_react>
<first_pred>
<second_pred>
<third_pred>
<fourth_pred>
<pad>
#
(
)
+
-
/
1
2
3
4
5
6
7
8
9
=
@
B
C
F
H
I
K
L
M
N
O
P
S
Z
[
\
]
b
c
d
e
g
i
l
n
o
p
r
s
t
u
cc
CC
(C
c1
O)
=O)
(=O)
c2
(C)
c(
c1cc
)cc
OC
c2cc
c3
F)
H]
c(C
[C
[C@
C(=O)
(F)
CCC
cn
2)
)cc1
(C)(C)
OC(=O)
c3cc
c1cccc
=C
CCN
c1ccc(
c2cccc
CC1
(N
)n
[C@H]
[C@@
CO
CCCC
c(Cl
[C@@H]
c4
C1
c2ccccc2
(F)(F)
n1
CN
c(N
c1ccccc1
)c1
(C)(C)C
c(-
(C(=O)
(O)
Br
O=C
c1n
N1
F)cc
[n
3)
OCC
c3cccc
[nH]
S(=O)
(-
(CC
Cl
COC(=O)
c2n
S(=O)(=O)
c1ccc(C
[N
(C)C
+]
CC(C)(C)
CCOC(=O)
-]
)C
[N+]
OC(C)(C)C
c2ccc(
cc1
(Cl
2)cc1
c3ccccc3
[O
[O-]
c4cc
NC(=O)
c(C)
CC(=O)
NC
(F)(F)F)
)c2
n2
)CC
CC(C)(C)OC(=O)
(=O)[O-]
2CC
[N+](=O)[O-]
)cc2
=O
C(=O)N
Cc1cc
c2c(
#N
[C@H]1
c1ccc(-
c(=O)
COc1cc
(OC
c1cn
c2ccccc2)
c(C(=O)
[C@@H]1
cc2
CC(C)
)cc2)
C=C
)c(
CCO
)ccc1
c2c1
O=C(O)
(Br
(O
2)c1
)C(=O)
(NC(=O)
F)cc1
3CC
)cn
c4cccc
CCN(
ncc
c3ccc(
N2
(F)(F)F)cc
(N)
3)n
O=
)c3
c(Cl)cc
c5
CCC1
s1
CCN(C(=O)
c12
c2)
CN1
c1ccccc1)
#C
[S
)ccc2
c2ccc(C
(C(F)(F)F)
N1CCC
O)cc
c1ccc(Cl
C2
c2cn
)n1
=N
c2c(c1
2)CC1
c4ccccc4
[Si
c2ccc(Cl
nn
Cc1n
/C=C
c(F)
Cc1
O=C(N
O=C1
CCCN
C[C@H]
c2ncc
cccc
CCN1
[Si]
Cn1
c1cc2
C(F)(F)
c1ccc(C(=O)
C(
O)cc1
CCN(C
cn1
c3c(
N1CC
)N
n3
(C(=O)N
nc1
c1ccc(N
OC(C)(C)C)
S(C)
cs
OC1
(C(=O)O)
S(C)(=O)
)cc3
c(-c3cc
C[C@@H]
(F)cc
CC(C)(C)OC(=O)N
c1ncc
CC(=O)N
CCCCCCCC
c1ccc(OC
CC2
c3n
c(OC
c(Cl)n
(Cl)
[C@H](C
c2ccc(F)cc
c1cc(C
CC2)
(CC(=O)
/C=C/
c2ccc(N
)C1
c1ccc2c(c1
c[nH]
c1ccc(F)cc1
cnc2
OCc1ccccc1
[C@H]2
[C@]
=O)cc
)c(Cl
c1cccc2
c1ccc(Cl)cc1
C=
O1
4CC
c(Br
COc1ccc(C
c1ccc(O
([N+](=O)[O-]
c1cccc(C
(C)C(=O)
(-c2cc
o1
[nH]1
[C@@H]2
[C@@H](C
COC
([O-]
CCN(CC
c(F)cc
N#C
c(C(=O)N
nc(-
C(=O)O
(C)=O)
(C#N
[Si](C)(C)C
CS
c2ccc(OC
3)cc1
(c2ccccc2)
S(=O)(=O)N
2CCC
C1=O
c3ccccc3)
C(F)(F)F)
c(C)cc
CNC(=O)
CN(C(=O)
c2ccccc2)cc1
n(C
CN(
nc2
cnc1
CC1(C)
S(C)(=O)=O)
)nc1
Cc1ccc(
[C@@]
COC(=O)c1cc
nc(N
c(C)c1
Cl)
Br)cc1
[N+]([O-]
O=[N+]([O-]
CCCO
CC1)
c2ccccc21
(C)C)
CN(C
c(C(F)(F)F)
Cc1ccccc1
cnc3
c(C#N
OCCO
n2cc
CCC2
(N)=O)
)c(OC
COc1ccc(
c(C(=O)O)
c21
n1cc
C(F)(F)F
CCNCC
C[C@H]1
CCCCC1
c(NC(=O)
2CCOCC
CCNC(=O)
CC(C)(C)OC(=O)N1CCC
4)n
c1ccc(-c2cc
Nc1n
N#
c(O
(CCC
3CCC
2)n1
(c1ccccc1)
(CN
(CO)
)C2
c2ccccc2)c1
c(N)n
c2ccc(Cl)cc2)
c3cn
c2n1
CCCCC
CN(C)
c1cccc(-
(c2cc
[C@H](C)
c3ccc(F)cc
c1cc(Cl
c(-c2cc
)ccc3
CS(=O)(=O)
cc3
c2cc1
O=[N+]([O-])
)s
CCC(=O)
)c2)
(C)(C)O
COc1cc2
(-c3cc
)cn1
c1C
n(C)
CC(C)(C)OC(=O)N1
=O)cc1
(F)(F)F)cc1
3)cc2
c1-
OC(C)(C)C)CC
)cc3)
SC
c(Cl)c1
[C@H]1CC
c1cc(-
2CCCC
c2[nH]
3)c1
O=C(
2)C1
)cc2)cc1
c(F)c1
2C
c2)cc1
CCOC(=O)C
c1ccc2c(c1)
N=C
(C(=O)OC
[C@H](O)
CC(O)
c2ccc(Br
c3ncc
(OCC
c(O)
N1C(=O)
(CCCC
c1ccc(-c2n
n2)
n4
c2cc(Cl
CCCC1
C[C@@H]1
c1cccc(N
N2CCC
=S
c1=O
c1ccn
c(C(F)(F)F)cc
3)cc2)
(Cl)c1
CCOC
[N+](=O)[O-])cc1
c5cccc
)c(F)
(C(F)(F)F)cc
3CCCC
c(=O)[nH]
C#N
(C(F)(F)F)c1
NC(=O)OC(C)(C)C
O=C(C
C(C)(C)C
co
O=S(=O)
B(O)
[C@@H](O)
cs1
n(-
C#
c1cc(N
c2ccc(-
)c(N
c1cncc
C(=O)OC(C)(C)C
c23)
[C@H](NC(=O)
3C
CC(
N(C
[C@H](
CCOC(=O)C1
3CCOCC
[C@@H](C)
CCNCC1
NC1
CCOC(=O)c1
n1-
CCOCC1
Br)
[Si](C)(C)C(C)(C)C
CCN(C)
c1ccc(Br)cc1
4)
c1cccnc1
2CCCCC
Cn1cc
c2ccccc12
)cc21
