.
<unk>
<sor>
<eor>
<sop>
<eop>
<mask>
<sum_pred>
<sum_react>
<first_pred>
<second_pred>
<third_pred>
<fourth_pred>
<pad>
#
(
)
+
-
/
1
2
3
4
5
6
7
8
9
=
@
B
C
F
H
I
K
L
M
N
O
P
S
Z
[
\
]
b
c
d
e
g
i
l
n
o
p
r
s
t
u
cc
CC
(C
c1
O)
=O)
(=O)
c2
(C)
c(
c1cc
)cc
OC
c2cc
c3
F)
H]
c(C
[C
[C@
C(=O)
(F)
CCC
cn
2)
)cc1
(C)(C)
OC(=O)
c3cc
c1cccc
=C
CCN
c1ccc(
c2cccc
CC1
(N
)n
[C@H]
[C@@
CO
CCCC
c(Cl
[C@@H]
c4
C1
c2ccccc2
(F)(F)
n1
CN
c(N
c1ccccc1
)c1
(C)(C)C
c(-
(C(=O)
(O)
Br
O=C
c1n
N1
F)cc
[n
3)
OCC
c3cccc
[nH]
S(=O)
(-
(CC
Cl
COC(=O)
c2n
S(=O)(=O)
c1ccc(C
[N
(C)C
+]
CC(C)(C)
CCOC(=O)
-]
)C
[N+]
OC(C)(C)C
c2ccc(
cc1
(Cl
2)cc1
c3ccccc3
[O
[O-]
c4cc
NC(=O)
c(C)
CC(=O)
NC
(F)(F)F)
)c2
n2
)CC
CC(C)(C)OC(=O)
(=O)[O-]
2CC
[N+](=O)[O-]
)cc2
=O
C(=O)N
Cc1cc
c2c(
#N
[C@H]1
c1ccc(-
c(=O)
COc1cc
(OC
c1cn
c2ccccc2)
c(C(=O)
[C@@H]1
cc2
CC(C)
)cc2)
C=C
)c(
CCO
)ccc1
c2c1
O=C(O)
(Br
(O
2)c1
)C(=O)
(NC(=O)
F)cc1
3CC
)cn
c4cccc
CCN(
ncc
c3ccc(
N2
(F)(F)F)cc
(N)
3)n
O=
)c3
c(Cl)cc
c5
CCC1
s1
CCN(C(=O)
c12
c2)
CN1
c1ccccc1)
#C
[S
)ccc2
c2ccc(C
(C(F)(F)F)
N1CCC
O)cc
c1ccc(Cl
C2
c2cn
)n1
=N
c2c(c1
2)CC1
c4ccccc4
[Si
c2ccc(Cl
nn
Cc1n
/C=C
c(F)
Cc1
O=C(N
O=C1
CCCN
C[C@H]
c2ncc
cccc
CCN1
[Si]
Cn1
c1cc2
C(F)(F)
c1ccc(C(=O)
C(
O)cc1
CCN(C
cn1
c3c(
N1CC
)N
n3
(C(=O)N
nc1
c1ccc(N
OC(C)(C)C)
S(C)
cs
OC1
(C(=O)O)
S(C)(=O)
)cc3
c(-c3cc
C[C@@H]
(F)cc
CC(C)(C)OC(=O)N
c1ncc
CC(=O)N
CCCCCCCC
c1ccc(OC
CC2
c3n
c(OC
c(Cl)n
(Cl)
[C@H](C
c2ccc(F)cc
c1cc(C
CC2)
(CC(=O)
/C=C/
c2ccc(N
)C1
c1ccc2c(c1
c[nH]
c1ccc(F)cc1
cnc2
OCc1ccccc1
[C@H]2
[C@]
=O)cc
)c(Cl
c1cccc2
c1ccc(Cl)cc1
C=
O1
4CC
c(Br
COc1ccc(C
c1ccc(O
([N+](=O)[O-]
c1cccc(C
(C)C(=O)
(-c2cc
o1
[nH]1
[C@@H]2
[C@@H](C
COC
([O-]
CCN(CC
c(F)cc
N#C
c(C(=O)N
nc(-
C(=O)O
(C)=O)
(C#N
[Si](C)(C)C
CS
c2ccc(OC
3)cc1
(c2ccccc2)
S(=O)(=O)N
2CCC
C1=O
c3ccccc3)
C(F)(F)F)
c(C)cc
CNC(=O)
CN(C(=O)
c2ccccc2)cc1
n(C
CN(
nc2
cnc1
CC1(C)
S(C)(=O)=O)
)nc1
Cc1ccc(
[C@@]
COC(=O)c1cc
nc(N
c(C)c1
Cl)
Br)cc1
[N+]([O-]
O=[N+]([O-]
CCCO
CC1)
c2ccccc21
(C)C)
CN(C
c(C(F)(F)F)
Cc1ccccc1
cnc3
c(C#N
OCCO
n2cc
CCC2
(N)=O)
)c(OC
COc1ccc(
c(C(=O)O)
c21
n1cc
C(F)(F)F
CCNCC
C[C@H]1
CCCCC1
c(NC(=O)
2CCOCC
CCNC(=O)
CC(C)(C)OC(=O)N1CCC
4)n
c1ccc(-c2cc
Nc1n
N#
c(O
(CCC
3CCC
2)n1
(c1ccccc1)
(CN
(CO)
)C2
c2ccccc2)c1
c(N)n
c2ccc(Cl)cc2)
c3cn
c2n1
CCCCC
CN(C)
c1cccc(-
(c2cc
[C@H](C)
c3ccc(F)cc
c1cc(Cl
c(-c2cc
)ccc3
CS(=O)(=O)
cc3
c2cc1
O=[N+]([O-])
)s
CCC(=O)
)c2)
(C)(C)O
COc1cc2
(-c3cc
)cn1
c1C
n(C)
CC(C)(C)OC(=O)N1
=O)cc1
(F)(F)F)cc1
3)cc2
c1-
OC(C)(C)C)CC
)cc3)
SC
c(Cl)c1
[C@H]1CC
c1cc(-
2CCCC
c2[nH]
3)c1
O=C(
2)C1
)cc2)cc1
c(F)c1
2C
c2)cc1
CCOC(=O)C
c1ccc2c(c1)
N=C
(C(=O)OC
[C@H](O)
CC(O)
c2ccc(Br
c3ncc
(OCC
c(O)
N1C(=O)
(CCCC
c1ccc(-c2n
n2)
n4
c2cc(Cl
CCCC1
C[C@@H]1
c1cccc(N
N2CCC
=S
c1=O
c1ccn
c(C(F)(F)F)cc
3)cc2)
(Cl)c1
CCOC
[N+](=O)[O-])cc1
c5cccc
)c(F)
(C(F)(F)F)cc
3CCCC
c(=O)[nH]
C#N
(C(F)(F)F)c1
NC(=O)OC(C)(C)C
O=C(C
C(C)(C)C
co
O=S(=O)
B(O)
[C@@H](O)
cs1
n(-
C#
c1cc(N
c2ccc(-
)c(N
c1cncc
C(=O)OC(C)(C)C
c23)
[C@H](NC(=O)
3C
CC(
N(C
[C@H](
CCOC(=O)C1
3CCOCC
[C@@H](C)
CCNCC1
NC1
CCOC(=O)c1
n1-
CCOCC1
Br)
[Si](C)(C)C(C)(C)C
CCN(C)
c1ccc(Br)cc1
4)
c1cccnc1
2CCCCC
Cn1cc
c2ccccc12
)cc21
CCl
)ccc21
)C(=O)O
[C@@H](
NS(=O)(=O)
CC(C)C
)c1ccccc1
C(=O)OC
2)n
c3ccc(OC
C(C)
c1cc(Br
C3
c1ccc(F)
C(C)C
[C@H](N
c2ccc3c(
nc3
)c4
4)c3
4)CC
(F)c1
O)c1
nc(C
c2ccc(C(F)(F)F)cc
[N-]
(CO
=[N+]
OC(C)(C)C)C
ncn
3)cc
COC(=O)C1
c4c(
c5ccccc5
2)nc1
c2ccc(O
c2)c1
(S(=O)(=O)
c1ccc(C(=O)N
CCN(C(=O)OC(C)(C)C)CC
c2cc3
c1cc2cc
COc1ccccc1
c5cc
c(cc1
CC(C)(C)OC(=O)N1CC
c1ccc(O)cc1
FC(F)(F)
c2ncn
c([N+](=O)[O-]
c3ccc(Cl)cc
2)cc
c2ccccc2)CC1
C(=O)O)
ncc2
c(Cl)
)c2c1
(O)cc
)c(Cl)c1
=C(
Cc1cccc
CCn1
c(-c4cc
[C@]1
(CC)
CC(=O)O
c3)
(I
c2s
C(=O)NC
C)
c2cccc3
[C@@H](N
c2ccc(Cl)cc2
c1cnc(N
c1nc(N
(CCN
3CCCCC
c(CN
OCC(=O)
(F)(F)F
2)ccc1
CCCCCC
=O)c1
COc1
c2cccc(Cl
c2ccc(F)cc2)
C(C
c2ccc([N+](=O)[O-]
c1s
c2)CC1
2CC2)
NCC
(F)F)
Nc1cc
c(C)n
CCCN1
3)CC
CN1C(=O)
N#Cc1cc
[nH]cc
(C(=O)NC
c1c[nH]
C(C)(C)
C(=C
c1O
(Br)c1
OCO
)c2)cc1
OC)
c3ccccc3)n
c1ccc(C(F)(F)F)cc1
c(Cl)cc1
c1N
Cc1ccc(-
c2nc(N
(CC(=O)O)
CCOC(=O)c1cn
c2cncc
c2cc(F)cc
c3ccccc3)CC
c1ccc([N+](=O)[O-])cc1
CCCC(=O)
c(-c2ccccc2
OC(C)(C)C(C)(C)O
c2cc(N
)NC(=O)
c1ccc(C2
c(OCC
3)CC2)
)C(C)C
c1cc(F)cc
2CCOCC2)
(C(C)(C)C
c2ccc(F)
3)C
3)CC1
O=c1
NC(
c2C
(C#N)
c2cccnc2
c(C(=O)O)cc
c2cc(-
cc21
[C@@H]3
-c1ccccc1
=[N+]=
N1CCN(
n2)cc1
c(C(=O)NC
c2cc(Br
CCCCO
c2nc(-
Cl)cc1
c(CC
(C)cc
4)cc3
[nH]c(=O)
COc1cccc
c1ccc2
[C@@H](NC(=O)
CCN2
cn2
[C@H]3
3)c2
c(-c2cccc
c(NC
c12)
=CC
)CC2
COCC
4CCOCC
c(I
c2cc(OC
c6
c3ccc(N
(NC
c3)n
NC(=O)N
CC1(C)O
n2C
)cc12
[C@H](CC
CCC(
sc1
c1cc(C(F)(F)F)cc
(OC)c1
OCC1
n3cc
c2c(F)cc
c1cs
COc1ccc2c(c1
)cc2)CC1
[Si](C)(C)
C#C
c1ccccn1
c2ccccc2-
=[N+]=[N-]
c1cc(OC
)c2)c1
c3cc(Cl
Cc1cc(N
c1ccc(N2
N(C)C(=O)
4)cc
c4ccccc4)
NC2
4)C
c1cccc2c1
c1cccc(Cl)c1
S1
(S
C(O)
3CCNCC
CCN(C(=O)OC(C)(C)C)
c2cc(C
c1ccc(N)cc1
CCc1n
(-c4cc
(C(=O)O)cc
)nc2
)C(=O)OC(C)(C)C
c1ccc(CN
)ccc12
([N+](=O)[O-])c1
OC1(C)C
P(=O)
(C1
COC(=O)c1ccc(
c1c(Cl)cc
CC(=O)OC
5CC
c2ccc(-c3cc
c2ccc(F)cc2
c4cn
3)ccc2
c2cccc(F)
)CC1
[C@]2
CCCC2
c2ccc3c(c2)
=C2
S(C)(=O)=O
c3ncn
)ccc1O
(C)C)cc1
c2ccn
COC1
Cc1cn
c(C)cc1
c1ccc(C#N
c2ccccc2)C
c1ccccc1-
S(C)(=O)=O)cc
c1ccc(-n2
Cc1cc2
(C=O)
(c1ccccc1)c1ccccc1
CN2
Nc1ncc
n12
/C=C\
CC(C)O
c2ccc(C#N
oc(-
CCS
(CCO)
)c1cn
CN1CCN(
c2c[nH]
c2-
c(S
c(C(N)=O)
n1C
[C@@]1
)C(F)(F)F
c1ccncc1
(Cl)c3
Cc1ccc(S(=O)(=O)
c1Cl
c3nn
CC1(C)OB
c2cc1OC
OCCC
[C@H]2CC
4CCC
c1cccc(F)c1
CCN1C(=O)
c1cc2cccc
2CCN
C=CC
cc12
(C)CC
O=C1N
c2c(Cl)cc
c3s
c(C=O)
c2ccccc2)C1
Cl)n
c1ccc(C(=O)O)cc1
C(=O)N1
(c3ccccc3)
CC(C)(C)OC(=O)NC1
N(C(=O)
cc1Cl
)c1cc
)cc4
C1CC1
c1c(F)cc
c2cc(Cl)ccc2
CC(C)(C)OC(=O)NC
COc1cc(N
O)cc2
c2ccccc2c1
[C@@H](CC
3)C1
Cl)c1
c1ccc(Cl)
c1ccc(NC(=O)
)C(=O)N
3=O)
c3c2
c1ccc(Cl)c(Cl)c1
Cc1ncc
C=O
c1cccc(C(F)(F)F)c1
)ccc2c1
)OC
c1nc(-
O=C(Cl)
c(C(C)(C)C
B2
(CCl
o2)cc1
2)cn1
c1ccc(OCC
Br)c1
n2)c1
CN1CCC
(N)(=O)
(C(C)C
[C@@H]1CC
S(=O)(=O)C
c(=O)n
n2-
)C(C)(C)
Cc1cc(C)
)O
)c(F)c1
c3ccc(Br
c(Cl)c2
c2cccc(Cl)c2
n3)
CN(C(=O)OC(C)(C)C)
COC(=O)C
c(C(=O)OC
N2C(=O)
/C(=C
c2c(N
c2cc(O
2CCCCC2)
CC(=O)N1
[C@@]2
c2c(-
c1ccc(OC)cc1
c2nc(-c3cc
(C)c1
)OCC
4CCCC
2CCN(
)N1
c(SC
(C)=O
[C@H](CO)
N(
C2=O)
CCN(C)CC
c1cc(F)
c3ccc(F)cc3)
c(OC)c1
c1cccc(O
c1ccc(-c2cn
Cc2ccccc2
c1cc(O
-2
)cc2c1
(NC(=O)OC(C)(C)C)
-c1n
CCOC(=O)CC
B2OC(C)(C)C(C)(C)O
c3cccnc3
CN(C)C
(CC(=O)N
CC(C)(C)C
c1ccc2[nH]
c(Br)c1
(C(F)(F)F)cc(C(F)(F)F)
Cc1o
C2CC
c2ncccc2
c2cs
n1cn
CC(C)(C)OC(=O)N1CCN(
c2o
)CC3)
CCC(=O)N
CN(C)C(=O)
OC2
=C1
CCCl
c2F)
cnc4
c2cccc(N
c2cccc(C(F)(F)F)
c2c(C
)c([N+](=O)[O-]
n2cn
c1ccc(O)
c1cc2c(
c3ccc(O
COC(=O)c1
c2ccc(O)cc
CC(C)(O)
C[C@H](O)
COc1n
)c(Cl)c3
Cc1cc(-
CN(CC
C2)
CCOC(=O)c1n
CCC(O)
c(C(F)(F)F)c1
OC(
COc1cc(C
=S)N
c23)cc1
O=C(O)C1
n1)
C(=N
c1cc(C(F)(F)F)cc(C(F)(F)F)c1
O2
c2cc(-c3cc
c2cccc(-
c3ccc(F)cc3
CCC(C)
OCc2ccccc2)
)cc2)c1
(Cl)cc
(CC(C
cnc2c1
c(Cl)cn
c4c3
C1CCCCC1
)c2)CC1
)C(=O)OC
nc(C)
2CCN(C(=O)
OCCOCC
s2)
[nH]c2c1
Cc1cc(C
Cc1ccc(C
c(=O)n(C
c3ccc(C
c(Cl)c3
2CCCC2)
c3[nH]
c2ccccc2)n1
OB(O)
CBr
cc4
[C@H](OC
c2c(cc
CCN(C)C
C[C@H]2
c(O)cc
CCN(C(=O)OC(C)(C)C)CC1
COc1ccc(N
c2c(C)cc
)ccn1
c1cc(Cl)ccc1
c1cccs1
ncc3
c2cc(F)
CC(=O)NC
)cn2
3CCOCC3)
)c12
COC(=O)c1ccc(C
C[Si](C)(C)
CCCCl
c3ccc(F)
[n+]
c3ccc(-
c2ccc(Br)cc2
O=C(OC
(CC1)
[C@H]1O
c3ccccc3)C
COC(=O)CC
3)CC2)cc1
)c(O)
COCCO
(CCCC)
CCNC1
cn2)
C[C@H](N
[C@H]3CC
c1cccc(Br)c1
(c2ccc(Cl)cc2)
CCNC
COc1cc(OC
CC(N
)c(C
[C@@H](OC
3CC3)
c1cc(C)
c1cccc(-c2cc
(CNC(=O)
[C@@H]1CCC
cc1-
COc1ccc(C(=O)
c1cn(C
c([N+](=O)[O-])c1
N2CCN(
(C)C)n
)cc(-
CCC(N
CCn1cc
c2)n
c1ccc(Br
4)cc3)
I)cc1
c2ccc(Cl)c(Cl
=C(C)
c3ccccc32)cc1
c3cccc(F)
C(=O)N2
c3cccc4
c(=O)cc
C(=O)N(C
c(F)cc1
CCCN(C(=O)
CCCCCCC
)cc3)n
c(=O)n(C)
)c(OC)c1
c3c(Cl)cc
c3ccc4c(
(O[Si](C)(C)C(C)(C)C
(/C=C/
c2ccc3ccccc3
c3ccccc3)c2
CCc1
CC1(C)C
3CCN(
c1ccc(OCc2ccccc2)cc1
c(N)
C(=O)OCC
c2nc3ccccc3
)C(
c1ccc(S
c23)CC1
CCCCO1
c1cc(Cl)n
(Br)
c3cccc(Cl)c3
[C@@H]1O
)cccc2
(N)=O
c1cc(-c2cc
C[C@@H]2
O=c1[nH]
C(F)(F)F)cc
CON(C)C(=O)
c1cc2c(cc1
c2ccccc2n1
C[C@H](NC(=O)
c4ncc
c1cccc(C2
c3ccc(Cl)cc3
c2ccccc2)n
(C(N)=O)
)C(C)(C)C
Nc1
c3c(c2)
CO)
c3cc(OC
c(Cl)cc2)cc1
(O)c1
=CC(=O)
c1ccc(C)cc1
[C@@](C)
c3ccccc3)cc2)
c1cccc([N+](=O)[O-])c1
CCS(=O)(=O)
(C#C
(Cl)n
c2ccc(NC(=O)
c1cc(Br)ccc1
n]
c1ccc(C#N)cc1
(C(=O)OCC
CCC3
CC3)
COc1ncc
COc1cc2c(cc1
N1CCC(
)C(O)
c2ccccn2)
c1cccc(-c2n
c3cc(F)cc
c2c(C)
c2s1
O=S(=O)(
c1cccc(OC
c(CO
C[C@@H](O)
c(Cl)n1
3)n1
5)cc
C[C@]1
S1(=O)
c2cccc(OC
nc2c1
5)n
CCN(C(=O)OC
4)cn
[Sn]
C(F)(F)F)cc1
OC(=O)N
)o
O=C(NC1
CNC1
C(=O)O)cc1
C1=C
OCCO2
CC[C@@H]1
c(-c2ccccc2)
3)cc2)cc1
4)cc2
c2ccc(F)cc2)cc1
4C
C=C(C)
CCNCC2)cc1
(CC1
COc1ccc(-
S(=O)(=O)c1ccccc1
cc2F)
c(F)c(F)
[C@@H](CO)
CC1(C)OB(
c4ccc(F)cc
c3cc(Cl)ccc3
CS(=O)(=O)N
c2nc(Cl)n
CCN(CC)
cnc12
c(F)cc2
cnc21
4)ccc3
COc1ccc(CN
Nc1ccccc1
COC(=O)[C@H](C
c(Br)cc
c2C1
C=C1
(F)F
CC(C)(C)[Si]
=NC
N1CCCC1
c2ccncc
(COC
c3ccccc3)cc2
COCO
COc1ccc(-c2cc
/C=C(
cn2)cc1
CCCCc1n
2)s1
oc2c1
nn1
c1ccc(S(=O)(=O)
2CC2)cc1
c3ccc(Cl)cc3)
c2cccc(Br
CNC
c(Cl)cc2
c(F)c2
c1cc(Cl)cc
CCCCCCCCCCCCCCCC
n2)CC1
c(Br)
2CC3CC
c1cccc(
CO1
c2cc(O)cc
CCCc1
5)CC
co1
CC2)ccc1
)c(O
(C(=O)O)c1
2)C
)c2n1
ncnc(N
CN1CC
S(N)(=O)
OCc1ccccc1)
c1cccc2cc
c(N)c1
c2cnc(N
[C@@H](C)C
O=S(=O)(N
c2ccccc2C1
CC(C)(C)OC(=O)N1CCC(
OCC[Si](C)(C)C
(C)C)c1
COc1ccc(C2
c1ccc(CC
N1CCC(N
c2ccc(CN
2CCNCC2)
Clc1n
c1ccc2c(
c2ccc(OCC
c1cc([N+](=O)[O-]
c2)C1
3)n2)cc1
c2ccc(I
[nH]c3
CC2)cc1
[N+](=O)[O-])
c4ccccc4)n
)c1n
CC1(
Cc1ccc2c(c1
c1cccc2cccc
s2)cc1
c2ccc(F)cc2)c1
c2ccc(Br)cc2)
c2ncnc3
c3cccc(C(F)(F)F)
c1ccccc1Cl
CC(=O)O)
c2=O)
CCCc1n
c2ccc3
(=N
Cc1nc(N
4CCCCC
/C(=C\
c4n
c1ccc(F)cc1)
c1ccc(S(=O)(=O)N
N1CCN(C(=O)
N1CCOCC1
COC(=O)c1s
N1C
c1ccc2ccccc2c1
c3ccc([N+](=O)[O-]
CNCC
Br)cc
c3c(F)cc
c2ccc([N+](=O)[O-])cc2)
COC(=O)c1n
2CCCCO
O=C(OCc1ccccc1)
c2cc3c(
c1ccc(I)cc1
)n2
Cc1ccc(C(=O)
c(CO)
)c1ncc
c3c(c2
cncc
N#CC
c2ccc(O)
c(C)c(C)
CC1CCCCC1
CCCNC(=O)
O=C1c2ccccc2
c3C
OCC2
(C)O
N2C
C[Si](C)(C)CCOC
OC(C)(C)C)C(=O)
Cc1cs
)ccc1OC
CCCn1
c2)n1
CC1CC
3)ccc21
c1ccc(OC(F)(F)F)cc1
n2c1
c2cc([N+](=O)[O-]
c2ccc(C(=O)N
n(CC
c(C(=O)O)cn
c1ccc(C#C
c2ccc(Cl)cc2)cc1
c1F
Nc1cn
c(=O)n1
3C(=O)
)c2)n1
3)cc2)CC1
)CC2)
)CCO
OCO2
c4nn
oc12
3)cc21
)ccc1F
c2nnn
(OC)c1OC
[C@]4
c1ccc(Cl)cc1Cl
(CC2)
c(Cl)cc3
cs2)
C(c1ccccc1)
c2c(N)n
CCC(CC)
c(-c3ccccc3
[C@]3
c3cc(-
3)c2c1
c(-c2ccccc2)n
2CCCCC2
C1CC
C(=O)N(
O=C1CC
COCCN1
[C@@H]4
2CCN(C
on1
COc1cccc(C
c2ccccc2F)
N2CCCC
S(C)(=O)=O)cc1
c23)c1
O[Si](C)(C)C(C)(C)C
#CC
c2ccccc12)
2CCOCC2)c1
c1cccc(O)c1
OC)cc1
c1ccc(-c2ccccc2)cc1
)ccc2n1
CSc1n
)ccc1Cl
)cc(N
nc(-c3cc
c1cccc(N)c1
)c(C)
c2ccc(OC)cc2)
5)c4
c2cc(F)cc(F)
N1CCC[C@H]1
cc2c1
(C(C)C)
[C@@H]2CC
S2
B3
c1ccc(Cl)cc1)
1)
c3ccn
c(C#N)c1
c1cc(C#N
CCOC(=O)/C=C/
c(=O)[nH]1
[N-]=[N+]
[N-]=[N+]=N
CCOP(=O)
c2cc1O
[SiH]
Cc1no
(N)C
ncc1
Cc1c(N
)c(-
O=S(=O)(Cl)
CC(C)(C)[Si](C)(C)O
c1ccccc1O
3CCCCC3)
c2c(OC
)C1CC1
3CCCCO
Cc1nc(-
cc2cc
CCC(C)(C)
c(N4CCOCC
nc12
CC(C)OC(=O)
CCOC(=O)c1cc
(C2
/C=C(\
nccc(O
sc2c1
COC(=O)N
C)cc1
n[nH]
n3)n
2CCCCC2)cc1
CCNC(=O)N
COC(=O)[C@@H]1
COc1ccc(Cn2
NC(=O)C
-c1cc
c3cc4
c2ccc(C(F)(F)F)cc2
)c3)n
c2[nH]1
[C@@H]3CC
c(C3
CC1C
c4ccccc4)cc3
)cc2F)
ccc2c1
2CC2)c1
c(NC(=O)C
c3ccc(O)cc
CCOCC
CCCN(CCC
c3cc(Br
c1OC
)C(=O)OCC
C(c2ccccc2)
c2cccc(C
c(C2
3cc
[C@H](C(=O)O)
(O)C
c1cn2
c2ccc(C(F)(F)F)
3CCOCC3)n
O=C(O)c1cc
[C@H](N)
C=CCO
c1ccc(NC
c2ccc3c(c2
COc1ccc(-c2n
CCOC(=O)c1cc2cc
c3cccc(F)c3
CCN(Cc2ccccc2)CC1
=S)
B3OC(C)(C)C(C)(C)O
(C(=O)OC(C)(C)C)
(c2ccccc2)(c2ccccc2)
nc(Cl)n
c2=O)cc1
3CCC(N
c3ccccc23)
c1ncccc1
c2ccccc2N
3)C2
Cl)CC1
[C@H](O
c1)
)c([N+](=O)[O-])c1
N1CCCCC1
c2cc(C(F)(F)F)cc(C(F)(F)F)
c2ncnc(N
c(C#N)cn
CCNCC2)
)cc1Cl
3(
c3ccc(Cl
Cc1ccc(Cl)cc1
Cl)n1
)c(F)cc
s1)
c34
c2ccc(OC(F)(F)F)cc
c1ccccc1)NC(=O)
c4ccc(Cl)cc
3CCN(C(=O)
CC#
3CCN(C
(C)N
CO2
C[C@@H](
CCC(C
(OC)
[C@@H](N)C
)ccc1-
c1ccccc1)C(=O)
Cc1ccc(NC(=O)
c1c(C)cc
c(CCl
C(C)(C)C)
)nc3
c3cncc
C[C@H](
c3ccc4
COc1cc(-
O=C(CC
c2cccnc21
(C)(C)C)cc1
(NC(=O)C
COc1cn
(N)=O)cc
[C@@H](O
2CCC(N
c1c(C
)c(Br
[nH]2)cc1
c3ccc(Br)cc3
)CC2)cc1
(C)C)C
C2)cc1
c2ccccc2)nc1
Cc1onc(-
CCCCN
c2cc(Br)ccc2
5)C
)n1cc
Cc1ccc(N
CC(C)(C)[Si](C)(C)
[C@H]4
C(F)
N=C1
c(N)n1
)cc1F
oc1
Cc1[nH]
CCCC[Sn]
CCCCCCCCCCCC
Cn1ncc
3)c12
Cn1cn
N(CC
c1c(F)cccc1
c(-c2ccc(F)cc2)
c2cccn
n3C
=O)CC1
)cccc1
)NC(=O)OC(C)(C)C
c3cc(-c4cc
c(NC(=O)N
)c21
Oc1ccccc1
CC(C)c1n
CCO)
c2ccc(F)cc2F)
(C)(C)O)
c1ccc2c(c1)C
c1ccc(N2CCC
n(-c2cc
c2ccc(O)cc2
CCOc1cc(C
)S(=O)(=O)
(O)(
C1=N
)cc(C)
)c(Br)c1
CC1CC1
c2cccc(O)
c2ccccc2-c2ccccc21
c(-c3cccc
[C@@H]1C
c(O)c1
S(=O)(=O)C(F)(F)F)
2CCOCC2)cc1
C(=O)N(C)
N1CCNCC1
CN(C(=O)OC(C)(C)C)CC
C2=O
OCCCC
c1cc(F)cc(F)c1
c2cc(Cl)
CC(=O)N1CC
c1ccccc1)C
c2cc(C(F)(F)F)cc
O=C(O)c1cn
Cc1cc(Br
c2ccccc2)CC
CCCN(C
C(=O)C
c1ncn
c2cc(
c3cc2
Cc1ccc(-c2ccccc2
CCN(C(=O)OC(C)(C)C)C
c3c(Cl)cccc3
Oc1cc
c3ccc4c(c3)
Cc1cc(Cl
2CCC(
[C@@H](N)
OC1CCCCO1
CC(O
OCCO1
)N(C)C(=O)
COc1ccc(C(=O)N
n2ccnc2
(C(=O)OC)c1
n2cnc3
SCC
3CC4CC
N(C)
4)cc3)n
[C@@H]12
NCC1
c2ccccc2)ccc1
c1o
n2c(
c2cc(C)
(C(C)C)C(C)C
c1ccc2c(c1)CC
c3ccncc
S(=O)(=O)c3cc
c6cc
COc1ccc2c(c1)
c(C(=O)O)cc2
n4cc
c3ncccc3
[C@@H](C(=O)O)
CCC2(CC1)
c32)cc1
NC(=S)N
c2)OC1(C)C
c(C4
N)cc1
c1nc2ccccc2
(Cl)(Cl)
C/C=C\
3CC3)n
2CCN(C(=O)OC(C)(C)C)CC
(F)(F)F)c1
4)CC3)
c2ncc(Br
c1ccc(C(F)(F)F)
)CC3)n
#N)
OC(C)(C)
)nn2
c2c(Cl)cccc2
c1ccc([N+](=O)[O-]
CNC(=O)c1
c2ccc(O)cc2)
C[C@@H](O
CCOC(=O)C(C
c2ccc(C(=O)
3c(
COc1ccc(Cl)cc1
c1cccc(NC(=O)
c2ccnc(N
CC3
)C1CCCCC1
)cc(Cl
c1ccc(F)c(F)c1
COc1cc(C)
c1Br
(Cc2ccccc2)
c(C#N)
O=C(CCl
Cc1cnc(N
N1CCN(C
oc2C
cn2)c1
[C@H]1CO
c1ccc(C=O)cc1
CCOc1cc
N1CCC(O
CN1C(=O)OC(C)(C)C
)c2c(
C1CCNCC1
c(S(=O)(=O)
c1ccc(Cl)nc1
c2ccc(C)cc
(C)=O)cc
c5c4
c[nH]1
(C(F)(F)F)cc2
COC(=O)c1cn
CCCC[Sn](CCCC)
c1ccc(F)cc1F
c2no
c3ccc(OC(F)(F)F)cc
c2ccc(N)cc2)
c2ccc(F)cc2)CC1
c2ccccc2C1=O
(C)=O)cc1
c4ccc5
c2ccccc2O
[nH]c1
c2cccc([N+](=O)[O-]
c2ccc(-c3ccccc3
CCOC(=O)CC1
scc
c2ccc([N+](=O)[O-])cc2
c(-c2ccc(Cl)cc2)
N)c1
C1CCCC1
c2nc(C
[nH]c12
CN(C(=O)OC(C)(C)C)C
3CCNCC3)n
NCc1ccccc1
OC(C)(C)C)c1
c1cccc(-n2
CC(C)n1
C[C@@H]3
c2cccc(O
c3cc(Cl)cc
CC(=O)Nc1n
CCOC(=O)c1s
(C(=O)N2CCC
[nH]n1
NC(=O)OC(C)(C)C)
CNc1n
)cn2)CC1
c2ccc3n
(C)(C)C)
c(-c3ccc(Cl)cc
c2ccc(C3
COC(=O)/C=C/
c3o
NNC(=O)
Cc1cc(F)cc
3CCNCC3)
s2)CC1
CC1(C)OB(c2cc
[P
CCOC(=O)C1=C
NN
CCN(CC)C(=O)
c2)nc1
3CCCC3)
CCN1CCC
C(=O)OCc1ccccc1
N=C(
CCCS
Cn1c(=O)
cn2)CC1
[C@H](C(=O)
c1ccc(C(=O)O)
4=O)
S1(=O)=O
)cc(OC
B(O)O)cc1
c3ccccc32)
c2cccc3c2
C(=O)NC1
s2)c1
c1[nH]
=CCCC
Cn1nn
c(C)cc2
CCCO)
COC(=O)c1ccccc1
C[C@H]3
c(=O)n2
N1CCC2
)C2=O
c2ccc(Cl)cc21
CC[C@H](C)
3(CC2)
Cc1c(C
)N1CC
CCc1cc
CC(=O)OCC
)cn2)
n5
S(=O)(=O)Cl
c1c(N
c2cccc(Cl)c2)
c2cccc(-c3cc
c(/C=C/
)nn1
c1cc(Cl)cc(Cl)c1
(I)c1
(F)F)cc
CC(C)(C)OC(=O)N1CCC(N
c2c(F)
n3-
c3ccccc3C2=O)
(OCC(=O)
c2cc3cc
CNCC2
c2ccc(Cl)n
cc1Br
[C@]12C
OC(C)(C)C)cc1
2CC3CC(CC(C
OC(C)(C)C)C1
)cc2n1
Cc1ccc(O
c1-c1ccccc1
c(C(=O)OCC
CCc1ccccc1
c(C)nc2
c3cccc(C(F)(F)F)c3
[C@H](C(=O)N
c(=O)c(C(=O)O)cn
c2ccc(F)c(F)
cn3
C[C@H](C
c4ccccn4
c3cc(F)
c2ncc(-
OC)c1
n(
c3c(F)cccc3
n1ccnc1
3CCN(C)CC
CCCN1C(=O)
[n+]([O-]
=NN
c1cccc2ccccc12
C(F)(F)C(F)(F)
(Cl)C
c1ccc(Br)
CCCNC1
C1CCN(
(c1ccccc1)(c1ccccc1)c1ccccc1
)ccc2F)
I)
[C@H]1CC[C@H](
)cn2)cc1
COc1ccc2ncc
3)ccc2c1
c(F)c1F
=CCC
cn1)
oc1C
2CC3CC(CC(C3)C1
(Cl)c(N
)cc(C
c2)cn1
c1ccc2c(c1)N
3)CC2)c1
c2scc
c3cc(N
CCCCOC(=O)
OC(C)=O
Cc1cccc(N
c(N)c2
[C@@H]1CCCN1C(=O)
CCNCC2)c1
C(=S)N
c3ccccc3F)
c1cccc(C(=O)N
CCCCCC1
c3ccc(OC)cc3
c1ccc(-c2ccccc2
B(O)O
c3ccc(C(F)(F)F)cc
[C@@H]2O
c2ccc(C(F)(F)F)cc2)
(F)cc1
c1c(Cl)cccc1Cl
)cc1C
c1ccc(/C=C/
[C@](C)
c3c(-
CCCN(
CCNC2
CC3)n
c3ccc(-c4cc
c1ncn2
5CCOCC
4)s
C(C)=O)
(CC)CC
3CCN(C(=O)OC(C)(C)C)CC
nc1-
[nH]c1=O
CCCCCCCCC
CNS(=O)(=O)
O=C1CCC
Cc1ccc(-c2cc
c1ccc(CO
3=O)cc
n3cn
O=C1C
c1n[nH]
c1cn(-
CC(C
c1=O)
c1nc(N2CCOCC2)
ncc2cc
[C@]4(C)
COc1ccc(CO
NC(=O)OC
cc1C
c3ccc(C(=O)N
3)C2)
N(C)C
c3ccc(C#N
CCCNC
B(O)O)
C#N)cc1
c1ccccc1F
c4o
N)
C3)
c3ccc(Cl)c(Cl)c3
c(C(C)=O)
CCC(=O)O)
(C(=O)OC)
cc2c(
c3ccccc3)CC2)
CCCC[C@H]1
(CCO
c(-c2cn
O=C(NCC
c3ccc(F)cc3)n
(F)c4
(CC(=O)OC(C)(C)C)
[P+]
)C(=O)N1
c3ccccc3)CC2)cc1
CCN1CCN(
COc1cccc2
3CCN(CC
c2ccccn2)cc1
c1cncc(-
c1ccsc1
C[C@@H](N
CN1CCN(C
n2)n1
#N)c1
Cc1ccc(C(=O)N
c1ccc(OCCN
c3ccc(NC(=O)
CCOCC1)
3CCC4
n1-c1ccccc1
[C@H]1C
N=C(N)
c2c(F)cccc2
(NC(=O)OC(C)(C)C
c2ccc(C(C)(C)C
NCCC
(c2ccc(-
c2c(O
NC(=O)OCc1ccccc1
c4cccnc4
C(=O)NCC
(C(C)=O)
N2CCC(N
4)CC3)n
(O[Si](C)(C)C(C)(C)C)
C[C@H](C)
cnn2
(Cl)c4
OC1=O
4CCNCC
2CC3
/C(=C/
(C(=O)OC(C)(C)C
O=C=N
c(N)ncnc3
n2n
C(=O)O)cc
COC(=O)c1cc(C
S(=O)(=O)NC
(C)(C)O1
COCCCO
(c2ccc(-c3cc
)c(O)c1
CC=C
)cc(C(C)(C)C
3)cc12
)C2)
S2(=O)
c1nn
c1cc2ncc
c2cc(F)ccc2
CC(C)(C)OC(=O)N[C@H]1
C2CCC
c(C(=O)O)c1
CCOC(=O)N
[n+]1
)(C(F)(F)F)
C(=O)N1CC
c3cc(C)
(C1)
c2n(
C[C@@H](C
c4ccccc4)c3
c1ccc(C)
C1(C)C
COc1cccc(N
c1ccc(CO)cc1
C2CCCC
c2ccc(OC)cc2)cc1
[nH]2)
Cc1cc(C)cc
/C
c2nc(C)
(CC(C)C)
c(F)c3
3)cn1
CCNC(=O)OC(C)(C)C
c2cc3cccc
COc1ccc(OC
2C(=O)
)n2)
c2cc3c(cc2
c4ccc(N
(c4ccccc4)
c1ccc(-n2cc
c4ccccc4)cc3)
CC(C)C(=O)N
COc1ccc(-n2
CC(C)(C)O
CCN(C)CC1
(B2OC(C)(C)C(C)(C)O
/C(=N
N#Cc1cn
nc1C
cc2n1
)C(=O)NC
(O)CC
[C@@H]2C
c4cc(F)cc
3F)
[C@@](C)(c2ccc(Cl)cc2)
c1cc(Cl)
O=[N+]([O-])c1cn
O=C(O)CC
c(Cl)c(Cl
B1
c3ccc(F)cc3F)
CCCN2
(N)=S
c2cccc3cccc
nc1Cl
)cc2cc
