.
<unk>
<sor>
<eor>
<sop>
<eop>
<mask>
<sum_pred>
<sum_react>
<first_pred>
<second_pred>
<third_pred>
<fourth_pred>
<pad>
#
(
)
+
-
/
1
2
3
4
5
6
7
8
9
=
@
B
C
F
H
I
K
L
M
N
O
P
S
Z
[
\
]
b
c
d
e
g
i
l
n
o
p
r
s
t
u
cc
CC
(C
c1
O)
=O)
(=O)
c2
(C)
c(
c1cc
)cc
OC
c2cc
c3
F)
H]
c(C
[C
[C@
C(=O)
(F)
CCC
cn
2)
)cc1
(C)(C)
OC(=O)
c3cc
c1cccc
=C
CCN
c1ccc(
c2cccc
CC1
(N
)n
[C@H]
[C@@
CO
CCCC
c(Cl
[C@@H]
c4
C1
c2ccccc2
(F)(F)
n1
CN
c(N
c1ccccc1
)c1
(C)(C)C
c(-
(C(=O)
(O)
Br
O=C
c1n
N1
F)cc
[n
3)
OCC
c3cccc
[nH]
S(=O)
(-
(CC
Cl
COC(=O)
c2n
S(=O)(=O)
c1ccc(C
[N
(C)C
+]
CC(C)(C)
CCOC(=O)
-]
)C
[N+]
OC(C)(C)C
c2ccc(
cc1
(Cl
2)cc1
c3ccccc3
[O
[O-]
c4cc
NC(=O)
c(C)
CC(=O)
NC
(F)(F)F)
)c2
n2
)CC
CC(C)(C)OC(=O)
(=O)[O-]
2CC
[N+](=O)[O-]
)cc2
=O
C(=O)N
Cc1cc
c2c(
#N
[C@H]1
c1ccc(-
c(=O)
COc1cc
(OC
c1cn
c2ccccc2)
c(C(=O)
[C@@H]1
cc2
CC(C)
)cc2)
C=C
)c(
CCO
)ccc1
c2c1
O=C(O)
(Br
(O
2)c1
)C(=O)
(NC(=O)
F)cc1
3CC
)cn
c4cccc
CCN(
ncc
c3ccc(
N2
(F)(F)F)cc
(N)
3)n
O=
)c3
c(Cl)cc
c5
CCC1
s1
CCN(C(=O)
c12
c2)
CN1
c1ccccc1)
#C
[S
)ccc2
c2ccc(C
(C(F)(F)F)
N1CCC
O)cc
c1ccc(Cl
C2
c2cn
)n1
=N
c2c(c1
2)CC1
c4ccccc4
[Si
c2ccc(Cl
nn
Cc1n
/C=C
c(F)
Cc1
O=C(N
O=C1
CCCN
C[C@H]
c2ncc
cccc
CCN1
[Si]
Cn1
c1cc2
C(F)(F)
c1ccc(C(=O)
C(
O)cc1
CCN(C
cn1
c3c(
N1CC
)N
n3
(C(=O)N
nc1
c1ccc(N
OC(C)(C)C)
S(C)
cs
OC1
(C(=O)O)
S(C)(=O)
)cc3
c(-c3cc
C[C@@H]
(F)cc
CC(C)(C)OC(=O)N
c1ncc
CC(=O)N
CCCCCCCC
c1ccc(OC
CC2
c3n
c(OC
c(Cl)n
(Cl)
[C@H](C
c2ccc(F)cc
c1cc(C
CC2)
(CC(=O)
/C=C/
c2ccc(N
)C1
c1ccc2c(c1
c[nH]
c1ccc(F)cc1
cnc2
OCc1ccccc1
[C@H]2
[C@]
=O)cc
)c(Cl
c1cccc2
c1ccc(Cl)cc1
C=
O1
4CC
c(Br
COc1ccc(C
c1ccc(O
([N+](=O)[O-]
c1cccc(C
(C)C(=O)
(-c2cc
o1
[nH]1
[C@@H]2
[C@@H](C
COC
([O-]
CCN(CC
c(F)cc
N#C
c(C(=O)N
nc(-
C(=O)O
(C)=O)
(C#N
[Si](C)(C)C
CS
c2ccc(OC
3)cc1
(c2ccccc2)
S(=O)(=O)N
2CCC
C1=O
c3ccccc3)
C(F)(F)F)
c(C)cc
CNC(=O)
CN(C(=O)
c2ccccc2)cc1
n(C
CN(
nc2
cnc1
CC1(C)
S(C)(=O)=O)
)nc1
Cc1ccc(
[C@@]
COC(=O)c1cc
nc(N
c(C)c1
Cl)
Br)cc1
[N+]([O-]
O=[N+]([O-]
CCCO
CC1)
c2ccccc21
(C)C)
CN(C
c(C(F)(F)F)
Cc1ccccc1
cnc3
c(C#N
OCCO
n2cc
CCC2
(N)=O)
)c(OC
COc1ccc(
c(C(=O)O)
c21
n1cc
C(F)(F)F
CCNCC
C[C@H]1
CCCCC1
c(NC(=O)
2CCOCC
CCNC(=O)
CC(C)(C)OC(=O)N1CCC
4)n
c1ccc(-c2cc
Nc1n
N#
c(O
(CCC
3CCC
2)n1
(c1ccccc1)
(CN
(CO)
)C2
c2ccccc2)c1
c(N)n
c2ccc(Cl)cc2)
c3cn
c2n1
CCCCC
CN(C)
c1cccc(-
(c2cc
[C@H](C)
c3ccc(F)cc
c1cc(Cl
c(-c2cc
)ccc3
CS(=O)(=O)
cc3
c2cc1
O=[N+]([O-])
)s
CCC(=O)
)c2)
(C)(C)O
COc1cc2
(-c3cc
)cn1
c1C
n(C)
CC(C)(C)OC(=O)N1
=O)cc1
(F)(F)F)cc1
3)cc2
c1-
OC(C)(C)C)CC
)cc3)
SC
c(Cl)c1
[C@H]1CC
c1cc(-
2CCCC
c2[nH]
3)c1
O=C(
2)C1
)cc2)cc1
c(F)c1
2C
c2)cc1
CCOC(=O)C
c1ccc2c(c1)
N=C
(C(=O)OC
[C@H](O)
CC(O)
c2ccc(Br
c3ncc
(OCC
c(O)
N1C(=O)
(CCCC
c1ccc(-c2n
n2)
n4
c2cc(Cl
CCCC1
C[C@@H]1
c1cccc(N
N2CCC
=S
c1=O
c1ccn
c(C(F)(F)F)cc
3)cc2)
(Cl)c1
CCOC
[N+](=O)[O-])cc1
c5cccc
)c(F)
(C(F)(F)F)cc
3CCCC
c(=O)[nH]
C#N
(C(F)(F)F)c1
NC(=O)OC(C)(C)C
O=C(C
C(C)(C)C
co
O=S(=O)
B(O)
[C@@H](O)
cs1
n(-
C#
c1cc(N
c2ccc(-
)c(N
c1cncc
C(=O)OC(C)(C)C
c23)
[C@H](NC(=O)
3C
CC(
N(C
[C@H](
CCOC(=O)C1
3CCOCC
[C@@H](C)
CCNCC1
NC1
CCOC(=O)c1
n1-
CCOCC1
Br)
[Si](C)(C)C(C)(C)C
CCN(C)
c1ccc(Br)cc1
4)
c1cccnc1
2CCCCC
Cn1cc
c2ccccc12
)cc21
CCl
)ccc21
)C(=O)O
[C@@H](
NS(=O)(=O)
CC(C)C
)c1ccccc1
C(=O)OC
2)n
c3ccc(OC
C(C)
c1cc(Br
C3
c1ccc(F)
C(C)C
[C@H](N
c2ccc3c(
nc3
)c4
4)c3
4)CC
(F)c1
O)c1
nc(C
c2ccc(C(F)(F)F)cc
[N-]
(CO
=[N+]
OC(C)(C)C)C
ncn
3)cc
COC(=O)C1
c4c(
c5ccccc5
2)nc1
c2ccc(O
c2)c1
(S(=O)(=O)
c1ccc(C(=O)N
CCN(C(=O)OC(C)(C)C)CC
c2cc3
c1cc2cc
COc1ccccc1
c5cc
c(cc1
CC(C)(C)OC(=O)N1CC
c1ccc(O)cc1
FC(F)(F)
c2ncn
c([N+](=O)[O-]
c3ccc(Cl)cc
2)cc
c2ccccc2)CC1
C(=O)O)
ncc2
c(Cl)
)c2c1
(O)cc
)c(Cl)c1
=C(
Cc1cccc
CCn1
c(-c4cc
[C@]1
(CC)
CC(=O)O
c3)
(I
c2s
C(=O)NC
C)
c2cccc3
[C@@H](N
c2ccc(Cl)cc2
c1cnc(N
c1nc(N
(CCN
3CCCCC
c(CN
OCC(=O)
(F)(F)F
2)ccc1
CCCCCC
=O)c1
COc1
c2cccc(Cl
c2ccc(F)cc2)
C(C
c2ccc([N+](=O)[O-]
c1s
c2)CC1
2CC2)
NCC
(F)F)
Nc1cc
c(C)n
CCCN1
3)CC
CN1C(=O)
N#Cc1cc
[nH]cc
(C(=O)NC
c1c[nH]
C(C)(C)
C(=C
c1O
(Br)c1
OCO
)c2)cc1
OC)
c3ccccc3)n
c1ccc(C(F)(F)F)cc1
c(Cl)cc1
c1N
Cc1ccc(-
c2nc(N
(CC(=O)O)
CCOC(=O)c1cn
c2cncc
c2cc(F)cc
c3ccccc3)CC
c1ccc([N+](=O)[O-])cc1
CCCC(=O)
c(-c2ccccc2
OC(C)(C)C(C)(C)O
c2cc(N
)NC(=O)
c1ccc(C2
c(OCC
3)CC2)
)C(C)C
c1cc(F)cc
2CCOCC2)
(C(C)(C)C
c2ccc(F)
3)C
3)CC1
O=c1
NC(
c2C
(C#N)
c2cccnc2
c(C(=O)O)cc
c2cc(-
cc21
[C@@H]3
-c1ccccc1
=[N+]=
N1CCN(
n2)cc1
c(C(=O)NC
c2cc(Br
CCCCO
c2nc(-
Cl)cc1
c(CC
(C)cc
4)cc3
[nH]c(=O)
COc1cccc
c1ccc2
[C@@H](NC(=O)
CCN2
cn2
[C@H]3
3)c2
c(-c2cccc
c(NC
c12)
=CC
)CC2
COCC
4CCOCC
c(I
c2cc(OC
c6
c3ccc(N
(NC
c3)n
NC(=O)N
CC1(C)O
n2C
)cc12
[C@H](CC
CCC(
sc1
c1cc(C(F)(F)F)cc
(OC)c1
OCC1
n3cc
c2c(F)cc
c1cs
COc1ccc2c(c1
)cc2)CC1
[Si](C)(C)
C#C
c1ccccn1
c2ccccc2-
=[N+]=[N-]
c1cc(OC
)c2)c1
c3cc(Cl
Cc1cc(N
c1ccc(N2
N(C)C(=O)
4)cc
c4ccccc4)
NC2
4)C
c1cccc2c1
c1cccc(Cl)c1
S1
(S
C(O)
3CCNCC
CCN(C(=O)OC(C)(C)C)
c2cc(C
c1ccc(N)cc1
CCc1n
(-c4cc
(C(=O)O)cc
)nc2
)C(=O)OC(C)(C)C
c1ccc(CN
)ccc12
([N+](=O)[O-])c1
OC1(C)C
P(=O)
(C1
COC(=O)c1ccc(
c1c(Cl)cc
CC(=O)OC
5CC
c2ccc(-c3cc
c2ccc(F)cc2
c4cn
3)ccc2
c2cccc(F)
)CC1
[C@]2
CCCC2
c2ccc3c(c2)
=C2
S(C)(=O)=O
c3ncn
)ccc1O
(C)C)cc1
c2ccn
COC1
Cc1cn
c(C)cc1
c1ccc(C#N
c2ccccc2)C
c1ccccc1-
S(C)(=O)=O)cc
c1ccc(-n2
Cc1cc2
(C=O)
(c1ccccc1)c1ccccc1
CN2
Nc1ncc
n12
/C=C\
CC(C)O
c2ccc(C#N
oc(-
CCS
(CCO)
)c1cn
CN1CCN(
c2c[nH]
c2-
c(S
c(C(N)=O)
n1C
[C@@]1
)C(F)(F)F
c1ccncc1
(Cl)c3
Cc1ccc(S(=O)(=O)
c1Cl
c3nn
CC1(C)OB
c2cc1OC
OCCC
[C@H]2CC
4CCC
c1cccc(F)c1
CCN1C(=O)
c1cc2cccc
2CCN
C=CC
cc12
(C)CC
O=C1N
c2c(Cl)cc
c3s
c(C=O)
c2ccccc2)C1
Cl)n
c1ccc(C(=O)O)cc1
C(=O)N1
(c3ccccc3)
CC(C)(C)OC(=O)NC1
N(C(=O)
cc1Cl
)c1cc
)cc4
C1CC1
c1c(F)cc
c2cc(Cl)ccc2
CC(C)(C)OC(=O)NC
COc1cc(N
O)cc2
c2ccccc2c1
[C@@H](CC
3)C1
Cl)c1
c1ccc(Cl)
c1ccc(NC(=O)
)C(=O)N
3=O)
c3c2
c1ccc(Cl)c(Cl)c1
Cc1ncc
C=O
c1cccc(C(F)(F)F)c1
)ccc2c1
)OC
c1nc(-
O=C(Cl)
c(C(C)(C)C
B2
(CCl
o2)cc1
2)cn1
c1ccc(OCC
Br)c1
n2)c1
CN1CCC
(N)(=O)
(C(C)C
[C@@H]1CC
S(=O)(=O)C
c(=O)n
n2-
)C(C)(C)
Cc1cc(C)
)O
)c(F)c1
c3ccc(Br
c(Cl)c2
c2cccc(Cl)c2
n3)
CN(C(=O)OC(C)(C)C)
COC(=O)C
c(C(=O)OC
N2C(=O)
/C(=C
c2c(N
c2cc(O
2CCCCC2)
CC(=O)N1
[C@@]2
c2c(-
c1ccc(OC)cc1
c2nc(-c3cc
(C)c1
)OCC
4CCCC
2CCN(
)N1
c(SC
(C)=O
[C@H](CO)
N(
C2=O)
CCN(C)CC
c1cc(F)
c3ccc(F)cc3)
c(OC)c1
c1cccc(O
c1ccc(-c2cn
Cc2ccccc2
c1cc(O
-2
)cc2c1
(NC(=O)OC(C)(C)C)
-c1n
CCOC(=O)CC
B2OC(C)(C)C(C)(C)O
c3cccnc3
CN(C)C
(CC(=O)N
CC(C)(C)C
c1ccc2[nH]
c(Br)c1
(C(F)(F)F)cc(C(F)(F)F)
Cc1o
C2CC
c2ncccc2
c2cs
n1cn
CC(C)(C)OC(=O)N1CCN(
c2o
)CC3)
CCC(=O)N
CN(C)C(=O)
OC2
=C1
CCCl
c2F)
cnc4
c2cccc(N
c2cccc(C(F)(F)F)
c2c(C
)c([N+](=O)[O-]
n2cn
c1ccc(O)
c1cc2c(
c3ccc(O
COC(=O)c1
c2ccc(O)cc
CC(C)(O)
C[C@H](O)
COc1n
)c(Cl)c3
Cc1cc(-
CN(CC
C2)
CCOC(=O)c1n
CCC(O)
c(C(F)(F)F)c1
OC(
COc1cc(C
=S)N
c23)cc1
O=C(O)C1
n1)
C(=N
c1cc(C(F)(F)F)cc(C(F)(F)F)c1
O2
c2cc(-c3cc
c2cccc(-
c3ccc(F)cc3
CCC(C)
OCc2ccccc2)
)cc2)c1
(Cl)cc
(CC(C
cnc2c1
c(Cl)cn
c4c3
C1CCCCC1
)c2)CC1
)C(=O)OC
nc(C)
2CCN(C(=O)
OCCOCC
s2)
[nH]c2c1
Cc1cc(C
Cc1ccc(C
c(=O)n(C
c3ccc(C
c(Cl)c3
2CCCC2)
c3[nH]
c2ccccc2)n1
OB(O)
CBr
cc4
[C@H](OC
c2c(cc
CCN(C)C
C[C@H]2
c(O)cc
CCN(C(=O)OC(C)(C)C)CC1
COc1ccc(N
c2c(C)cc
)ccn1
c1cc(Cl)ccc1
c1cccs1
ncc3
c2cc(F)
CC(=O)NC
)cn2
3CCOCC3)
)c12
COC(=O)c1ccc(C
C[Si](C)(C)
CCCCl
c3ccc(F)
[n+]
c3ccc(-
c2ccc(Br)cc2
O=C(OC
(CC1)
[C@H]1O
c3ccccc3)C
COC(=O)CC
3)CC2)cc1
)c(O)
COCCO
(CCCC)
CCNC1
cn2)
C[C@H](N
[C@H]3CC
c1cccc(Br)c1
(c2ccc(Cl)cc2)
CCNC
